#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Thumbnails

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimBP_Thumbnails_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Thumbnails.AnimBP_Thumbnails_C
// 0x00A0 (0x0420 - 0x0380)
class UAnimBP_Thumbnails_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct AnimBP_Thumbnails::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;            // 0x0388(0x0010)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0398(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03A0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03A8(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x03C8(0x0050)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Thumbnails_AnimGraphNode_SequenceEvaluator_4533794847A308E6EAE7E1A5327B6F63();
	void ExecuteUbergraph_AnimBP_Thumbnails(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AnimBP_Thumbnails_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimBP_Thumbnails_C")
	}
	static class UAnimBP_Thumbnails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Thumbnails_C>();
	}
};
DUMPER7_ASSERTS_UAnimBP_Thumbnails_C;

}

