#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BallShootSFX_Struct

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct BallShootSFX_Struct.BallShootSFX_Struct
// 0x0048 (0x0048 - 0x0000)
struct FBallShootSFX_Struct final
{
public:
	TArray<class UAkAudioEvent*>                  ShootEvent_6_F9ADAA4A406FA546C2DB10AA74391027;     // 0x0000(0x0010)(Edit, BlueprintVisible)
	bool                                          CheckMagnus_16_50711AAE41C24E01CA491DB37B233D09;   // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CheckHeight_12_3D44AD0142B8E2FEDFA1BA8A41053DC0;   // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          ShootHeadEvent_17_3887F2AC425EBF9F6742A28BE508AFDE; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          OverridePowerRTPC_23_E406D17E45E7E55921A4BF989F412BE1; // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        OverrideRTPCValue_26_576F88E947693BCD590B62969FB4C39C; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAkAudioEvent*>                  SFXEvent_19_4E38D2634BB29E0197B2BD9CB278B7F3;      // 0x0030(0x0010)(Edit, BlueprintVisible)
	bool                                          PlaySFXLocallyOnly_10_FEAB768648766176C16BEFB5DD51AD9A; // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SetBallSpeedOnPlayer_28_98C865664E279778304B55A9B54F986F; // 0x0041(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CheckAimed_30_7902634A42C113D14F7E108D2559C458;    // 0x0042(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FBallShootSFX_Struct;

}

