#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_2RailLDCameraActor

#include "Basic.hpp"

#include "BP_1RailLDCameraActor_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_2RailLDCameraActor.BP_2RailLDCameraActor_C
// 0x0050 (0x0DC0 - 0x0D70)
#pragma pack(push, 0x1)
class alignas(0x10) ABP_2RailLDCameraActor_C : public ABP_1RailLDCameraActor_C
{
public:
	uint8                                         Pad_D64[0x4];                                      // 0x0D64(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineComponent*                       TargetRail2;                                       // 0x0D68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       CameraRail2;                                       // 0x0D70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       SplineRefActor2;                                   // 0x0D78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentTime2;                                      // 0x0D80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DebugTime2;                                        // 0x0D88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DampingFactor2;                                    // 0x0D90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLockCameraRail2;                                  // 0x0D98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D99[0x7];                                      // 0x0D99(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LockCurrentTime2;                                  // 0x0DA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Current_Framing_System_Time_2;                     // 0x0DA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DrawDebugSpline2;                                  // 0x0DB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateTimeAndSplineLookAtActor(double DeltaTime);
	void UpdateTimeAndSplineFollowActor(double DeltaTime);
	void UpdateCameraPositionAndLookAt(double DeltaTime);
	void ScrubDebugTime();
	void GlobalDebug();
	void GetDebugTime2(double* DebugTime2_0);
	void DrawDebug2(double Time1, double Time2, struct FVector* TargetPos);

	float GetCurrentTime2() const;
	void GetCurrentFramingSystemTime2(double* Current_Framing_System_Time_2_0) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_2RailLDCameraActor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_2RailLDCameraActor_C")
	}
	static class ABP_2RailLDCameraActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_2RailLDCameraActor_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_ABP_2RailLDCameraActor_C;

}

