#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Anim_ShakeCam_Notify

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Anim_ShakeCam_Notify.BP_Anim_ShakeCam_Notify_C
// 0x0030 (0x0068 - 0x0038)
class UBP_Anim_ShakeCam_Notify_C final : public UAnimNotify
{
public:
	double                                        In_Multiplier;                                     // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 In_Shake_Class;                                    // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECameraShakePlaySpace                         In_Shake_Play_Space;                               // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               In_User_Shake_Rotation;                            // 0x0050(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, const struct FAnimNotifyEventReference& EventReference) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Anim_ShakeCam_Notify_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Anim_ShakeCam_Notify_C")
	}
	static class UBP_Anim_ShakeCam_Notify_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Anim_ShakeCam_Notify_C>();
	}
};
DUMPER7_ASSERTS_UBP_Anim_ShakeCam_Notify_C;

}

