#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BallVFXComponent

#include "Basic.hpp"

#include "Runtime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BallVFXComponent.BP_BallVFXComponent_C
// 0x01D0 (0x0288 - 0x00B8)
class UBP_BallVFXComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABall*                                  Owner;                                             // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ARuntimeCharacter*                      As_Runtime_Character;                              // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ShootNormalizedDirection;                          // 0x00D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBallTrajectoryResult                  ShootTrajectory;                                   // 0x00E8(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class ABP_BounceLocationFeedback_C*>   BounceImpactLocationArray;                         // 0x0158(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UNiagaraComponent*                      ShootGrass;                                        // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           AccelerationTimeTimerHandle;                       // 0x0170(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Shoot_Params_Shoot_Type_Tag_Container;             // 0x0178(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UNiagaraSystem*                         ShootLowVFX;                                       // 0x0198(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           HardDefenseTimer;                                  // 0x01A0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         HardDefenseSystemTemplate;                         // 0x01A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_HardDefense;                                    // 0x01B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Callout;                                        // 0x01B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ShootLocationSpawn;                                // 0x01C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CharacterRotate;                                   // 0x01D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                Shoot_Params_Velocity;                             // 0x01F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         ShootHighVFX;                                      // 0x0208(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         ShootMidVFX;                                       // 0x0210(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         FreezeFrame;                                       // 0x0218(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      PendingShootImpact;                                // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ShootImpactOneFrameDelay;                          // 0x0228(0x0008)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ShootImpactFreezeFrameDelay;                       // 0x0230(0x0008)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Impact_Normal;                                     // 0x0238(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Impact_Point;                                      // 0x0250(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Impact_Shoot;                                   // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitGameplayTagAdded*     ShootCalloutAsyncAction;                           // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitGameplayTagAdded*     Dribble_Callout_Async_Action;                      // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitGameplayTagAdded*     Feinted_Dribble_Callout_Async_Action;              // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Added_15316E7A43AB5687A887C2B77D92E068();
	void Added_F989450F4C16D76F2DBF9CB46D00BD34();
	void Added_FA16938449A5BA2F0EF082B00112ACB3();
	void BounceLocationSubtractID();
	void CancelHardDefenseFX();
	void CleanAsyncAction();
	void ClearPreviousShootImpact();
	void ClearTimer();
	void Deactivate_All_Bounce_Location_VFX();
	void ExecuteUbergraph_BP_BallVFXComponent(int32 EntryPoint);
	double Exlude_Lower_Values_and_Remap_to_0_1(double Value, double Min);
	void GetAccelerationTime(double* Value);
	void LaunchHardDefenseFX(double StatusUntilTime, double CurrentTime);
	void OnBallOwnershipChanged(class UBallPlayersInteractionComponent* _ballPlayerInteraction);
	void OnBounced(class ABall* _ball, const struct FBounceData& _bounceData, float _fSpeedAtBounce);
	void OnRejectedShoot(const struct FShootParams& _shootParams);
	void OnShoot(class ABall* _ball, const struct FShootParams& _shootParams);
	void OnTrajectoryCleared();
	void OnTrajectoryUpdated(const class ABall* _ball, const struct FShootParams& _shootParams);
	void PausePendingShootImpact();
	void PlaceBounceLocationVFX();
	void PlayShootGrassVFX();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void Rotate_Ball_Along_trajectory(int32 trajectory_Split_Index);
	void SelectNSImpact(class UNiagaraComponent* NiagaraSystemComponent, const struct FGameplayTagContainer& TagContainer, bool* Success);
	void SetBounceVFX(int32 VFXID, const struct FVector& Position, const struct FVector& Normal, double Time, double PathDuration);
	void Setup_Frozen_Shoot_Impact(class UNiagaraComponent* InVFXComp, double InFreezeFrameDuration);
	void SetupStatusFX();
	void UnbindBallEvents();
	void UnpausePendingShootImpact();
	void WallBounce();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_BallVFXComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_BallVFXComponent_C")
	}
	static class UBP_BallVFXComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_BallVFXComponent_C>();
	}
};
DUMPER7_ASSERTS_UBP_BallVFXComponent_C;

}

