#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Ball

#include "Basic.hpp"

#include "Runtime_classes.hpp"
#include "SCCharacterCustomization_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SCCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Ball.BP_Ball_C
// 0x01E0 (0x05A0 - 0x03C0)
class ABP_Ball_C : public ABall
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USCActorOptimizerComponent*             SCActorOptimizer;                                  // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_BallLost;                                       // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_BallControl;                                    // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_BallOutlineOpaqueMesh;                          // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_BallDropShadow;                                 // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_BallTrailBall;                                  // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_BallRenderingComponent_C*           BP_BallRenderingComponent;                         // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_UI_CameraLock;                                  // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Ball;                                           // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtboxComponent*                      Hurtbox;                                           // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtboxSolverComponent*                HurtboxSolver;                                     // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_BallVFXComponent_C*                 BP_BallVFXComponent;                               // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_BallSoundComponent_C*               BP_BallSoundComponent;                             // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         PowerShootVFX;                                     // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FExtraAssetEnumHandler                 PowerShootEnum;                                    // 0x0448(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash)
	class UGameplayEffect*                        In_Gameplay_Effect;                                // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         JustShotDuration;                                  // 0x04B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B4[0x4];                                      // 0x04B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARuntimeCharacter*                      LocalPlayerCharacter;                              // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCharacterCustomizationComponent*       Character_Custo_Component;                         // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastLagLocation;                                   // 0x04C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastLagVelocity;                                   // 0x04E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VelocityConsideredAs100Prct;                       // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatInterval                         MinMaxLagSpeedFactor;                              // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraLockBallService*                 LockBallCameraService;                             // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  TapTags;                                           // 0x0510(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  ShootTags;                                         // 0x0530(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  Lob_Tags;                                          // 0x0550(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ARuntimeCharacter*                      PlayerApplyingBallCustomization;                   // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        CloseTargetTimeDelta;                              // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SameDistanceToTargetDelta;                         // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasVolleyBeenClaimed;                              // 0x0588(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldHideHUDBallIndicator;                       // 0x0589(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseCustomBallMaterial;                             // 0x058A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58B[0x5];                                      // 0x058B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CustomBallMaterial;                                // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           PlayerStateWaitingPawn;                            // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AnimateRoll();
	void Apply_Captain_Custo(class ARuntimeMatchGameState* _gameState);
	void ApplyLastScorerCusto(class ARuntimeMatchGameState* _gameState, bool* _bHasLastScorer);
	void Ball_Control_VFX();
	void BindServiceState();
	void BndEvt__BP_Ball_m_BallPhysicComponent_K2Node_ComponentBoundEvent_1_OnShootSignature__DelegateSignature(const class ABall* _ball, const struct FShootParams& _shootParams);
	void BndEvt__BP_Ball_m_BallPlayerInteractionComponent_K2Node_ComponentBoundEvent_2_OnNewBallInteractionRequest__DelegateSignature(class UBallPlayersInteractionComponent* _ballPlayerInteraction);
	void BndEvt__BP_Ball_m_BallPlayerInteractionComponent_K2Node_ComponentBoundEvent_3_OnOwnershipChanged__DelegateSignature(class UBallPlayersInteractionComponent* _ballPlayerInteraction);
	void BndEvt__BP_Ball_NS_BallTrailBall_K2Node_ComponentBoundEvent_0_OnNiagaraSystemFinished__DelegateSignature(class UNiagaraComponent* PSystem);
	void CompareRequests(const struct FBallInteractionRequestData& RequestData, const struct FBallInteractionRequestData& ComparedData, bool* HasAdvantage);
	void ExecuteUbergraph_BP_Ball(int32 EntryPoint);
	void OnCharacterCustomizationGenerated(class UCharacterCustomizationComponent* _Character_Customization_Component, bool _bWasCharacterGenerated);
	void OnGoalHistoryReplicated();
	void OnLockBallStateUpdate(EServiceStateUpdate eStateUpdate);
	void OnMatchStateChanged(class FName _newMatchState);
	void OnPawnSet(class APlayerState* Player, class APawn* NewPawn, class APawn* OldPawn);
	void OnPlayerAdded(class APlayerState* _PlayerStateAdded);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void RegisterToHUD(class UHUD_Widget* _HUD);
	void SetPlayerApplyingBallCustomization(class ARuntimeCharacter* _playerCharacter, bool _bBind);
	void SetupBallCustomization();
	void UnbindBallCustomization();
	void UnbindServiceState();
	void UpdateBallCusto();
	void UpdateBallMPC(float _fDeltaTime);
	void UserConstructionScript();
	void WaitForPlayerStatePawn(class APlayerState* _playerState);

	double GetLagSpeedfactor(double VelocityPrct) const;
	double GetVelocityPrct() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Ball_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Ball_C")
	}
	static class ABP_Ball_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Ball_C>();
	}
};
DUMPER7_ASSERTS_ABP_Ball_C;

}

