#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Binder_GoalSave

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Runtime_structs.hpp"
#include "Runtime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Binder_GoalSave.BP_Binder_GoalSave_C
// 0x01B8 (0x0320 - 0x0168)
class UBP_Binder_GoalSave_C final : public UShootBinder
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0168(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AGoal*                                  m_GoalAimed;                                       // 0x0170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagQuery                      m_InteracterTagQuery;                              // 0x0178(0x0048)(Edit, BlueprintVisible)
	struct FShootParams                           LastShootParams;                                   // 0x01C0(0x0108)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          m_bOnlyTriggerOnEnemyShot;                         // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      m_InteracterShootQuery;                            // 0x02D0(0x0048)(Edit, BlueprintVisible)
	bool                                          m_bOnlyShoot;                                      // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPE_DisableFromGameState(class AGameStateBase* _gameState);
	void BPE_OnBallRegistered(class ABall* _ball);
	void BPE_OnBallUnregistered(class ABall* _ball);
	void BPE_OnIsActiveChanged(bool _IsActive);
	void BPE_OnShoot(const class ABall* _ball, const struct FShootParams& _shootParams);
	void BPE_OnShootBinderTriggered(const class ABall* _ball, const struct FShootParams& _shootParams, class AGoal* _goalAimed);
	void BPE_Reset();
	void ExecuteUbergraph_BP_Binder_GoalSave(int32 EntryPoint);
	void HandleBallInteractionReceived(class ABall* Ball, class ARuntimePlayerState* Interacter, const struct FShootParams& CurrentShootParams, const struct FShootParams& LastShootParams_0);
	void OnInteraction(class UBallPlayersInteractionComponent* _ballPlayerInteraction);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Binder_GoalSave_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Binder_GoalSave_C")
	}
	static class UBP_Binder_GoalSave_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Binder_GoalSave_C>();
	}
};
DUMPER7_ASSERTS_UBP_Binder_GoalSave_C;

}

