#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Binder_BallAnyOwnerChanged

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Runtime_structs.hpp"
#include "Runtime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Binder_BallAnyOwnerChanged.BP_Binder_BallAnyOwnerChanged_C
// 0x0298 (0x03A8 - 0x0110)
#pragma pack(push, 0x1)
class alignas(0x08) UBP_Binder_BallAnyOwnerChanged_C : public UBallInteractionBinder
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0110(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        m_fCurrentTime;                                    // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        m_fPreviousTime;                                   // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FShootParams                           m_PreviousShootParams;                             // 0x0128(0x0108)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	double                                        m_fMaxDurationBetweenInteractions;                 // 0x0230(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagQuery                      ShootTypeQuery;                                    // 0x0238(0x0048)(Edit, BlueprintVisible)
	struct FGameplayTagQuery                      PreviousOwnerTagQuery;                             // 0x0280(0x0048)(Edit, BlueprintVisible)
	struct FGameplayTagQuery                      OldPreviousTagQuery;                               // 0x02C8(0x0048)(Edit, BlueprintVisible)
	struct FGameplayTagQuery                      m_PreviousShootTypeQuery;                          // 0x0310(0x0048)(Edit, BlueprintVisible)
	struct FGameplayTagQuery                      CurrentOwnerQuery;                                 // 0x0358(0x0048)(Edit, BlueprintVisible)
	bool                                          m_bIgnoreKickOff;                                  // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          m_bOnlyOnTeamChanged;                              // 0x03A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPE_OnBallInteraction(class UBallPlayersInteractionComponent* _ballPlayersInteraction, EBallInteractionType _eBallInteractionType);
	void BPE_Reset();
	bool Can_Trigger(class UBallPlayersInteractionComponent* BallPlayersInteraction, const struct FShootParams& ShootParams, EBallInteractionType _eBallInteractionType);
	void ExecuteUbergraph_BP_Binder_BallAnyOwnerChanged(int32 EntryPoint);
	void OnAnyOwnersChanged(class UBallPlayersInteractionComponent* _ballPlayersInteraction, EBallInteractionType _eBallInteractionType);
	void PrepareData(class UBallPlayersInteractionComponent* _ballPlayersInteraction, EBallInteractionType _eBallInteractionType);
	void SaveCurrentTime();
	void SetPrevious(class UBallPlayersInteractionComponent* _ballPlayersInteraction);

	void CheckPlayerTags(class ARuntimePlayerState* _playerState, const struct FGameplayTagQuery& _tagQuery, bool* QueryResult) const;
	bool CheckTagsOrQueryEmpty(const struct FGameplayTagContainer& TagContainer, const struct FGameplayTagQuery& TagQuery) const;
	class ARuntimePlayerState* GetPreviousInteracter(class UBallPlayersInteractionComponent* BallPlayersInteraction, EBallInteractionType BallInteractionType, int32 _iIndexInteracter) const;
	bool HasTeamInfluenceChanged(class UBallPlayersInteractionComponent* _ballPlayersInteraction, EBallInteractionType _eBallInteractionType) const;
	bool IsCorrectPass() const;
	bool IsKickOff(class UBallPlayersInteractionComponent* _ballPlayersInteraction, EBallInteractionType _eBallInteractionType) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Binder_BallAnyOwnerChanged_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Binder_BallAnyOwnerChanged_C")
	}
	static class UBP_Binder_BallAnyOwnerChanged_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Binder_BallAnyOwnerChanged_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UBP_Binder_BallAnyOwnerChanged_C;

}

