#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Binder_GoalSave

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Runtime_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_Binder_GoalSave.BP_Binder_GoalSave_C.BPE_DisableFromGameState
// 0x0008 (0x0008 - 0x0000)
struct BP_Binder_GoalSave_C_BPE_DisableFromGameState final
{
public:
	class AGameStateBase*                         _gameState;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Binder_GoalSave_C_BPE_DisableFromGameState;

// Function BP_Binder_GoalSave.BP_Binder_GoalSave_C.BPE_OnBallRegistered
// 0x0008 (0x0008 - 0x0000)
struct BP_Binder_GoalSave_C_BPE_OnBallRegistered final
{
public:
	class ABall*                                  _ball;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Binder_GoalSave_C_BPE_OnBallRegistered;

// Function BP_Binder_GoalSave.BP_Binder_GoalSave_C.BPE_OnBallUnregistered
// 0x0008 (0x0008 - 0x0000)
struct BP_Binder_GoalSave_C_BPE_OnBallUnregistered final
{
public:
	class ABall*                                  _ball;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Binder_GoalSave_C_BPE_OnBallUnregistered;

// Function BP_Binder_GoalSave.BP_Binder_GoalSave_C.BPE_OnIsActiveChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_Binder_GoalSave_C_BPE_OnIsActiveChanged final
{
public:
	bool                                          _IsActive;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Binder_GoalSave_C_BPE_OnIsActiveChanged;

// Function BP_Binder_GoalSave.BP_Binder_GoalSave_C.BPE_OnShoot
// 0x0110 (0x0110 - 0x0000)
struct BP_Binder_GoalSave_C_BPE_OnShoot final
{
public:
	const class ABall*                            _ball;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FShootParams                           _shootParams;                                      // 0x0008(0x0108)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_BP_Binder_GoalSave_C_BPE_OnShoot;

// Function BP_Binder_GoalSave.BP_Binder_GoalSave_C.BPE_OnShootBinderTriggered
// 0x0118 (0x0118 - 0x0000)
struct BP_Binder_GoalSave_C_BPE_OnShootBinderTriggered final
{
public:
	const class ABall*                            _ball;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FShootParams                           _shootParams;                                      // 0x0008(0x0108)(BlueprintVisible, BlueprintReadOnly, Parm)
	class AGoal*                                  _goalAimed;                                        // 0x0110(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Binder_GoalSave_C_BPE_OnShootBinderTriggered;

// Function BP_Binder_GoalSave.BP_Binder_GoalSave_C.ExecuteUbergraph_BP_Binder_GoalSave
// 0x03A8 (0x03A8 - 0x0000)
struct BP_Binder_GoalSave_C_ExecuteUbergraph_BP_Binder_GoalSave final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class ABall*                            K2Node_Event__ball_2;                              // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FShootParams                           K2Node_Event__shootParams;                         // 0x0010(0x0108)()
	class AGoal*                                  K2Node_Event__goalAimed;                           // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABall*                                  K2Node_Event__ball_1;                              // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBallPlayersInteractionComponent*       K2Node_CustomEvent__ballPlayerInteraction;         // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABall*                                  K2Node_Event__ball;                                // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABall*                                  CallFunc_BPF_GetBall_ReturnValue;                  // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayerBallOwnership*                   CallFunc_BPF_GetInteracter_ReturnValue;            // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FShootParams                           CallFunc_BPF_GetCurrentShootParams_ReturnValue;    // 0x0148(0x0108)(ConstParm)
	class ARuntimePlayerState*                    CallFunc_BPF_GetPlayerState_ReturnValue;           // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class ABall*                            K2Node_Event__ball_3;                              // 0x0258(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FShootParams                           K2Node_Event__shootParams_1;                       // 0x0260(0x0108)()
	bool                                          K2Node_Event__IsActive;                            // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         K2Node_Event__gameState;                           // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARuntimePlayerState*                    K2Node_DynamicCast_AsRuntime_Player_State;         // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x3];                                      // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UBallPlayersInteractionComponent* _ballPlayerInteraction)> K2Node_CreateDelegate_OutputDelegate; // 0x0394(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Binder_GoalSave_C_ExecuteUbergraph_BP_Binder_GoalSave;

// Function BP_Binder_GoalSave.BP_Binder_GoalSave_C.HandleBallInteractionReceived
// 0x0308 (0x0308 - 0x0000)
struct BP_Binder_GoalSave_C_HandleBallInteractionReceived final
{
public:
	class ABall*                                  Ball;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARuntimePlayerState*                    Interacter;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FShootParams                           CurrentShootParams;                                // 0x0010(0x0108)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FShootParams                           LastShootParams_0;                                 // 0x0118(0x0108)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTagQueryEmpty_ReturnValue;              // 0x0222(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_223[0x5];                                      // 0x0223(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetExplicitGameplayTags_ReturnValue;      // 0x0230(0x0020)(ConstParm)
	bool                                          CallFunc_DoesContainerMatchTagQuery_ReturnValue;   // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_252[0x6];                                      // 0x0252(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn_1;                       // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARuntimePlayerState*                    K2Node_DynamicCast_AsRuntime_Player_State;         // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_BPF_GetTeam_ReturnValue;                  // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0282(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0283(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTagQueryEmpty_ReturnValue_1;            // 0x0285(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesContainerMatchTagQuery_ReturnValue_1; // 0x0286(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0287(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_BPF_GetTeam_ReturnValue_1;                // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GoalCollisionGetter_C> K2Node_DynamicCast_AsBPI_Goal_Collision_Getter; // 0x0290(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBoxComponent*                          CallFunc_GetGoalCollision_GoalCollision;           // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Ball_Aimed_In_Goal_Collision_bIsAimed; // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B2[0x6];                                      // 0x02B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPredictProjectilePathPointData        CallFunc_Is_Ball_Aimed_In_Goal_Collision_PointDetectedInGoalCollision; // 0x02B8(0x0038)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerState*>                   Temp_object_Variable;                              // 0x02F8(0x0010)(ConstParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_Binder_GoalSave_C_HandleBallInteractionReceived;

// Function BP_Binder_GoalSave.BP_Binder_GoalSave_C.OnInteraction
// 0x0008 (0x0008 - 0x0000)
struct BP_Binder_GoalSave_C_OnInteraction final
{
public:
	class UBallPlayersInteractionComponent*       _ballPlayerInteraction;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Binder_GoalSave_C_OnInteraction;

}

