#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BallSpawnerState

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_BallSpawnerState.BP_BallSpawnerState_C.BPE_EnteringFlowState
// 0x0010 (0x0010 - 0x0000)
struct BP_BallSpawnerState_C_BPE_EnteringFlowState final
{
public:
	class USCGameFlowSubsystem*                   _gameFlowSubsystem;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class USCGameFlowState*                 PreviousState;                                     // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_BallSpawnerState_C_BPE_EnteringFlowState;

// Function BP_BallSpawnerState.BP_BallSpawnerState_C.BPE_ExitingFlowState
// 0x0018 (0x0018 - 0x0000)
struct BP_BallSpawnerState_C_BPE_ExitingFlowState final
{
public:
	class USCGameFlowSubsystem*                   _gameFlowSubsystem;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class USCGameFlowState*                 _nextState;                                        // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          _bIsBackTracking;                                  // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_BallSpawnerState_C_BPE_ExitingFlowState;

// Function BP_BallSpawnerState.BP_BallSpawnerState_C.ExecuteUbergraph_BP_BallSpawnerState
// 0x0068 (0x0068 - 0x0000)
struct BP_BallSpawnerState_C_ExecuteUbergraph_BP_BallSpawnerState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USCGameFlowSubsystem*                   K2Node_Event__gameFlowSubsystem_1;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class USCGameFlowState*                 K2Node_Event_previousState;                        // 0x0010(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USCGameFlowSubsystem*                   K2Node_Event__gameFlowSubsystem;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class USCGameFlowState*                 K2Node_Event__nextState;                           // 0x0020(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event__bIsBackTracking;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARuntimeGameMode*                       K2Node_DynamicCast_AsRuntime_Game_Mode;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABall*>                          CallFunc_BPF_SpawnBalls_ReturnValue;               // 0x0048(0x0010)(ReferenceParm)
	class ABall*                                  CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_BallSpawnerState_C_ExecuteUbergraph_BP_BallSpawnerState;

}

