#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BallSoundComponent

#include "Basic.hpp"

#include "BallShootSFX_Struct_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Runtime_structs.hpp"
#include "AkAudio_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BallSoundComponent.BP_BallSoundComponent_C
// 0x0328 (0x03E0 - 0x00B8)
class UBP_BallSoundComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABall*                                  Owner;                                             // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ARuntimeCharacter*                      BallShooter;                                       // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           DopplerTimerHandle;                                // 0x00D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	ESimulationStep                               PreviousSimulation_Step;                           // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundSurfaceDataAsset_C*               SurfaceDataAsset;                                  // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FBallTrajectoryResult                  ShootTrajectory;                                   // 0x00E8(0x0068)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FTimerHandle                           NoControlTimer;                                    // 0x0150(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           NoVolleyTimer;                                     // 0x0158(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           NoTackleTimer;                                     // 0x0160(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           HardDefenseTimer;                                  // 0x0168(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          BallStopped;                                       // 0x0170(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBallShootSFXDataAsset_C*               BallShootTypeSFX;                                  // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        HeightThreshold;                                   // 0x0180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        KneeThreshold;                                     // 0x0188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ChestThreshold;                                    // 0x0190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BallSpeedRTPCValue;                                // 0x0198(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBallShootSFX_Struct                   ShootTag;                                          // 0x01A0(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsOwned;                                           // 0x01E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaxRangeAimedShootFadeOut;                         // 0x01F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxAimedInterpolationRTPC;                         // 0x01F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FShootParams                           LastShootParam;                                    // 0x0200(0x0108)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         FreezeSFXDelay;                                    // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           TimerStopSFX;                                      // 0x0310(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 FreezeSFXPlaying_ID;                               // 0x0318(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAkAudioEvent*>                  FreezeSFXEvent_Ref;                                // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class AActor*>                         FreezeSFXActor;                                    // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FGameplayTagContainer                  TagsToPlayRejectedShootSFX;                        // 0x0348(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UGameplayTask_WaitDelay*                OnBallOwnershipChangedTask;                        // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          CanRetriggerBallOwnershipChanged;                  // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPredictProjectilePathPointData        Point_Detected_in_Goal_Collision;                  // 0x0378(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FGameplayTagContainer                  BypassOwnGoalTag;                                  // 0x03B0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         CurrentWhooshPlayingID;                            // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          BallRollWhooshEvent;                               // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AddSFXFreezeFrameInfos(const int32& PlayingID, const class UAkAudioEvent*& EventRef, const class AActor*& Actor);
	void Bounce_SFX(const struct FVector& BounceLocation, const struct FVector& BounceNormal, double BallSpeed, class UPhysicalMaterial* Material);
	void CancelHardDefenseFX();
	void CancelNoControlFX();
	void CancelNoTackleFX();
	void CancelNoVolleyFX();
	void ClearBindings();
	void ClearSFXFreezeFrame();
	void ClearTimers();
	void ClearVariables();
	void DopplerProcessing(double* DopplerValue);
	void ExecuteUbergraph_BP_BallSoundComponent(int32 EntryPoint);
	void GetAccelerationTime(double* AccelerationDuration);
	void GetSFXFreezeFrameAtIndex(int32 Index_0, class UAkAudioEvent** EventRef, class AActor** Actor, int32* PlayingID, bool* IsValid);
	void LaunchHardDefenseFX(double StatusUntilTime, double CurrentTime);
	void LaunchNoControlFX(double StatusUntilTime, double CurrentTime);
	void LaunchNoTackleFX(double StatusUntilTime, double CurrentTime);
	void LaunchNoVolleyFX(double StatusUntilTime, double CurrentTime);
	void OnBallOwnershipChanged(class UBallPlayersInteractionComponent* _ballPlayerInteraction);
	void OnBallRotation(const struct FQuat& _rotation);
	void OnBounced(class ABall* _ball, const struct FBounceData& _bounceData, float _fSpeedAtBounce);
	void OnGoalScored(const struct FGoalDescription& GoalDesciprtion);
	void OnRejectedShoot(const struct FShootParams& _shootParams);
	void OnShoot(class ABall* _ball, const struct FShootParams& _shootParams);
	void OnTrajectoryCleared();
	void OnTrajectoryUpdated(const class ABall* _ball, const struct FShootParams& _shootParams);
	void PlayShootTypeSFX(const struct FShootParams& ShootParam, int32* PlayingID, class UAkAudioEvent** EventRef, class AActor** Actor);
	void ProcessDoppler();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void Set_Magnus_RTPC(const struct FVector& RotationMagnus);
	void SetBallControlLocation(class ARuntimeCharacter* BallOwner);
	void SetBallState();
	void ShootFreezeOver(class ABall* _ball, const struct FBounceData& _bounceData, float _fSpeedAtBounce);
	void StopUnresumedSFX();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_BallSoundComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_BallSoundComponent_C")
	}
	static class UBP_BallSoundComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_BallSoundComponent_C>();
	}
};
DUMPER7_ASSERTS_UBP_BallSoundComponent_C;

}

