#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BaseGoal

#include "Basic.hpp"

#include "Runtime_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BaseGoal.BP_BaseGoal_C
// 0x0108 (0x0420 - 0x0318)
class ABP_BaseGoal_C : public AGoal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_GoalInvincibility_Deactivation;                 // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_GoalInvincibility;                              // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Goal;                                           // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_GoalBurst_Wave;                                 // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Deactivation_Goal_GoalInvulnerable_1730CC434B1C0632E2AF4AA3403685F9; // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_Deactivation_Goal__Direction_1730CC434B1C0632E2AF4AA3403685F9; // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34D[0x3];                                      // 0x034D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_Deactivation_Goal;                        // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         GoalWave_Timeline_Wave_Intensity_6E0D6948420D4CC478D13783F759F6D7; // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GoalWave_Timeline_Wave_6E0D6948420D4CC478D13783F759F6D7; // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            GoalWave_Timeline__Direction_6E0D6948420D4CC478D13783F759F6D7; // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     GoalWave_Timeline;                                 // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Goal_Celebration_Animation_0362E0684077E8F761A73E9B24E6E4C8; // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_0362E0684077E8F761A73E9B24E6E4C8; // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_375[0x3];                                      // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnPointScored;                                     // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        BallRadius;                                        // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GoalCollisionOffset;                               // 0x0398(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UHurtboxSolverComponent*>        PendingHurtboxs;                                   // 0x03A0(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference)
	class ABall*                                  Scoring_Ball;                                      // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  OnScoreBallTags;                                   // 0x03B8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	bool                                          ScoringTick;                                       // 0x03D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARuntimeGameState*                      As_Runtime_Game_State;                             // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ARuntimeGameState*                      ReplayGameState;                                   // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   NS_GoalLifetime;                                   // 0x03F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Score_Amount;                                      // 0x03F8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FC[0x4];                                      // 0x03FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           DelayTimerHandle;                                  // 0x0400(0x0008)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             NetMaterials;                                      // 0x0408(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	class UStaticMesh*                            GoalMesh;                                          // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AfterScoredGoal(class ABall* ScoringBall);
	void BPE_OnDisplayGoalScored_Event(const struct FGoalDescription& _goalDescription);
	bool CheckGoalRules(class UHurtboxSolverComponent* Hurtbox_Solver_Component, class ABall* Scoring_Ball_0);
	void ExecuteUbergraph_BP_BaseGoal(int32 EntryPoint);
	void GetRuntimePlayerStateFromBall(class ABall* Scoring_Ball_0, class ARuntimePlayerState** Runtime_Player_State);
	void Goal_Invincibility_Active(class FName Data_Table_Row_Name);
	void Goal_Invincibility_Deactivation();
	void GoalWave_Timeline__FinishedFunc();
	void GoalWave_Timeline__UpdateFunc();
	void Handle_Score(bool HandleOnScoreBallTags);
	void InitGoal();
	void OnBallRegistered(class ABall* _ball);
	void OnCollisionComponentBeginOverlap(class AActor* InOtherActor);
	void OnCollisionComponentEndOverlap(class AActor* InOtherActor);
	void OnDelayElapsed();
	void OnDisplayReplayGoalBurst(const struct FGoalDescription& _goalDescription);
	void OnReplayFinished();
	void OnReplayStarted();
	void Play_CrowdCelebration();
	void Play_FXGoal();
	void PlayGoalTimelines();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void ScoreGoal(class ABall* InScoringBall, bool HandleScoreBallTags, bool* bPlayVFX);
	void Set_Goal_Position_MPC();
	void SetNiagaraVariables();
	void Stop_SFXGoal();
	void Timeline_Deactivation_Goal__FinishedFunc();
	void Timeline_Deactivation_Goal__UpdateFunc();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();
	void UpdateGoalScoredCollision();
	void UserConstructionScript();

	void BPE_GetCollision(class USceneComponent** _outCollision) const;
	void GetGoalCollision(class UBoxComponent** GoalCollision) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_BaseGoal_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_BaseGoal_C")
	}
	static class ABP_BaseGoal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BaseGoal_C>();
	}
};
DUMPER7_ASSERTS_ABP_BaseGoal_C;

}

