#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BallDynamicOffset_CameraNodeService

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Runtime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BallDynamicOffset_CameraNodeService.BP_BallDynamicOffset_CameraNodeService_C
// 0x0050 (0x0090 - 0x0040)
class UBP_BallDynamicOffset_CameraNodeService_C final : public UCameraNodeServiceRuntimeBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0040(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        InterpSpeed;                                       // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bKeepEntryValue;                                   // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentOffset;                                     // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxVerticalOffset;                                 // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinBallHeightThreshold;                            // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxBallHeight;                                     // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EntryBallHeight;                                   // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DownwardInterpMultiplier;                          // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BallActiveMaxDistance;                             // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddOffsetToInitialCameraOffset(const struct FVector& InitialCameraOffset, double* CorrectedOffset);
	bool BPE_IsServiceActive();
	void BPE_OnUpdateNode(float _fDt, bool _bBlendOut);
	void BPE_PostInit();
	void ComputeOffset(bool KeepEntry, double* Offset);
	void ExecuteUbergraph_BP_BallDynamicOffset_CameraNodeService(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_BallDynamicOffset_CameraNodeService_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_BallDynamicOffset_CameraNodeService_C")
	}
	static class UBP_BallDynamicOffset_CameraNodeService_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_BallDynamicOffset_CameraNodeService_C>();
	}
};
DUMPER7_ASSERTS_UBP_BallDynamicOffset_CameraNodeService_C;

}

