#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Binder_BallInfluence

#include "Basic.hpp"

#include "Runtime_structs.hpp"


namespace SDK::Params
{

// Function BP_Binder_BallInfluence.BP_Binder_BallInfluence_C.BPE_OnBallReset
// 0x0008 (0x0008 - 0x0000)
struct BP_Binder_BallInfluence_C_BPE_OnBallReset final
{
public:
	class UBallPlayersInteractionComponent*       _ballPlayersInteraction;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Binder_BallInfluence_C_BPE_OnBallReset;

// Function BP_Binder_BallInfluence.BP_Binder_BallInfluence_C.Can Trigger
// 0x0130 (0x0130 - 0x0000)
struct BP_Binder_BallInfluence_C_Can_Trigger final
{
public:
	class UBallPlayersInteractionComponent*       BallPlayersInteraction;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FShootParams                           ShootParams;                                       // 0x0008(0x0108)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	EBallInteractionType                          _eBallInteractionType;                             // 0x0110(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          _bIsSamePreviousOwner;                             // 0x0111(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0112(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Can_Trigger_ReturnValue;                  // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARuntimePlayerState*                    CallFunc_BPF_GetNewAndPreviousInteracters__outNewInteracter; // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARuntimePlayerState*                    CallFunc_BPF_GetNewAndPreviousInteracters__outPreviousInteracter; // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Binder_BallInfluence_C_Can_Trigger;

// Function BP_Binder_BallInfluence.BP_Binder_BallInfluence_C.ExecuteUbergraph_BP_Binder_BallInfluence
// 0x0010 (0x0010 - 0x0000)
struct BP_Binder_BallInfluence_C_ExecuteUbergraph_BP_Binder_BallInfluence final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBallPlayersInteractionComponent*       K2Node_Event__ballPlayersInteraction;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Binder_BallInfluence_C_ExecuteUbergraph_BP_Binder_BallInfluence;

// Function BP_Binder_BallInfluence.BP_Binder_BallInfluence_C.PrepareData
// 0x0038 (0x0038 - 0x0000)
struct BP_Binder_BallInfluence_C_PrepareData final
{
public:
	class UBallPlayersInteractionComponent*       _ballPlayersInteraction;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EBallInteractionType                          _eBallInteractionType;                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          _bIsSamePreviousOwner;                             // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARuntimePlayerState*                    CallFunc_BPF_GetNewAndPreviousInteracters__outNewInteracter; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARuntimePlayerState*                    CallFunc_BPF_GetNewAndPreviousInteracters__outPreviousInteracter; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerState*>                   K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ConstParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_Binder_BallInfluence_C_PrepareData;

}

