#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CustomizationSubsystem

#include "Basic.hpp"

#include "Runtime_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CustomizationSubsystem.BP_CustomizationSubsystem_C
// 0x0108 (0x0AD8 - 0x09D0)
class UBP_CustomizationSubsystem_C final : public UCustomizationSubsystem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMap<struct FGameplayTag, class UBP_CustomizationIdToLevelSequence_C*> CustoCameras;             // 0x09D8(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	class UBP_CustomizationAnimListAsset_C*       CustoAnims;                                        // 0x0A28(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ARuntimeCharacter*                      RuntimeCharacter;                                  // 0x0A30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FFloatInterval                         MinMaxIntervalBetweenIdleBreaks;                   // 0x0A38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DefaultSectionName;                                // 0x0A40(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LoopSectionName;                                   // 0x0A48(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   OutSectionName;                                    // 0x0A50(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_CustomizationIdToLevelSequence_C*   DEBUG_Cameras;                                     // 0x0A58(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_CustomizationIdToLevelSequence_C*   CurrentCameraData;                                 // 0x0A60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          UseDebug;                                          // 0x0A68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A69[0x7];                                      // 0x0A69(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CurrentDefaultIdle;                                // 0x0A70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           GoToIdleBreakHandle;                               // 0x0A78(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_CustomizationAnimDataAsset_C*       CurrentAnimData;                                   // 0x0A80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CurrentIdleBreak;                                  // 0x0A88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CurrentIdleOverride;                               // 0x0A90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           OutTimerHandle;                                    // 0x0A98(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      LeftFeetNS;                                        // 0x0AA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      RightFeetNS;                                       // 0x0AA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterMaterialData_C*            VFXMeshData;                                       // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class URematchCharacterCustomizationComponent* custoComponent;                                   // 0x0AB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABall*                                  MenuBall;                                          // 0x0AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bNeedball;                                         // 0x0AC8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC9[0x7];                                      // 0x0AC9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           BlendInTimerHandle;                                // 0x0AD0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ActivateFootVFX(bool _bActivate, bool _bIsLeft, class UNiagaraSystem* _niagaraSystem);
	void BPE_OnGameFlowCustomizationStateChanged(bool _bWasInMenu);
	void BPE_OnGameStateHandleBeginPlay(class ASCGameState* _gameState);
	void BPE_SetCurrentCustomizationIDs(const TArray<struct FSCCustomizationId>& _ids, const TArray<struct FShopItem>& _items);
	void ExecuteUbergraph_BP_CustomizationSubsystem(int32 EntryPoint);
	void GoToOverviewAnim();
	void IdleBreakEnded(class UAnimMontage* Montage, bool bInterrupted);
	void On_Idle_Out_Finished();
	void OnEnterOrLeaveCusto(bool IsEntering);
	void OnIdleBlendINFinished();
	void PlayMontage(class FName SectionName, class UAnimMontage* MontageToPlay, bool IsDefaultIdle);
	void SetAnimation(const struct FSCCustomizationId& _custoId);
	void SetCamera(const struct FSCCustomizationId& _custoId);
	void SetCurrentCustoId(const struct FSCCustomizationId& _custoId);
	void SetCurrentCustoId_CustomContext(const struct FSCCustomizationId& _custoId, class UBP_CustomizationIdToLevelSequence_C* CustomContextIdToSequenceDA);
	void ShowBall(bool _bShow);
	void StartAnimationSystem();
	void StartIdleBreak();
	void StartIdleBreakTimer();
	void Stop_Idle_Override(double* _fOutDuration);
	void StopAnimationSystem();
	void UseAnimData(class UBP_CustomizationAnimDataAsset_C* AnimData);
	void UseOverviewAnimData();
	void WaitForIdleOutEnd(float Time);

	struct FGameplayTag FindMatchingCameraKey() const;
	void GetCameraData(class UBP_CustomizationIdToLevelSequence_C** CustoCameras_0) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CustomizationSubsystem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CustomizationSubsystem_C")
	}
	static class UBP_CustomizationSubsystem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CustomizationSubsystem_C>();
	}
};
DUMPER7_ASSERTS_UBP_CustomizationSubsystem_C;

}

