#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CustomizationUICategoryViewModel

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "SOSBindings_structs.hpp"
#include "Runtime_classes.hpp"
#include "SCCharacterCustomization_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CustomizationUICategoryViewModel.BP_CustomizationUICategoryViewModel_C
// 0x0030 (0x0218 - 0x01E8)
class UBP_CustomizationUICategoryViewModel_C final : public UCustomizationUICategoryViewModel
{
public:
	struct FGameplayTag                           LastUICategorySelected_Tag;                        // 0x01E8(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class UBP_CustomizationUICategoryViewModel_C* PatternsPageVM;                                    // 0x01F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_CustomizationUICategoryViewModel_C* ParametersPageVM;                                  // 0x01F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_CustomizationUICategoryViewModel_C* PaletteToEditCategoryVM;                           // 0x0200(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_CustomizationUICategoryViewModel_C* FaceDetailsVM;                                     // 0x0208(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_ShopItemViewModel_C*                PaletteToEdit;                                     // 0x0210(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void ChildContainsTagSubCategory(const struct FGameplayTag& Tag, bool* HasTag);

	void GetAllSubCatVMFromCatType(ESCCharacterPartParameterTypes ParamType, TArray<class UBP_CustomizationUICategoryViewModel_C*>* ParamVM) const;
	const class UBP_CustomizationUICategoryViewModel_C* GetChildViewModel(const struct FGameplayTag& _UITag) const;
	void GetItemSortedListOwnedFirst(TArray<class UShopItemViewModel*>* SortedItemList) const;
	void GetPalettesWithCreatedPalettes(TArray<class UShopItemViewModel*>* Items) const;
	void GetSortedItemListByRarity(TArray<class UShopItemViewModel*>& ListToSort, TArray<class UShopItemViewModel*>* SortedList) const;
	void GetSubCatVMFromCatType(ESCCharacterPartParameterTypes ParamType, class UBP_CustomizationUICategoryViewModel_C** ParamVM) const;
	void GetViewModelFromIndex(int32 _iIndex, class UCustomizationUICategoryViewModel** Output) const;
	void Recursive_Is_Any_Child_Available(class UBP_CustomizationUICategoryViewModel_C* ParentCategory, bool UnavailableCatPreviouslyFound, bool* UnavailableCatFound) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CustomizationUICategoryViewModel_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CustomizationUICategoryViewModel_C")
	}
	static class UBP_CustomizationUICategoryViewModel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CustomizationUICategoryViewModel_C>();
	}
};
DUMPER7_ASSERTS_UBP_CustomizationUICategoryViewModel_C;

}

