#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterVFXComponent

#include "Basic.hpp"

#include "SCCharacterCustomization_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "EVFXFootSide_structs.hpp"
#include "EFootStepFXSize_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CharacterVFXComponent.BP_CharacterVFXComponent_C
// 0x0128 (0x01E0 - 0x00B8)
class UBP_CharacterVFXComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ARuntimeCharacter*                      As_Runtime_Character;                              // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      LeftDefaultFootStepFX;                             // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      RightDefaultFootStepFX;                            // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   Biome;                                             // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         P_LowStamina;                                      // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         DebugSystem;                                       // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         staminaDisplayThreshold;                           // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         staminaDisplayDuration;                            // 0x00F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxStamina;                                        // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_LowStamina;                                     // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FBoneReference                         TopWrinkleBone;                                    // 0x0108(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor)
	struct FBoneReference                         BottomWrinkleBone;                                 // 0x0118(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor)
	class FName                                   WrinkleRotParameterValue;                          // 0x0128(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   WrinkleTextureVariation;                           // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   WrinkleIntensityVariation;                         // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanUpdateWrinkleTextureVariation;                 // 0x0140(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WrinkleTextureVariationNum;                        // 0x0144(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            WrinklesIntensityCurve;                            // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        LocalSpinePrecedentDirection;                      // 0x0150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterCustomizationComponent*       CharCustoComp;                                     // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FCharacterPartEnumHandler              CharacterPartToUpdate;                             // 0x0160(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UBP_CharacterMaterialData_C*            MaterialData;                                      // 0x01B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTeamMate;                                        // 0x01B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      LeftSpecialFootStepFX;                             // 0x01C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      RightSpecialFootStepFX;                            // 0x01C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         SpecialFootstep;                                   // 0x01D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         DefaultSpecialFootstep;                            // 0x01D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CreateDefaultFootStep();
	void CreateFootStepNS();
	void DebugMenuVisualizeDeprecatedClothMaterial(bool bToggled);
	void EnableLowStaminaFeedback();
	void ExecuteUbergraph_BP_CharacterVFXComponent(int32 EntryPoint);
	void FootPrint(EVFXFootSide FootSide, EFootStepFXSize FootStepIntensity, double SpawnProbability, const struct FTransform& BoneTransform, const struct FGameplayTag& ActorTag);
	void OnAttributeUpdate(const struct FGameplayAttribute& _attribute, float _fOldValue, float _fNewValue);
	void OnCharacterGenerated(class UCharacterCustomizationComponent* _Character_Customization_Component, bool _bWasCharacterGenerated);
	void OnControllerChanged(class APawn* Pawn, class AController* OldController, class AController* NewController);
	void Play_System_with_Parameters(class UNiagaraComponent* Target, const struct FTransform& Transform, const struct FGameplayTag& ActorTag, double SpawnProbability);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void SetupLocalVFX();
	void UpdateLowStaminaPP(double OldStamina, double NewStamina);
	void UpdateWrinkle();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CharacterVFXComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CharacterVFXComponent_C")
	}
	static class UBP_CharacterVFXComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CharacterVFXComponent_C>();
	}
};
DUMPER7_ASSERTS_UBP_CharacterVFXComponent_C;

}

