#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CustomizableCharacter

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "SCCharacterCustomization_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CustomizableCharacter.BP_CustomizableCharacter_C
// 0x0110 (0x07A0 - 0x0690)
class ABP_CustomizableCharacter_C final : public ACharacter
{
public:
	class UBP_CharacterCustomizationComponent_C*  BP_CharacterCustomizationComponent;                // 0x0690(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_CustomizationPresetsAsset_C*        Preset;                                            // 0x0698(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         PresetIndex;                                       // 0x06A0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A4[0x4];                                      // 0x06A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSCCharacterCustomizationDescription   DefaultCustoDescription;                           // 0x06A8(0x00F0)(Edit, BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash)

public:
	void GenerateCharacter();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CustomizableCharacter_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CustomizableCharacter_C")
	}
	static class ABP_CustomizableCharacter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CustomizableCharacter_C>();
	}
};
DUMPER7_ASSERTS_ABP_CustomizableCharacter_C;

}

