#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CustomizationARDataAsset

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Runtime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CustomizationARDataAsset.BP_CustomizationARDataAsset_C
// 0x00B0 (0x01A0 - 0x00F0)
class UBP_CustomizationARDataAsset_C final : public UCustomizationARDataAsset
{
public:
	TArray<TSoftObjectPtr<class UTexture2D>>      ARStage_Previews;                                  // 0x00F0(0x0010)(Edit, BlueprintVisible)
	bool                                          Unavailable;                                       // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ARStage_RTPC;                                      // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AkBed_Event;                                       // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsStadium;                                         // 0x0118(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WorldIndex;                                        // 0x011C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           GrassHightlightTS;                                 // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Victory_Mood_Goal_Burst;                           // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture>                Thumbnail_Video;                                   // 0x0138(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FLinearColor                           BallOutlineColor;                                  // 0x0160(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveLinearColor*                      FieldCurve;                                        // 0x0170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Logo;                                              // 0x0178(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CustomizationARDataAsset_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CustomizationARDataAsset_C")
	}
	static class UBP_CustomizationARDataAsset_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CustomizationARDataAsset_C>();
	}
};
DUMPER7_ASSERTS_UBP_CustomizationARDataAsset_C;

}

