#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CanMatchContinueFlowState

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Runtime_structs.hpp"
#include "Runtime_classes.hpp"
#include "SCCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CanMatchContinueFlowState.BP_CanMatchContinueFlowState_C
// 0x0020 (0x05B0 - 0x0590)
class UBP_CanMatchContinueFlowState_C final : public URuntimeGameFlowState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0590(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   ContinueTransitionName;                            // 0x0598(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERuntimeGameFlowTravelTeamComposition         ContinueComposition;                               // 0x05A0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A1[0x3];                                      // 0x05A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   QuitTransitionName;                                // 0x05A4(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERuntimeGameFlowTravelTeamComposition         QuitComposition;                                   // 0x05AC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bQuit;                                             // 0x05AD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPE_PostEnteringFlowState(class USCGameFlowSubsystem* _gameFlowSubsystem, const class USCGameFlowState* PreviousState, bool _bHasPendingTransitions);
	void ExecuteUbergraph_BP_CanMatchContinueFlowState(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CanMatchContinueFlowState_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CanMatchContinueFlowState_C")
	}
	static class UBP_CanMatchContinueFlowState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CanMatchContinueFlowState_C>();
	}
};
DUMPER7_ASSERTS_UBP_CanMatchContinueFlowState_C;

}

