#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CustomizationPresetListViewModel

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CustomizationPresetListViewModel.BP_CustomizationPresetListViewModel_C.CanCreatePreset
// 0x0018 (0x0018 - 0x0000)
struct BP_CustomizationPresetListViewModel_C_CanCreatePreset final
{
public:
	bool                                          CanCreatePreset_0;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizationSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BPF_GetMaxPresetCount_ReturnValue;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CustomizationPresetListViewModel_C_CanCreatePreset;

// Function BP_CustomizationPresetListViewModel.BP_CustomizationPresetListViewModel_C.GetEquippedPresetViewModel
// 0x0010 (0x0010 - 0x0000)
struct BP_CustomizationPresetListViewModel_C_GetEquippedPresetViewModel final
{
public:
	class UCustomizationPresetViewModel*          Output;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCustomizationPresetViewModel*          CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CustomizationPresetListViewModel_C_GetEquippedPresetViewModel;

}

