#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CameraThird

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCCore_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_CameraThird.BP_CameraThird_C.BPE_OnCameraDataPoped
// 0x0008 (0x0008 - 0x0000)
struct BP_CameraThird_C_BPE_OnCameraDataPoped final
{
public:
	const class USCAbstractCameraData*            _cameraData;                                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CameraThird_C_BPE_OnCameraDataPoped;

// Function BP_CameraThird.BP_CameraThird_C.BPE_OnCameraDataPushed
// 0x0008 (0x0008 - 0x0000)
struct BP_CameraThird_C_BPE_OnCameraDataPushed final
{
public:
	const class USCAbstractCameraData*            _cameraData;                                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CameraThird_C_BPE_OnCameraDataPushed;

// Function BP_CameraThird.BP_CameraThird_C.ExecuteUbergraph_BP_CameraThird
// 0x0080 (0x0080 - 0x0000)
struct BP_CameraThird_C_ExecuteUbergraph_BP_CameraThird final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class USCAbstractCameraData*            K2Node_Event__cameraData_1;                        // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCameraLockBallService*                 CallFunc_BPF_GetCameraService_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraLockBallService*                 CallFunc_BPF_GetCameraService_ReturnValue_1;       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EServiceStateUpdate eStateUpdate)> K2Node_CreateDelegate_OutputDelegate;          // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EServiceStateUpdate                           K2Node_CustomEvent_eStateUpdate;                   // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EServiceStateUpdate eStateUpdate)> K2Node_CreateDelegate_OutputDelegate_1;        // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class USCAbstractCameraData*            K2Node_Event__cameraData;                          // 0x0060(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0068(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CameraThird_C_ExecuteUbergraph_BP_CameraThird;

// Function BP_CameraThird.BP_CameraThird_C.FilterCameraDataPlaySound
// 0x0028 (0x0028 - 0x0000)
struct BP_CameraThird_C_FilterCameraDataPlaySound final
{
public:
	class USCCameraData*                          CameraData;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldExecute;                                     // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USCCameraData*                          OutCameraData;                                     // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTemplate_CameraData_C*                 K2Node_DynamicCast_AsTemplate_Camera_Data;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CameraThird_C_FilterCameraDataPlaySound;

// Function BP_CameraThird.BP_CameraThird_C.OnLockBallStateUpdate
// 0x0001 (0x0001 - 0x0000)
struct BP_CameraThird_C_OnLockBallStateUpdate final
{
public:
	EServiceStateUpdate                           eStateUpdate;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CameraThird_C_OnLockBallStateUpdate;

// Function BP_CameraThird.BP_CameraThird_C.PlaySoundForSpecificCameraData
// 0x0038 (0x0038 - 0x0000)
struct BP_CameraThird_C_PlaySoundForSpecificCameraData final
{
public:
	class USCCameraData*                          CameraData;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CameraThird_C_PlaySoundForSpecificCameraData;

// Function BP_CameraThird.BP_CameraThird_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_CameraThird_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CameraThird_C_ReceiveEndPlay;

}

