#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ControlDisplayVisibilityComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ControlDisplayVisibilityComponent.BP_ControlDisplayVisibilityComponent_C.BPE_SetWidgetVisibility
// 0x0010 (0x0010 - 0x0000)
struct BP_ControlDisplayVisibilityComponent_C_BPE_SetWidgetVisibility final
{
public:
	class USCUserWidget*                          _userWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          _bVisible;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ControlDisplayVisibilityComponent_C_BPE_SetWidgetVisibility;

// Function BP_ControlDisplayVisibilityComponent.BP_ControlDisplayVisibilityComponent_C.ExecuteUbergraph_BP_ControlDisplayVisibilityComponent
// 0x0028 (0x0028 - 0x0000)
struct BP_ControlDisplayVisibilityComponent_C_ExecuteUbergraph_BP_ControlDisplayVisibilityComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USCUserWidget*                          K2Node_Event__userWidget;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event__bVisible;                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ControlsDisplay_C*                 K2Node_DynamicCast_AsWBP_Controls_Display;         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ControlDisplayVisibilityComponent_C_ExecuteUbergraph_BP_ControlDisplayVisibilityComponent;

}

