#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterCustomizationComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CharacterCustomizationComponent.BP_CharacterCustomizationComponent_C.BPE_InitGeneratedMeshComponent
// 0x0010 (0x0010 - 0x0000)
struct BP_CharacterCustomizationComponent_C_BPE_InitGeneratedMeshComponent final
{
public:
	class USkeletalMeshComponent*                 _generatedMeshComp;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         _iCharacterPart;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CharacterCustomizationComponent_C_BPE_InitGeneratedMeshComponent;

}

