#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DefaultPhase_2RailLDCameraData

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_DefaultPhase_2RailLDCameraData.BP_DefaultPhase_2RailLDCameraData_C.BPE_SwitchToLDCamera
// 0x0020 (0x0020 - 0x0000)
struct BP_DefaultPhase_2RailLDCameraData_C_BPE_SwitchToLDCamera final
{
public:
	const class AActor*                           _actorToFollowRef;                                 // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           _actorToLookAtRef;                                 // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class USCCameraData>              _overrideCamera;                                   // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPE_SwitchToLDCamera_ReturnValue;         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_DefaultPhase_2RailLDCameraData_C_BPE_SwitchToLDCamera;

}

