#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Donut_2RailLDCameraActor

#include "Basic.hpp"

#include "BP_1RailLDCameraActor_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Donut_2RailLDCameraActor.BP_Donut_2RailLDCameraActor_C
// 0x0060 (0x0DD0 - 0x0D70)
class ABP_Donut_2RailLDCameraActor_C final : public ABP_1RailLDCameraActor_C
{
public:
	uint8                                         Pad_D64[0x4];                                      // 0x0D64(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineComponent*                       TargetRail2;                                       // 0x0D68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       SplineRefActor2;                                   // 0x0D70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentTime2;                                      // 0x0D78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DebugTime2;                                        // 0x0D80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DampingFactor2;                                    // 0x0D88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLockCameraRail2;                                  // 0x0D90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D91[0x7];                                      // 0x0D91(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LockCurrentTime2;                                  // 0x0D98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Current_Framing_System_Time_2;                     // 0x0DA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentCamAngle;                                   // 0x0DA8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DAC[0x4];                                      // 0x0DAC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        InitBlend;                                         // 0x0DB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TargetBlend;                                       // 0x0DB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InterpSpeedToReachBlend;                           // 0x0DC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateTimeAndSplineLookAtActor(double DeltaTime);
	void GetDebugTime2(double* DebugTime2_0);
	void UpdateTimeAndSplineFollowActor(double DeltaTime);
	void UpdateCameraPositionAndLookAt(double DeltaTime);
	void ScrubDebugTime();
	void DrawDebug2(double Time1, double Time2, struct FVector* TargetPos);
	bool BPE_SwitchToLDCamera(const class AActor* _actorToFollowRef, const class AActor* _actorToLookAtRef, TSubclassOf<class USCCameraData> _overrideCamera);
	void BPE_SwitchToGameplayCamera();

	float GetCurrentTime2() const;
	void GetCurrentFramingSystemTime2(double* Current_Framing_System_Time_2_0) const;
	void GetWantedAngleCamera(double* Deg) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Donut_2RailLDCameraActor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Donut_2RailLDCameraActor_C")
	}
	static class ABP_Donut_2RailLDCameraActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Donut_2RailLDCameraActor_C>();
	}
};
DUMPER7_ASSERTS_ABP_Donut_2RailLDCameraActor_C;

}

