#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FinisherLineOnFieldLength

#include "Basic.hpp"

#include "SCCharacterCustomization_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FinisherLineOnFieldLength.BP_FinisherLineOnFieldLength_C
// 0x0028 (0x0050 - 0x0028)
class UBP_FinisherLineOnFieldLength_C final : public USequenceTransformOriginComputer
{
public:
	double                                        Distance_From_Wall;                                // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Length_Percent;                                    // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RotationYawOffset;                                 // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayAnimPerpendicularToWall;                       // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Log_Category;                                      // 0x0044(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void NewFunction();

	struct FTransform BPE_ComputeSequenceTransformOrigin(class UWorld* _world, const struct FTransform& _defaultTransform) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_FinisherLineOnFieldLength_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_FinisherLineOnFieldLength_C")
	}
	static class UBP_FinisherLineOnFieldLength_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_FinisherLineOnFieldLength_C>();
	}
};
DUMPER7_ASSERTS_UBP_FinisherLineOnFieldLength_C;

}

