#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GlobalCustomizationViewModel

#include "Basic.hpp"

#include "Runtime_classes.hpp"
#include "Engine_structs.hpp"
#include "SCCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GlobalCustomizationViewModel.BP_GlobalCustomizationViewModel_C
// 0x0030 (0x00C0 - 0x0090)
class UBP_GlobalCustomizationViewModel_C final : public UGlobalCustomizationViewModel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0090(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_CustomizationUICategoryViewModel_C* SelectionFinisherPageCategoryVM;                   // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_ShopItemViewModel_C*                FocusedFinisherToEquip;                            // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USOSBindingsStoreItemViewModel*         PurchasedItemToRefocus;                            // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_ShopItemViewModel_C*                SelectedFullOutfitForDetails;                      // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          JustPurchasedItem;                                 // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReopenPurchasePopupAfterCurrencyPage;              // 0x00B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_GlobalCustomizationViewModel(int32 EntryPoint);
	void PurchasedItemForItemPageReturn(class USOSBindingsStoreItemViewModel* PurchasedItemToRefocus_0);
	void TryPurchaseItemFromCusto(class USOSBindingsStoreItemViewModel* SOSItemViewModelToPurchase, const class APlayerController* _inPlayerController);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_GlobalCustomizationViewModel_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_GlobalCustomizationViewModel_C")
	}
	static class UBP_GlobalCustomizationViewModel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GlobalCustomizationViewModel_C>();
	}
};
DUMPER7_ASSERTS_UBP_GlobalCustomizationViewModel_C;

}

