#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GoalKeeperVolumeAttributor

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Runtime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GoalKeeperVolumeAttributor.BP_GoalKeeperVolumeAttributor_C
// 0x00C8 (0x0408 - 0x0340)
class ABP_GoalKeeperVolumeAttributor_C final : public ARoleVolumeAttributor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSoftObjectPtr<class ABP_SweeperVolumeAttributor_C> SweeperAttributor;                           // 0x0348(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FGameplayTagQuery                      WaitBlockingEndQuery;                              // 0x0370(0x0048)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FGameplayTagContainer                  OwnedTagsWhichKeepInvu;                            // 0x03B8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FGameplayTagContainer                  OwnedTagsWhichRemoveInvu;                          // 0x03D8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FActiveGameplayEffectHandle            WaitingForAbilitiesEffectHandle;                   // 0x03F8(0x0008)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ShootAbilityTag;                                   // 0x0400(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void RemoveInvuEffects(class UAbilitySystemComponent* InAsc);
	void ReceiveBeginPlay();
	void OnTagChanged(const class USCAbilitySystemComponent* _abilitySystem, const struct FGameplayTag& _gameplayTag, int32 _iCount);
	void OnShootAbilityTagChanged(const class USCAbilitySystemComponent* _abilitySystem, const struct FGameplayTag& _gameplayTag, int32 _iCount);
	void ExecuteUbergraph_BP_GoalKeeperVolumeAttributor(int32 EntryPoint);
	void BPE_RemoveCurrentEffectOwner(class AActor* _actor);
	void BPE_CantRemoveEffectFromTarget(class AActor* _actor);
	void BPE_AssignCurrentEffectOwner(class AActor* _actor);

	bool IsKeeperAndBlockedByAbility(class UAbilitySystemComponent* ActorAsc) const;
	bool BPE_CanUseEffectAttributorVolume() const;
	bool BPE_CanRemoveEffectFromTarget(const class AActor* _actor) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_GoalKeeperVolumeAttributor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_GoalKeeperVolumeAttributor_C")
	}
	static class ABP_GoalKeeperVolumeAttributor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GoalKeeperVolumeAttributor_C>();
	}
};
DUMPER7_ASSERTS_ABP_GoalKeeperVolumeAttributor_C;

}

