#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameOption_EnableLootAtInput

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_GameOption_EnableLootAtInput.BP_GameOption_EnableLootAtInput_C.BPE_SetGameOption
// 0x0028 (0x0028 - 0x0000)
struct BP_GameOption_EnableLootAtInput_C_BPE_SetGameOption final
{
public:
	class ASCBasePlayerController*                _controller;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         _fValue;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Runtime_PlayerController_C*         K2Node_DynamicCast_AsBP_Runtime_Player_Controller; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SetEnableLookAtInputFromOption_OptionValue_ImplicitCast; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_GameOption_EnableLootAtInput_C_BPE_SetGameOption;

}

