#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InGameMenuGameFlowSystem

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_InGameMenuGameFlowSystem.BP_InGameMenuGameFlowSystem_C.BPE_StateChanged
// 0x0010 (0x0010 - 0x0000)
struct BP_InGameMenuGameFlowSystem_C_BPE_StateChanged final
{
public:
	struct FGameplayTag                           _previousState;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           _currentState;                                     // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InGameMenuGameFlowSystem_C_BPE_StateChanged;

// Function BP_InGameMenuGameFlowSystem.BP_InGameMenuGameFlowSystem_C.ExecuteUbergraph_BP_InGameMenuGameFlowSystem
// 0x0014 (0x0014 - 0x0000)
struct BP_InGameMenuGameFlowSystem_C_ExecuteUbergraph_BP_InGameMenuGameFlowSystem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event__previousState;                       // 0x0004(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event__currentState;                        // 0x000C(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InGameMenuGameFlowSystem_C_ExecuteUbergraph_BP_InGameMenuGameFlowSystem;

// Function BP_InGameMenuGameFlowSystem.BP_InGameMenuGameFlowSystem_C.OnStateChanged
// 0x0100 (0x0100 - 0x0000)
struct BP_InGameMenuGameFlowSystem_C_OnStateChanged final
{
public:
	struct FGameplayTag                           _previousState;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           _currentState;                                     // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTagName_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTagName_ReturnValue_1;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0020(0x0010)()
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x0030(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0088(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InGameMenuGameFlowSystem_C_OnStateChanged;

}

