#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InputAction_Data_Clickable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCCore_structs.hpp"
#include "WBP_Abstract_GenericButton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_InputAction_Data_Clickable.BP_InputAction_Data_Clickable_C
// 0x0110 (0x0ED0 - 0x0DC0)
class UBP_InputAction_Data_Clickable_C final : public UWBP_Abstract_GenericButton_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_InputAction_Data_Clickable_C;    // 0x0DC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_InputActionKey_Data_C*              BackInput;                                         // 0x0DC8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         BackInputHorizontalBox;                            // 0x0DD0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Focus;                                          // 0x0DD8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlock_InputAction;                             // 0x0DE0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ActionTitle;                                       // 0x0DE8(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FMappingID                             Mapping_ID;                                        // 0x0DF8(0x00D0)(Edit, BlueprintVisible)
	bool                                          IsBlack;                                           // 0x0EC8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ChangeInputActionTitle(const class FText& ActionTitle_0);
	void ExecuteUbergraph_BP_InputAction_Data_Clickable(int32 EntryPoint);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void PreConstruct(bool IsDesignTime);
	void SetBlack(bool Black);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_InputAction_Data_Clickable_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_InputAction_Data_Clickable_C")
	}
	static class UBP_InputAction_Data_Clickable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_InputAction_Data_Clickable_C>();
	}
};
DUMPER7_ASSERTS_UBP_InputAction_Data_Clickable_C;

}

