#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InputActionKey_Data

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCCore_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_InputActionKey_Data.BP_InputActionKey_Data_C
// 0x0050 (0x0F20 - 0x0ED0)
class UBP_InputActionKey_Data_C final : public UControllerButtonWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0ED0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_BG;                                         // 0x0ED8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_Input;                                  // 0x0EE0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Main;                                // 0x0EE8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAsyncImage*                            KeyImage;                                          // 0x0EF0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               MainSizeBox;                                       // 0x0EF8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_HoldText;                                     // 0x0F00(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 Separator;                                         // 0x0F08(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          Key_Exist;                                         // 0x0F18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBlack;                                           // 0x0F19(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPE_OnDataUpdated();
	void ExecuteUbergraph_BP_InputActionKey_Data(int32 EntryPoint);
	class FText GetKeyboardText(const struct FKey& Key);
	void IsKeyValid(bool* Result);
	void PreConstruct(bool IsDesignTime);
	void SetBlack(bool Black);
	void SetHoldVisibility(bool Visible);
	void ToggleTypeVisibility(bool IsController);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_InputActionKey_Data_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_InputActionKey_Data_C")
	}
	static class UBP_InputActionKey_Data_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_InputActionKey_Data_C>();
	}
};
DUMPER7_ASSERTS_UBP_InputActionKey_Data_C;

}

