#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InputAction_Data

#include "Basic.hpp"

#include "SCCore_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UIBaseColors_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function BP_InputAction_Data.BP_InputAction_Data_C.BPE_OnUIInputModeChanged
// 0x0002 (0x0002 - 0x0000)
struct BP_InputAction_Data_C_BPE_OnUIInputModeChanged final
{
public:
	EUIInputModes                                 _eMode;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          _bInit;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InputAction_Data_C_BPE_OnUIInputModeChanged;

// Function BP_InputAction_Data.BP_InputAction_Data_C.BPE_SetInputAction
// 0x00B8 (0x00B8 - 0x0000)
struct BP_InputAction_Data_C_BPE_SetInputAction final
{
public:
	class USCInputAction*                         _eAction;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                _owner;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FControllerIconStyle                   _eIconStyle;                                       // 0x0010(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	EControllerIconAxisTypes                      _eAxisType;                                        // 0x0060(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSCUserDefinedEnumHandler              _drawingStyle;                                     // 0x0068(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InputAction_Data_C_BPE_SetInputAction;

// Function BP_InputAction_Data.BP_InputAction_Data_C.ControllerTypeChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_InputAction_Data_C_ControllerTypeChanged final
{
public:
	bool                                          bGamepad;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InputAction_Data_C_ControllerTypeChanged;

// Function BP_InputAction_Data.BP_InputAction_Data_C.ExecuteUbergraph_BP_InputAction_Data
// 0x01B8 (0x01B8 - 0x0000)
struct BP_InputAction_Data_C_ExecuteUbergraph_BP_InputAction_Data final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USCInputAction*                         K2Node_Event__eAction;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Event__owner;                               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FControllerIconStyle                   K2Node_Event__eIconStyle;                          // 0x0018(0x0050)(ConstParm, HasGetValueTypeHash)
	EControllerIconAxisTypes                      K2Node_Event__eAxisType;                           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSCUserDefinedEnumHandler              K2Node_Event__drawingStyle;                        // 0x0070(0x0050)(ConstParm, HasGetValueTypeHash)
	EUIInputModes                                 K2Node_Event__eMode;                               // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event__bInit;                               // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_BPF_GetEnumValue_ReturnValue;             // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USCInputContext*                        CallFunc_BPF_GetActionFirstContext_ReturnValue;    // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMappingID                             CallFunc_Conv_InputActionToMappingID_ReturnValue;  // 0x00D0(0x00D0)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URichTextBlock*                         K2Node_DynamicCast_AsRich_Text_Block;              // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InputAction_Data_C_ExecuteUbergraph_BP_InputAction_Data;

// Function BP_InputAction_Data.BP_InputAction_Data_C.InputMappingChanged
// 0x00F8 (0x00F8 - 0x0000)
struct BP_InputAction_Data_C_InputMappingChanged final
{
public:
	struct FInputMappingProfileData               mappingProfileData;                                // 0x0000(0x00F8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_BP_InputAction_Data_C_InputMappingChanged;

// Function BP_InputAction_Data.BP_InputAction_Data_C.IsFirstKeyValid
// 0x0002 (0x0002 - 0x0000)
struct BP_InputAction_Data_C_IsFirstKeyValid final
{
public:
	bool                                          FirstKeyValid;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsKeyValid_Result;                        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InputAction_Data_C_IsFirstKeyValid;

// Function BP_InputAction_Data.BP_InputAction_Data_C.OverrideWithKeys
// 0x0018 (0x0018 - 0x0000)
struct BP_InputAction_Data_C_OverrideWithKeys final
{
public:
	bool                                          bInOverrideKeys;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKey>                           InOverridingKeys;                                  // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_InputAction_Data_C_OverrideWithKeys;

// Function BP_InputAction_Data.BP_InputAction_Data_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_InputAction_Data_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InputAction_Data_C_PreConstruct;

// Function BP_InputAction_Data.BP_InputAction_Data_C.RemappingDataChanged
// 0x00F8 (0x00F8 - 0x0000)
struct BP_InputAction_Data_C_RemappingDataChanged final
{
public:
	struct FInputMappingProfileData               mappingProfileData;                                // 0x0000(0x00F8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_BP_InputAction_Data_C_RemappingDataChanged;

// Function BP_InputAction_Data.BP_InputAction_Data_C.SetAxisType
// 0x0001 (0x0001 - 0x0000)
struct BP_InputAction_Data_C_SetAxisType final
{
public:
	EControllerIconAxisTypes                      AxisType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InputAction_Data_C_SetAxisType;

// Function BP_InputAction_Data.BP_InputAction_Data_C.SetBlack
// 0x01C0 (0x01C0 - 0x0000)
struct BP_InputAction_Data_C_SetBlack final
{
public:
	bool                                          Black;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUIBaseColors                          CallFunc_GetUIColors_UI_BaseColors;                // 0x0010(0x0154)(HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0168(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0178(0x0014)()
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_InputActionKey_Data_C*              K2Node_DynamicCast_AsBP_Input_Action_Key_Data;     // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             K2Node_DynamicCast_AsText;                         // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InputAction_Data_C_SetBlack;

// Function BP_InputAction_Data.BP_InputAction_Data_C.SetHoldVisibility
// 0x0001 (0x0001 - 0x0000)
struct BP_InputAction_Data_C_SetHoldVisibility final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InputAction_Data_C_SetHoldVisibility;

// Function BP_InputAction_Data.BP_InputAction_Data_C.SetIconStyle
// 0x0050 (0x0050 - 0x0000)
struct BP_InputAction_Data_C_SetIconStyle final
{
public:
	struct FControllerIconStyle                   IconStyle;                                         // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InputAction_Data_C_SetIconStyle;

// Function BP_InputAction_Data.BP_InputAction_Data_C.SetInputsMappingID
// 0x00D0 (0x00D0 - 0x0000)
struct BP_InputAction_Data_C_SetInputsMappingID final
{
public:
	struct FMappingID                             _mappingID;                                        // 0x0000(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_InputAction_Data_C_SetInputsMappingID;

// Function BP_InputAction_Data.BP_InputAction_Data_C.SetMappingID
// 0x00D0 (0x00D0 - 0x0000)
struct BP_InputAction_Data_C_SetMappingID final
{
public:
	struct FMappingID                             MappingID_0;                                       // 0x0000(0x00D0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_BP_InputAction_Data_C_SetMappingID;

// Function BP_InputAction_Data.BP_InputAction_Data_C.UpdateChildInputs
// 0x0048 (0x0048 - 0x0000)
struct BP_InputAction_Data_C_UpdateChildInputs final
{
public:
	TArray<class UBP_InputActionKey_Data_C*>      InputArray;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_InputActionKey_Data_C*              CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsKeyValid_Result;                        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_InputActionKey_Data_C*>      K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_BP_InputAction_Data_C_UpdateChildInputs;

// Function BP_InputAction_Data.BP_InputAction_Data_C.UpdateMappingData
// 0x0108 (0x0108 - 0x0000)
struct BP_InputAction_Data_C_UpdateMappingData final
{
public:
	struct FInputMappingProfileData               mappingProfileData;                                // 0x0000(0x00F8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputMappingWidgetData*                CallFunc_SpawnObject_ReturnValue;                  // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InputAction_Data_C_UpdateMappingData;

// Function BP_InputAction_Data.BP_InputAction_Data_C.UpdateSeparator
// 0x0050 (0x0050 - 0x0000)
struct BP_InputAction_Data_C_UpdateSeparator final
{
public:
	class UBP_InputActionKey_Data_C*              InputPin;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FString                                 LocalSeparator;                                    // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0010)()
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default_1;                           // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InputAction_Data_C_UpdateSeparator;

}

