#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InputAction_Data

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "SCCore_structs.hpp"
#include "SCCore_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_InputAction_Data.BP_InputAction_Data_C
// 0x01C0 (0x0DB0 - 0x0BF0)
class UBP_InputAction_Data_C final : public USCUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_InputActionKey_Data_C*              Input1;                                            // 0x0BF8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InputActionKey_Data_C*              Input2;                                            // 0x0C00(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InputActionKey_Data_C*              Input3;                                            // 0x0C08(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InputActionKey_Data_C*              Input4;                                            // 0x0C10(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         InputBox;                                          // 0x0C18(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Separator_1;                                       // 0x0C20(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Separator_2;                                       // 0x0C28(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Separator_3;                                       // 0x0C30(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bOverrideWithKeys;                                 // 0x0C38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C39[0x7];                                      // 0x0C39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKey>                           OverridingKeys;                                    // 0x0C40(0x0010)(Edit, BlueprintVisible)
	struct FMappingID                             MappingID;                                         // 0x0C50(0x00D0)(Edit, BlueprintVisible)
	bool                                          bOverrideSeparator;                                // 0x0D20(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D21[0x7];                                      // 0x0D21(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Separator;                                         // 0x0D28(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UWidget*                                OwnerWidget;                                       // 0x0D38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FControllerIconStyle                   Icon_Style;                                        // 0x0D40(0x0050)(Edit, BlueprintVisible, HasGetValueTypeHash)
	EControllerIconAxisTypes                      Axis_Type;                                         // 0x0D90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisplayHold;                                       // 0x0D91(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBlack;                                           // 0x0D92(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D93[0x5];                                      // 0x0D93(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGlobalMenuContextViewModel*            GlobalMenuContextViewModel;                        // 0x0D98(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UInputMappingWidgetData*                InputMappingWidgetData;                            // 0x0DA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseCurrentInputMapping;                           // 0x0DA8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPE_OnDataUpdated();
	void BPE_OnUIInputModeChanged(EUIInputModes _eMode, bool _bInit);
	void BPE_SetInputAction(class USCInputAction* _eAction, class UWidget* _owner, const struct FControllerIconStyle& _eIconStyle, EControllerIconAxisTypes _eAxisType, const struct FSCUserDefinedEnumHandler& _drawingStyle);
	void Construct();
	void ControllerTypeChanged(bool bGamepad);
	void ExecuteUbergraph_BP_InputAction_Data(int32 EntryPoint);
	void InputMappingChanged(const struct FInputMappingProfileData& mappingProfileData);
	void IsFirstKeyValid(bool* FirstKeyValid);
	void OverrideWithKeys(bool bInOverrideKeys, TArray<struct FKey>& InOverridingKeys);
	void PreConstruct(bool IsDesignTime);
	void RemappingDataChanged(const struct FInputMappingProfileData& mappingProfileData);
	void SetAxisType(EControllerIconAxisTypes AxisType);
	void SetBlack(bool Black);
	void SetHoldVisibility(bool Visible);
	void SetIconStyle(struct FControllerIconStyle& IconStyle);
	void SetInputsMappingID(const struct FMappingID& _mappingID);
	void SetMappingID(const struct FMappingID& MappingID_0);
	void UpdateChildInputs();
	void UpdateMappingData(const struct FInputMappingProfileData& mappingProfileData);
	void UpdateSeparator(class UBP_InputActionKey_Data_C* InputPin, class UTextBlock* Text);
	void UpdateSeparators();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_InputAction_Data_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_InputAction_Data_C")
	}
	static class UBP_InputAction_Data_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_InputAction_Data_C>();
	}
};
DUMPER7_ASSERTS_UBP_InputAction_Data_C;

}

