#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Library_GameOptionPlatformUtils

#include "Basic.hpp"

#include "Enum_OptionPlatform_structs.hpp"


namespace SDK::Params
{

// Function BP_Library_GameOptionPlatformUtils.BP_Library_GameOptionPlatformUtils_C.Update Option Availability
// 0x00D0 (0x00D0 - 0x0000)
struct BP_Library_GameOptionPlatformUtils_C_Update_Option_Availability final
{
public:
	Enum_OptionPlatform                           OptionAvailability;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Availability;                                      // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         ConsolePlatformList;                               // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         XBox_PlatformNames;                                // 0x0028(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         PCPlatformNames;                                   // 0x0038(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         PlaystationPlatformNames;                          // 0x0048(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_MakeArray_Array_1;                          // 0x0070(0x0010)(ReferenceParm)
	TArray<class FString>                         K2Node_MakeArray_Array_2;                          // 0x0080(0x0010)(ReferenceParm)
	Enum_OptionPlatform                           Temp_byte_Variable;                                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_MakeArray_Array_3;                          // 0x0098(0x0010)(ConstParm, ReferenceParm)
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_Select_Default;                             // 0x00B8(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Library_GameOptionPlatformUtils_C_Update_Option_Availability;

}

