#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LDCameraActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_EnumCameraLDSlot_structs.hpp"
#include "SCCore_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LDCameraActor.BP_LDCameraActor_C
// 0x0070 (0x0B60 - 0x0AF0)
#pragma pack(push, 0x1)
class alignas(0x10) ABP_LDCameraActor_C : public ASCLDCameraActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   DebugCameraLookAtActor;                            // 0x0AF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   DebugCameraActor;                                  // 0x0B00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EBP_EnumCameraLDSlot                          CameraSlot;                                        // 0x0B08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_B09[0x7];                                      // 0x0B09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CameraData;                                        // 0x0B10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          PlayWoosh;                                         // 0x0B18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B19[0x7];                                      // 0x0B19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        VolumeOffset;                                      // 0x0B20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Whoosh_GameplayCamera;                             // 0x0B28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Whoosh_LDCamera;                                   // 0x0B30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   AMB_Camera_State_ReturnToGameplay;                 // 0x0B38(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AMB_Camera_State_LDCamera;                         // 0x0B40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AMB_State_Group;                                   // 0x0B48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RTPCVolumeOffset;                                  // 0x0B50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetAudioState(class UAkAudioEvent* WhooshEvent, class FName AMB_Camera_State, double VolumeOffset_0);
	void ReceiveBeginPlay();
	void ManageDebugIconVisibility();
	void ExecuteUbergraph_BP_LDCameraActor(int32 EntryPoint);
	bool BPE_SwitchToLDCamera(const class AActor* _actorToFollowRef, const class AActor* _actorToLookAtRef, TSubclassOf<class USCCameraData> _overrideCamera);
	void BPE_SwitchToGameplayCamera();
	struct FTransform GetLookAtActorRefTransform(float _fDt);
	struct FTransform BPE_GetActorRefTransform(float _fDt);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_LDCameraActor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_LDCameraActor_C")
	}
	static class ABP_LDCameraActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LDCameraActor_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_ABP_LDCameraActor_C;

}

