#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MVVM_TestViewModel

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_MVVM_TestViewModel.BP_MVVM_TestViewModel_C.Get Bool A B C
// 0x0018 (0x0018 - 0x0000)
struct BP_MVVM_TestViewModel_C_Get_Bool_A_B_C final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Offset;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_MVVM_TestViewModel_C_Get_Bool_A_B_C;

// Function BP_MVVM_TestViewModel.BP_MVVM_TestViewModel_C.Get Child At
// 0x0018 (0x0018 - 0x0000)
struct BP_MVVM_TestViewModel_C_Get_Child_At final
{
public:
	int32                                         idx;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTestViewModelChild*                    Child_0;                                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTestViewModelChild*                    CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_MVVM_TestViewModel_C_Get_Child_At;

// Function BP_MVVM_TestViewModel.BP_MVVM_TestViewModel_C.GetChildFirstName
// 0x0010 (0x0010 - 0x0000)
struct BP_MVVM_TestViewModel_C_GetChildFirstName final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_MVVM_TestViewModel_C_GetChildFirstName;

// Function BP_MVVM_TestViewModel.BP_MVVM_TestViewModel_C.Is A Or B
// 0x0002 (0x0002 - 0x0000)
struct BP_MVVM_TestViewModel_C_Is_A_Or_B final
{
public:
	bool                                          A_or_B;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_MVVM_TestViewModel_C_Is_A_Or_B;

}

