#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MicroSelect_GameOption

#include "Basic.hpp"

#include "Runtime_structs.hpp"


namespace SDK::Params
{

// Function BP_MicroSelect_GameOption.BP_MicroSelect_GameOption_C.BPE_SetGameOption
// 0x0050 (0x0050 - 0x0000)
struct BP_MicroSelect_GameOption_C_BPE_SetGameOption final
{
public:
	class ASCBasePlayerController*                _controller;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         _fValue;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSOSVoiceChatDeviceInfo>        CallFunc_GetInputDevices_ReturnValue;              // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSOSVoiceChatDeviceInfo                CallFunc_Array_Get_Item;                           // 0x0028(0x0020)()
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_MicroSelect_GameOption_C_BPE_SetGameOption;

}

