#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MVVM_TestViewModel

#include "Basic.hpp"

#include "SCCore_classes.hpp"


namespace SDK
{

// MVVMViewModelBlueprintGeneratedClass BP_MVVM_TestViewModel.BP_MVVM_TestViewModel_C
// 0x0020 (0x00C8 - 0x00A8)
class UBP_MVVM_TestViewModel_C final : public UTestViewModel
{
public:
	double                                        Pi_Float;                                          // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Min_Entries;                                       // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Max_Entries;                                       // 0x00B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Child_Index;                                       // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTestViewModelChild*                    Child;                                             // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Get_Bool_A_B_C(int32 Index_0, int32 Offset, bool* Result) const;
	void Get_Child_At(int32 idx, class UTestViewModelChild** Child_0) const;
	void GetChildFirstName(class FString* Name_0) const;
	void Is_A_Or_B(bool* A_or_B) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_MVVM_TestViewModel_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_MVVM_TestViewModel_C")
	}
	static class UBP_MVVM_TestViewModel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_MVVM_TestViewModel_C>();
	}
};
DUMPER7_ASSERTS_UBP_MVVM_TestViewModel_C;

}

