#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Menu_LaunchScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCCore_structs.hpp"
#include "WBP_MenuPage_Abstract_classes.hpp"
#include "AkAudio_structs.hpp"
#include "SOS_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Menu_LaunchScreen.BP_Menu_LaunchScreen_C
// 0x0050 (0x0CB0 - 0x0C60)
class UBP_Menu_LaunchScreen_C final : public UWBP_MenuPage_Abstract_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_LaunchScreen_Content_C*            WBP_LaunchScreen_Content;                          // 0x0C68(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_CallToAction_C*               WBP_Menu_CallToAction;                             // 0x0C70(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_VM_CustomAuthentification_C*        BP_VM_CustomAuthentification;                      // 0x0C78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	bool                                          bProfileLoaded;                                    // 0x0C80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFirstTimeLoad;                                    // 0x0C81(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C82[0x6];                                      // 0x0C82(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   In_Text;                                           // 0x0C88(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Format;                                            // 0x0C98(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void SetLoading(bool bLoading, const class FText& Message);
	void ProgressOnLoad();
	void OnProfileLoaded(ELoadResult _eLoadResult);
	struct FEventReply OnPreviewMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnPreviewKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void OnLoginFailChanged(bool bFail);
	void OnGameFlowStateChanged(const struct FGameplayTag& _previous, const struct FGameplayTag& _current);
	void OnFrontEndConnectionStateChanged(ESOSFrontendConnectionState State);
	void OnAuthenticationStateChanged(ESOSAuthenticationState State);
	void OnAnyKeyPressed();
	void On_Save_Loaded(ELoadResult _eLoadResult);
	void ExecuteUbergraph_BP_Menu_LaunchScreen(int32 EntryPoint);
	void BPE_OnMenuTransitionOut(EMenuTransitions _eTransition, TSubclassOf<class USCMenuWidget> _eNewMenu);
	void BPE_OnMenuTransitionIn(EMenuTransitions _eTransition, TSubclassOf<class USCMenuWidget> _ePrevMenu);
	void BPE_OnActionPressed(const class USCInputAction* _action, const struct FInputActionState& _listenerState);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Menu_LaunchScreen_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Menu_LaunchScreen_C")
	}
	static class UBP_Menu_LaunchScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Menu_LaunchScreen_C>();
	}
};
DUMPER7_ASSERTS_UBP_Menu_LaunchScreen_C;

}

