#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PingMarker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PingMarker.BP_PingMarker_C
// 0x0050 (0x0300 - 0x02B0)
class ABP_PingMarker_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMaterialBillboardComponent*            MaterialBillboard;                                 // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_ShootBounceLocationGroundMesh;                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ShowTimeline_Location_4578B3614EEA01943A11D0AB9F73DB63; // 0x02D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ShowTimeline__Direction_4578B3614EEA01943A11D0AB9F73DB63; // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ShowTimeline;                                      // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               SpriteContainer;                                   // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PingMarker(int32 EntryPoint);
	void Hide();
	void PlayShowAnimation();
	void ReceiveBeginPlay();
	void Show(const struct FPingDataContainer& InData, class AActor* InRequester);
	void ShowTimeline__FinishedFunc();
	void ShowTimeline__UpdateFunc();

	double Compute_Sprite_Element_Y(class UTexture2D* InTexture, double InX) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PingMarker_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PingMarker_C")
	}
	static class ABP_PingMarker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PingMarker_C>();
	}
};
DUMPER7_ASSERTS_ABP_PingMarker_C;

}

