#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RuntimeWelcomeFlowSubsystem

#include "Basic.hpp"

#include "Runtime_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_RuntimeWelcomeFlowSubsystem.BP_RuntimeWelcomeFlowSubsystem_C.BPE_StartWelcomeFlowStep
// 0x0001 (0x0001 - 0x0000)
struct BP_RuntimeWelcomeFlowSubsystem_C_BPE_StartWelcomeFlowStep final
{
public:
	EWelcomeFlowStep                              _step;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_RuntimeWelcomeFlowSubsystem_C_BPE_StartWelcomeFlowStep;

// Function BP_RuntimeWelcomeFlowSubsystem.BP_RuntimeWelcomeFlowSubsystem_C.ExecuteUbergraph_BP_RuntimeWelcomeFlowSubsystem
// 0x01B8 (0x01B8 - 0x0000)
struct BP_RuntimeWelcomeFlowSubsystem_C_ExecuteUbergraph_BP_RuntimeWelcomeFlowSubsystem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_PlayerPrivateProfileViewModel_C*    CallFunc_BPF_GetGlobalViewModelInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EWelcomeFlowStep                              K2Node_Event__step;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERematchWelcomeFlowContentType                CallFunc_BPF_GetContentTypeForWelcomeFlowStep_ReturnValue; // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_Map_Find_Value;                           // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class USCViewModel*>        CallFunc_GetUnreadContentViewModelsMap_ViewModels; // 0x0030(0x0050)()
	struct FGameplayTag                           CallFunc_BPF_ShowPopupByTemplate__outSelectedOptionTag; // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
	class USCInputAction*                         CallFunc_BPF_ShowPopupByTemplate__outSelectedAction; // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USCSaveSubsystem*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class USCViewModel*>        Temp_name_Variable;                                // 0x0098(0x0050)(ConstParm)
	struct FGameplayTag                           CallFunc_BPF_ShowPopupByTemplate__outSelectedOptionTag_1; // 0x00E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class USCInputAction*                         CallFunc_BPF_ShowPopupByTemplate__outSelectedAction_1; // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_RuntimeSaveObjectGameData_C*        K2Node_DynamicCast_AsBP_Runtime_Save_Object_Game_Data; // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USCSaveSubsystem*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URuntimeSOSBindingsSubsystem*           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UModelProxy*                            CallFunc_BPF_GetServicesViewModelProxy_ReturnValue; // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPF_GetCrossplayWarningSeen_ReturnValue;  // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USOSAvailableFeaturesProxy*             K2Node_DynamicCast_AsSOSAvailable_Features_Proxy;  // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPF_IsCrossplayEnabled_ReturnValue;       // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_133[0x5];                                      // 0x0133(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class USCViewModel*>        Temp_name_Variable_1;                              // 0x0138(0x0050)(ConstParm)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGlobalMenuContextViewModel*            CallFunc_BPF_GetGlobalViewModelInstance_ReturnValue_1; // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BPF_ShowPopupByTemplate__outSelectedOptionTag_2; // 0x0198(0x0008)(NoDestructor, HasGetValueTypeHash)
	class USCInputAction*                         CallFunc_BPF_ShowPopupByTemplate__outSelectedAction_2; // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsXbox_ReturnValue;                       // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_RuntimeWelcomeFlowSubsystem_C_ExecuteUbergraph_BP_RuntimeWelcomeFlowSubsystem;

// Function BP_RuntimeWelcomeFlowSubsystem.BP_RuntimeWelcomeFlowSubsystem_C.GetUnreadContentViewModelsMap
// 0x00E8 (0x00E8 - 0x0000)
struct BP_RuntimeWelcomeFlowSubsystem_C_GetUnreadContentViewModelsMap final
{
public:
	ERematchWelcomeFlowContentType                Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class USCViewModel*>        Viewmodels;                                        // 0x0008(0x0050)(Parm, OutParm)
	TMap<class FName, class USCViewModel*>        Map;                                               // 0x0058(0x0050)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x00B4(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWelcomeFlowContentViewModel*>   CallFunc_BPF_GetUnreadContentViewModelsByType_ReturnValue; // 0x00C0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWelcomeFlowContentViewModel*           CallFunc_Array_Get_Item;                           // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_RuntimeWelcomeFlowSubsystem_C_GetUnreadContentViewModelsMap;

}

