#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RuntimeFakeCharacter

#include "Basic.hpp"

#include "SCCharacterCustomization_structs.hpp"


namespace SDK::Params
{

// Function BP_RuntimeFakeCharacter.BP_RuntimeFakeCharacter_C.ExecuteUbergraph_BP_RuntimeFakeCharacter
// 0x0038 (0x0038 - 0x0000)
struct BP_RuntimeFakeCharacter_C_ExecuteUbergraph_BP_RuntimeFakeCharacter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_GetImitatedPlayerState_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ARuntimePlayerState*                    K2Node_DynamicCast_AsRuntime_Player_State;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PlayerNames_C*                     K2Node_DynamicCast_AsWBP_Player_Names;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_RuntimeFakeCharacter_C_ExecuteUbergraph_BP_RuntimeFakeCharacter;

// Function BP_RuntimeFakeCharacter.BP_RuntimeFakeCharacter_C.UserConstructionScript
// 0x00F8 (0x00F8 - 0x0000)
struct BP_RuntimeFakeCharacter_C_UserConstructionScript final
{
public:
	struct FSCCharacterCustomizationDescription   LocalCustoDescription;                             // 0x0000(0x00F0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_RuntimeFakeCharacter_C_UserConstructionScript;

}

