#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Runtime_PlayerController

#include "Basic.hpp"

#include "Runtime_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Runtime_PlayerController.BP_Runtime_PlayerController_C
// 0x0070 (0x13E0 - 0x1370)
class ABP_Runtime_PlayerController_C : public ARuntimePlayerController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_SoundAttenuationDriver_C*           BP_SoundAttenuationDriver;                         // 0x1378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USCMenuComponent*                       SCMenu;                                            // 0x1380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnAnyKey;                                          // 0x1388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UWBP_ControlsDisplay_C*                 ControlsDisplay;                                   // 0x1398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_HUD_C*                             HUD;                                               // 0x13A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SCControllerDebug_C*               ControllerDebug;                                   // 0x13A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              On_Input_Action_Cancel;                            // 0x13B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UDataTable*                             MainGameControls;                                  // 0x13C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDiveAimAssistActivated;                          // 0x13C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C9[0x7];                                     // 0x13C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_RadarDisplay_C*                    RadarDisplay;                                      // 0x13D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CreateRadarWidget;                                 // 0x13D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseTeamColorsOnRadar;                              // 0x13D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Activate_Dive_Aim_Assist(bool bToggled);
	void AddControlsDisplay();
	void CreateHUDWidget();
	void ExecuteUbergraph_BP_Runtime_PlayerController(int32 EntryPoint);
	void NotifyCommunicationUsed();
	void PlayControllerDynamicForce(double FeedbackIntensity, double FeedbackDuration);
	void ReceiveBeginPlay();
	void ServerEmptyStamina();
	void Set_Mini_Map_Type_from_Option(double _optionValue);
	void SetControlDisplayVisibility(bool InShow);
	void SetEnableLookAtInputFromOption(double OptionValue);
	void SetMiniMapSizeFromOption(double _optionValue);
	void SetupMenuInputs();
	void StopControllerDynamicForce();

	bool CanUseCommunication() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Runtime_PlayerController_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Runtime_PlayerController_C")
	}
	static class ABP_Runtime_PlayerController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Runtime_PlayerController_C>();
	}
};
DUMPER7_ASSERTS_ABP_Runtime_PlayerController_C;

}

