#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RuntimeSaveObjectGameData

#include "Basic.hpp"

#include "BPE_BPVersion_structs.hpp"


namespace SDK::Params
{

// Function BP_RuntimeSaveObjectGameData.BP_RuntimeSaveObjectGameData_C.ExecuteUbergraph_BP_RuntimeSaveObjectGameData
// 0x0004 (0x0004 - 0x0000)
struct BP_RuntimeSaveObjectGameData_C_ExecuteUbergraph_BP_RuntimeSaveObjectGameData final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_RuntimeSaveObjectGameData_C_ExecuteUbergraph_BP_RuntimeSaveObjectGameData;

// Function BP_RuntimeSaveObjectGameData.BP_RuntimeSaveObjectGameData_C.GetLatestBPVersion
// 0x0010 (0x0010 - 0x0000)
struct BP_RuntimeSaveObjectGameData_C_GetLatestBPVersion final
{
public:
	EBPE_BPVersion                                CurrentVersion;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_RuntimeSaveObjectGameData_C_GetLatestBPVersion;

// Function BP_RuntimeSaveObjectGameData.BP_RuntimeSaveObjectGameData_C.SetLatestBPVersion
// 0x0001 (0x0001 - 0x0000)
struct BP_RuntimeSaveObjectGameData_C_SetLatestBPVersion final
{
public:
	EBPE_BPVersion                                CallFunc_GetLatestBPVersion_CurrentVersion;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_RuntimeSaveObjectGameData_C_SetLatestBPVersion;

// Function BP_RuntimeSaveObjectGameData.BP_RuntimeSaveObjectGameData_C.ShouldResetCrosshair
// 0x0005 (0x0005 - 0x0000)
struct BP_RuntimeSaveObjectGameData_C_ShouldResetCrosshair final
{
public:
	bool                                          bResetCrosshair;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBPE_BPVersion                                CallFunc_GetLatestBPVersion_CurrentVersion;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_ByteByte_ReturnValue;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_RuntimeSaveObjectGameData_C_ShouldResetCrosshair;

}

