#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RuntimeSoundSubsystem

#include "Basic.hpp"

#include "Runtime_classes.hpp"
#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RuntimeSoundSubsystem.BP_RuntimeSoundSubsystem_C
// 0x0060 (0x01E8 - 0x0188)
class UBP_RuntimeSoundSubsystem_C final : public URuntimeSoundSubsystem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0188(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ARuntimeCharacter*                      AsRuntimeCharacter;                                // 0x0190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayerValidRef;                                    // 0x0198(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Team_0_Crowd_MultiPos_C*            Team0_Crowd;                                       // 0x01A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_Team_1_Crowd_MultiPos_C*            Team1_Crowd;                                       // 0x01A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterSoundComponent_C*          CharSoundComponent;                                // 0x01B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CurrentSongName;                                   // 0x01B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const class FString& SongName)> SongChanged;                       // 0x01C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        Debug_Voice_Choice_RTPC;                           // 0x01D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MenuMusicPlaying;                                  // 0x01E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPE_Deinitialize();
	void BPE_Initialize();
	void BPE_OnGameStateHandleBeginPlay(class ASCGameState* _gameState);
	void BPE_OnLoadingScreenVisibilityChanged(bool _bVisible);
	void BPE_PostLoadMap(class UWorld* _world);
	void CallSetPresetMixTV(class FName ActionName);
	void CallSetToEn(class FName ActionName);
	void CallSetToFr(class FName ActionName);
	void CallSetTopl(class FName ActionName);
	void CallSetTopt_BR(class FName ActionName);
	void CallSetTotr(class FName ActionName);
	void CallSetTozh_Hans(class FName ActionName);
	void DecreaseVoicePitch(class FName ActionName);
	void ExecuteUbergraph_BP_RuntimeSoundSubsystem(int32 EntryPoint);
	void Force_Ak_Audio_Device_Update();
	void GetPlayerRef(bool* FoundPlayer);
	void GetSegmentName(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo);
	void Hook_Debug_MixPresets();
	void HookDebugCrowd();
	void HookDebugGoals();
	void HookDebugMusic();
	void HookDebugVoices();
	void IncreaseVoicePitch(class FName ActionName);
	void MarketMixPreset(class FName ActionName);
	void OnStateChange(const struct FGameplayTag& _previous, const struct FGameplayTag& _current);
	void Play_GoalBurst1(class FName ActionName);
	void Play_GoalBurst2(class FName ActionName);
	void PlayAwayScoring(class FName ActionName);
	void PlayHappyReact(class FName ActionName);
	void PlayHomeScoring(class FName ActionName);
	void PlayReactionByTeam1(class FName ActionName);
	void PlayReactionByTeam2(class FName ActionName);
	void PlayShockedReact(class FName ActionName);
	void ResetVoiceCusto(class FName ActionName);
	void Set_To_French(bool Succeeded);
	void Set_To_Polish(bool Succeeded);
	void Set_to_Turkish(bool Succeeded);
	void SetAudioMixPresetFromOption(int32 OptionValue);
	void SetMixPresetHeadphones(class FName ActionName);
	void SetMixPresetSpeakers(class FName ActionName);
	void SetPresetNightMode(class FName ActionName);
	void SetPresetSoundBar(class FName ActionName);
	void SetToBrezilian(bool Succeeded);
	void SetToEnglish(bool Succeeded);
	void SetToMandarin(bool Succeeded);
	void SkipCurrentTrack(class FName ActionName);
	void Start_All_Ambient_Sounds();
	void StartMenuPlaylist();
	void Stop__All_Ambient_Sounds();
	void StopMenuPlaylist();
	void UpdateVoiceRTPCDebug();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_RuntimeSoundSubsystem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_RuntimeSoundSubsystem_C")
	}
	static class UBP_RuntimeSoundSubsystem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_RuntimeSoundSubsystem_C>();
	}
};
DUMPER7_ASSERTS_UBP_RuntimeSoundSubsystem_C;

}

