#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RuntimeTPC

#include "Basic.hpp"

#include "Runtime_structs.hpp"
#include "Runtime_classes.hpp"
#include "SCCharacterCustomization_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "EPlayerTargetTypes_structs.hpp"
#include "PhysicsControl_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "SCCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RuntimeTPC.BP_RuntimeTPC_C
// 0x0850 (0x12D0 - 0x0A80)
class ABP_RuntimeTPC_C final : public ARuntimeCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_LookAtGoalComponent_C*              BP_LookAtGoalBallComponent;                        // 0x0A88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0A90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtboxComponent*                      BallHurtbox;                                       // 0x0A98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        TopOfTheNameTag;                                   // 0x0AA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_RuntimeTPCOptimizerComponent_C*     BP_RuntimeTPCOptimizerComponent;                   // 0x0AA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitboxComponent*                       Hitbox_Inner_LockMove;                             // 0x0AB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPhysicsControlComponent*               PhysicsControl;                                    // 0x0AB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       NameTag3D;                                         // 0x0AC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      AvoidCapsule;                                      // 0x0AC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtboxComponent*                      AvoidHurtbox;                                      // 0x0AD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterOutlineOverlay_C*          BP_CharacterOutlineOverlay;                        // 0x0AD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitboxComponent*                       Hitbox_Goalkeeper_LockMove;                        // 0x0AE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitboxComponent*                       Hitbox_LockMove;                                   // 0x0AE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Collision_NoVolley;                                // 0x0AF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitboxComponent*                       Hitbox_NoControlDeflect;                           // 0x0AF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_HinderingComponent_C*               BP_HinderingComponent;                             // 0x0B00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitboxComponent*                       Hitbox_BallControl_Ground_VX;                      // 0x0B08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitboxComponent*                       Hitbox_BallControl_Ground_V0;                      // 0x0B10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_CameraThird_C*                      BP_CameraThird;                                    // 0x0B18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitboxComponent*                       Hitbox_BallControl_VX;                             // 0x0B20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitboxComponent*                       Hitbox_BallControl_V0;                             // 0x0B28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_TouchBallComponent_C*               BP_TouchBallComponent;                             // 0x0B30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitboxComponent*                       Hitbox_SprintPossess;                              // 0x0B38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHitboxComponent*                       Hitbox_SprintTap;                                  // 0x0B40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x0B48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHurtboxComponent*                      CharacterHurtbox;                                  // 0x0B50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterCustomizationComponent_C*  BP_CharacterCustomizationComponent;                // 0x0B58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterVFXComponent_C*            BP_CharacterVFXComponent;                          // 0x0B60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMotionWarpingComponent*                MotionWarping;                                     // 0x0B68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0B70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterSoundComponent_C*          BP_CharacterSoundComponent;                        // 0x0B78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USCSkeletalMeshVLogDebugDrawComponent*  SCSkeletalMeshVLogDebugDraw;                       // 0x0B80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         PhysicControlAlpha_Alpha_A54EA4C242DB7DB672DA74923244BD03; // 0x0B88(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            PhysicControlAlpha__Direction_A54EA4C242DB7DB672DA74923244BD03; // 0x0B8C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B8D[0x3];                                      // 0x0B8D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     PhysicControlAlpha;                                // 0x0B90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         LookAtBallHandle;                                  // 0x0B98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9C[0x4];                                      // 0x0B9C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABall*                                  BallLookedAt;                                      // 0x0BA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        RulershipMarker;                                   // 0x0BA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bArePlayerStateEventsBound;                        // 0x0BB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseTrailerPresetsAsCusto;                         // 0x0BB1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB2[0x6];                                      // 0x0BB2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CustomizationPresetsAsset_C*        TrailerPresets;                                    // 0x0BB8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         TrailerPresetIndex;                                // 0x0BC0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOverridePlayerCusto;                              // 0x0BC4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC5[0x3];                                      // 0x0BC5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSCCharacterCustomizationDescription   OverridingPlayerCusto;                             // 0x0BC8(0x00F0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSCCharacterCustomizationDescription   CustoOverrideDesc;                                 // 0x0CB8(0x00F0)(Edit, BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash)
	class UClass*                                 DefaultPlayerCusto;                                // 0x0DA8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class ABall* OldBall, class ABall* NewBall)> OnLookAtBallChanged;  // 0x0DB0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsLookingAtBallLocked;                            // 0x0DC0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC1[0x3];                                      // 0x0DC1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ShouldLookAtBallTime;                              // 0x0DC4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           LookAtBallTimerHandle;                             // 0x0DC8(0x0008)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABall*                                  PreviousBallLookedAt;                              // 0x0DD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPlayerCustoUpToDate;                            // 0x0DD8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD9[0x7];                                      // 0x0DD9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSCCharacterCustomizationDescription   WrinkleDisableCustoDesc;                           // 0x0DE0(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bStopWrinkleRandomIntensity;                       // 0x0ED0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED1[0x7];                                      // 0x0ED1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PreviousName;                                      // 0x0ED8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         PrevNumberInTeam;                                  // 0x0EE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EEC[0x4];                                      // 0x0EEC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCharacterPartEnumHandler>      CharacterPartToApplyNumberOn;                      // 0x0EF0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	int32                                         PrevTeamID;                                        // 0x0F00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            OutOfStamina;                                      // 0x0F04(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            Out_Of_Stamina_Regen;                              // 0x0F0C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F14[0x4];                                      // 0x0F14(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  OutOfStaminaGameplay_Tags;                         // 0x0F18(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSCCameraLookAtServiceBehavior         LookAtBallParam;                                   // 0x0F38(0x0188)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UBP_CharacterMaterialData_C*            MaterialData;                                      // 0x10C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        NametagSize;                                       // 0x10C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InitialConstraintProfile;                          // 0x10D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPhysicsControlLimbSetupData>   Limb_Setup_Data;                                   // 0x10D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FPhysicsControlData                    WorldSpaceControlData;                             // 0x10E8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FPhysicsControlData                    ParentSpaceControlData;                            // 0x1138(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FPhysicsControlModifierData            Body_Modifier_Data_Off;                            // 0x1188(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FPhysicsControlModifierData            Body_Modifier_Data_On;                             // 0x1198(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FPhysicsControlNames                   All_World_Space_Controls;                          // 0x11A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, struct FPhysicsControlNames> Limb_World_Space_Controls;                        // 0x11B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FPhysicsControlNames                   All_Parent_Space_Controls;                         // 0x1208(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, struct FPhysicsControlNames> Limb_Parent_Space_Controls;                       // 0x1218(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FPhysicsControlNames                   All_Body_Modifiers;                                // 0x1268(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, struct FPhysicsControlNames> Limb_Body_Modifiers;                              // 0x1278(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         PreviousPredictedLODLevel;                         // 0x12C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInfiniteStaminaEnabled;                         // 0x12CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsGoalkeeperInvulnerabilityForced;                // 0x12CD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BillboardNametag();
	void BndEvt__BP_RuntimeTPC_BP_CharacterCustomizationComponent_K2Node_ComponentBoundEvent_1_CharacterGeneratedSignature__DelegateSignature(class UCharacterCustomizationComponent* _characterCustomizationComponent, bool _bWasCharacterGenerated);
	void BndEvt__BP_RuntimeTPC_m_BallOwnership_K2Node_ComponentBoundEvent_0_BallAutoCapturableSignature__DelegateSignature(class ABall* Ball, EBallCaptureSource eCaptureSource);
	void BndEvt__BP_RuntimeTPC_m_BallOwnership_K2Node_ComponentBoundEvent_0_BallOwnershipGainedSignature__DelegateSignature(class ABall* Ball);
	void BndEvt__BP_RuntimeTPC_m_BallOwnership_K2Node_ComponentBoundEvent_2_BallOwnershipLostSignature__DelegateSignature();
	void BPE_OnTeamChanged_Event(class ARuntimePlayerState* _playerState, uint8 _uiNewTeam, int32 _iNumberInTeam);
	void ChangeTeamPrematchBindings(int32 InPrevTeamIndex, int32 InNewTeamIndex);
	void Check_Player_State_Changes(class ARuntimePlayerState* RuntimePlayerState);
	void DEBUG_LookForDuplicateTags();
	void ExecuteUbergraph_BP_RuntimeTPC(int32 EntryPoint);
	void Force_Team_Prematch_Bindings();
	void Helper_RemoveComponent(class UActorComponent* Component);
	void InitalizeNameTag();
	void InitializeFromPlayerState(class APlayerState* InPlayerState);
	void LookAtBallEvent();
	void LookAtBallWithTimerHandle();
	void OnCustoChanged(class ARuntimePlayerState* _player_State);
	void OnGoalScored(const struct FGoalDescription& _goal);
	void OnHinderingTagCountChanged(const class USCAbilitySystemComponent* _abilitySystem, const struct FGameplayTag& _gameplayTag, int32 _iCount);
	void OnPrematchDataChanged(class ARuntimeMatchGameState* _gameState);
	void OnRepPlayerState(const class APlayerState* _playerState);
	void OnStaminaChanged(const struct FGameplayAttribute& Attribute, float OldValue, float NewValue);
	void OnTeamColorChanged();
	void OnTeamPreMatchColorChanged(bool _bIsPrimaryColor, int32 _uiColorIndex);
	void OnTeamPrematchWidgetFocusIndexChanged(int32 _uiIndex);
	void PhysicControlAlpha__FinishedFunc();
	void PhysicControlAlpha__UpdateFunc();
	void PlayShakeCam(double InMultiplier, class UClass* InShakeClass, ECameraShakePlaySpace InShakePlaySpace, const struct FRotator& InUserShakeRotation);
	void PlayWrinklePreview();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceivePossessed(class AController* NewController);
	void ReceiveRestarted();
	void ReceiveTick(float DeltaSeconds);
	void Set_Look_At_Ball_Enabled(bool bInEnabled);
	void SetCharacterStencils();
	void SetInfiniteGKInvunerabilityEnabled(bool Enabled);
	void SetInfiniteStaminaEnabled(bool Enabled);
	void SetupPhysicControlComponent();
	void Toggle_Ball_Look_At();
	void TriggerLookAtGoal(class AActor* InTarget);
	void TriggerPhysicControlUpdate();
	void UpdatePlayerSkin(const TArray<struct FSCCharacterCustomizationDescription>& InAdditionalCusto);
	void UserConstructionScript();

	class UHinderingComponent* BPF_GetHinderingComponent() const;
	void BPF_GetSkeletalMeshToLogs(TArray<class USkeletalMeshComponent*>* _outMeshComps, TArray<class USkeletalMesh*>* _outMeshes) const;
	void GetAdditionalCustoArray(TArray<struct FSCCharacterCustomizationDescription>* Array) const;
	struct FColor GetDebugColor() const;
	class FName GetDebugName() const;
	class AActor* GetTarget(EPlayerTargetTypes InTargetType) const;
	int32 GetTrailerPresetIndex(class ARuntimePlayerState* InPlayerState) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_RuntimeTPC_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_RuntimeTPC_C")
	}
	static class ABP_RuntimeTPC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RuntimeTPC_C>();
	}
};
DUMPER7_ASSERTS_ABP_RuntimeTPC_C;

}

