#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RuntimeMatchGameState

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Runtime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RuntimeMatchGameState.BP_RuntimeMatchGameState_C
// 0x0040 (0x0B10 - 0x0AD0)
class ABP_RuntimeMatchGameState_C final : public ARuntimeMatchGameState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AD0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0AD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           InvalidAR;                                         // 0x0AE0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bFilterPingPerTeam;                                // 0x0AE8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AE9[0x7];                                      // 0x0AE9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 AlreadyTriggeredPerScore;                          // 0x0AF0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              OnOutlineColorsChanged;                            // 0x0B00(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void CheckScoreEvents();
	void CheckTimerEvents();
	void ExecuteUbergraph_BP_RuntimeMatchGameState(int32 EntryPoint);
	void OnMatchStateChanged(class FName _newMatchState);
	void OnTeamColorChanged();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void UpdateOutlineColors();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_RuntimeMatchGameState_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_RuntimeMatchGameState_C")
	}
	static class ABP_RuntimeMatchGameState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RuntimeMatchGameState_C>();
	}
};
DUMPER7_ASSERTS_ABP_RuntimeMatchGameState_C;

}

