#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RuntimeMenuPlayerController

#include "Basic.hpp"

#include "Runtime_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_Runtime_PlayerController_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RuntimeMenuPlayerController.BP_RuntimeMenuPlayerController_C
// 0x0060 (0x1440 - 0x13E0)
class ABP_RuntimeMenuPlayerController_C final : public ABP_Runtime_PlayerController_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_RuntimeMenuPlayerController_C;   // 0x13E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bIsRotationActivated;                              // 0x13E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13E9[0x7];                                     // 0x13E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USCInputComponent*                      ControllerInputComponent;                          // 0x13F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CustoRotationActivationInputID;                    // 0x13F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CustoRotationDeactivationInputID;                  // 0x13FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         AbilitiesToTriggerBallRecall;                      // 0x1400(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bCanRotate;                                        // 0x1410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1411[0x7];                                     // 0x1411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FShootForceComputationInstance         ShootForceComputation;                             // 0x1418(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, ContainsInstancedReference)
	struct FShootDirectionComputationInstance     Shoot_Direction_Computation;                       // 0x1428(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, ContainsInstancedReference)

public:
	void ReceiveTick(float DeltaSeconds);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void OnRotationDeactivated(const class USCInputAction* _inputAction, const struct FInputActionState& _listenerState);
	void OnRotationActivated(const class USCInputAction* _inputAction, const struct FInputActionState& _listenerState);
	void OnCustomizationStateChanged(const class UCustomizationSubsystem* _customizationSubsystem, bool _bWasInMenu);
	void On_Ability_Activated(const struct FGameplayAbilitySpecHandle& _abilityHanddle, class UGameplayAbility* _abilityActivated);
	void ExecuteUbergraph_BP_RuntimeMenuPlayerController(int32 EntryPoint);
	void EnterCustomization();
	void BackToMainMenuFromCustomization();
	void AddControlsDisplay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_RuntimeMenuPlayerController_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_RuntimeMenuPlayerController_C")
	}
	static class ABP_RuntimeMenuPlayerController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RuntimeMenuPlayerController_C>();
	}
};
DUMPER7_ASSERTS_ABP_RuntimeMenuPlayerController_C;

}

