#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StoreViewModel

#include "Basic.hpp"

#include "SOSBindings_classes.hpp"


namespace SDK
{

// MVVMViewModelBlueprintGeneratedClass BP_StoreViewModel.BP_StoreViewModel_C
// 0x0048 (0x01B0 - 0x0168)
class UBP_StoreViewModel_C final : public UStoreViewModel
{
public:
	class FString                                 LastSelectedBundleID;                              // 0x0168(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 LastSelectedItemID;                                // 0x0178(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UBP_SeasonPassSlotViewModel_C*          StoredSPSlotVM;                                    // 0x0188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class USOSBindingsStoreSeasonTierViewModel*> SPTiersArray;                                // 0x0190(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         CurrentTierPriceST;                                // 0x01A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentSlotPriceST;                                // 0x01A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectedChapterID;                                 // 0x01A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLastSelectedItemAR;                             // 0x01AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOpenPremiumPopup;                                 // 0x01AD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void FindSOSStoreItemVMFromID(const class FString& ItemId, class USOSBindingsStoreItemViewModel** SOSStoreItemVM);

	void CanUseStore(bool* Purchase_in_Progress) const;
	void GetCatalogBundleAtIndex(int32 Index_0, class USOSBindingsStoreBundleViewModel** Bundle) const;
	void GetCatalogBundlesFromIndex(int32 Index_0, TArray<class USOSBindingsStoreBundleViewModel*>* Bundles) const;
	void GetCurrentSeasonName(class FText* Name_0) const;
	void GetCurrentSeasonNumber(int32* Number) const;
	void GetDurationUntilCurrentSeasonEnd(struct FTimespan* Duration) const;
	void GetDurationUntilNextChapterStart(struct FTimespan* Duration) const;
	void GetDurationUntilNextSeasonStart(struct FTimespan* Duration) const;
	void GetFirstBigFeaturedBundle(class USOSBindingsStoreBundleViewModel** Output) const;
	void GetFullOutfitFromBundle(class USOSBindingsStoreBundleViewModel* StoreBundle, class USOSBindingsStoreItemViewModel** SetVM) const;
	void GetLastSelectedBundleVM(class USOSBindingsStoreBundleViewModel** LastSelectedBundleVM) const;
	void GetLastSelectedItemVM(class USOSBindingsStoreItemViewModel** SOSBindingsStoreItemViewModel) const;
	void GetNextSeasonName(class FText* Name_0) const;
	void GetPreviousSeasonName(class FText* Name_0) const;
	void IsItemAffordable(class USOSBindingsStoreItemViewModel* viewModel, bool* CanAffordHC, bool* CanAffordSC) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_StoreViewModel_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_StoreViewModel_C")
	}
	static class UBP_StoreViewModel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_StoreViewModel_C>();
	}
};
DUMPER7_ASSERTS_UBP_StoreViewModel_C;

}

