#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SavedActorTest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SavedActorTest.BP_SavedActorTest_C
// 0x0030 (0x02E0 - 0x02B0)
class ABP_SavedActorTest_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USCSaveGameComponent*                   SCSaveGame;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FString                                 Local_Saved_Text;                                  // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, HasGetValueTypeHash)

public:
	void Display_Saved_Text();
	void ExecuteUbergraph_BP_SavedActorTest(int32 EntryPoint);
	void On_Updated_From_Save();
	void ReceiveBeginPlay();
	void Set_Saved_Text(const class FString& Text);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SavedActorTest_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SavedActorTest_C")
	}
	static class ABP_SavedActorTest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SavedActorTest_C>();
	}
};
DUMPER7_ASSERTS_ABP_SavedActorTest_C;

}

