#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StadiumARSystem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Runtime_structs.hpp"
#include "Runtime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_StadiumARSystem.BP_StadiumARSystem_C
// 0x00B0 (0x0518 - 0x0468)
class UBP_StadiumARSystem_C final : public URuntimeStadiumAR
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0468(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Enable_Match_Transitions;                          // 0x0470(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_471[0x3];                                      // 0x0471(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PreviousAR;                                        // 0x0474(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Last_Shown_AR_Team_Index;                          // 0x0478(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFirstARLoading;                                  // 0x047C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlayTransitionOnTie;                              // 0x047D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasPendingGoalScored;                             // 0x047E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPrematchDataValid;                              // 0x047F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ADirectionalLight>       EnvironmentLight;                                  // 0x0480(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UCurveLinearColorAtlas*                 FieldCurveAtlas;                                   // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         LastGoalIDSCored;                                  // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UCustomizationARDataAsset> Debug_Team_A_World;                              // 0x04B8(0x0028)(Edit, BlueprintVisible, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UCustomizationARDataAsset> Debug_Team_B_World;                              // 0x04E0(0x0028)(Edit, BlueprintVisible, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash)
	class FString                                 VLogCategory;                                      // 0x0508(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BPE_Initialize();
	void BPE_OnArPerTeamSet_Event(class ARuntimeMatchGameState* _gameState);
	void BPE_OnConfigChanged();
	void BPE_OnCurrentWorldTagChanged();
	void BPE_OnEditorMapOpened();
	void BPE_OnGameStateHandleBeginPlay(class ASCGameState* _gameState);
	void BPE_OnGameStateValid();
	void BPE_OnGoalScored_Event(const struct FGoalDescription& _goal);
	void BPE_OnPlayTransition(const struct FRuntimeARTransition& _params);
	void BPE_OnTransitionStateChanged(ESCTransitionState _state);
	void BPE_OnTransitionValueChanged(float _weight, float _direction);
	void BPE_Tick(class UWorld* _world, ETickingGroup _eTickGroup, float _fDt);
	void ExecuteUbergraph_BP_StadiumARSystem(int32 EntryPoint);
	void HideAR();
	void Hook_Debug_Functions();
	void On_Debug_Play_Transition_Sequence(class FName ActionName);
	void On_Debug_Play_Transition_Sequence_Reverse(class FName ActionName);
	void On_Match_Over(class ASCGameState* _gameState);
	void On_Score_Changed();
	void OnGameFlowStateChanged(const struct FGameplayTag& _previous, const struct FGameplayTag& _current);
	void OnMatchStateChanged(class FName _newMatchState);
	void OnPostNetInit();
	void OnRuntimeReplayFinished();
	void OnRuntimeReplayStarted();
	void Play_End_Match_Transition();
	void Play_Goal_Scored_Transition();
	void Play_KickOff_Transition();
	void Play_Match_Transition(bool To_Portal, int32 _iTeamIdx);
	void PreloadARLevels(class ARuntimeMatchGameState* MatchState);
	void Set_Current_World_Globals();
	void Set_Transition_Direction_Scalar_For_MPC(const struct FRuntimeARTransition& SCScenePortalTransition);
	void SetFieldSize();
	void Show_Team(TSoftObjectPtr<class UObject> Team_Asset);
	void ShowAR();
	void SwitchToReplayState();
	void SwitchToSourceState();
	void TRANSITION();
	void Transition_Value_Changed(double Weight);
	void UpdateRenderScale();

	void BPE_DebugLogStatus() const;
	void BPF_WorldTagUseOpaqueRendering(const struct FGameplayTag& _worldTag, bool* _bResult) const;
	void Get_AR_Team_Index(int32* Team_Index) const;
	void Get_Leading_Team_Index(int32* Team_Index) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_StadiumARSystem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_StadiumARSystem_C")
	}
	static class UBP_StadiumARSystem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_StadiumARSystem_C>();
	}
};
DUMPER7_ASSERTS_UBP_StadiumARSystem_C;

}

