#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Shoot_BallCharaOrientationModifier

#include "Basic.hpp"

#include "Runtime_structs.hpp"
#include "Runtime_classes.hpp"
#include "SCCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Shoot_BallCharaOrientationModifier.BP_Shoot_BallCharaOrientationModifier_C
// 0x0058 (0x0088 - 0x0030)
class UBP_Shoot_BallCharaOrientationModifier_C final : public UShootModifier
{
public:
	double                                        ForceCoefMaxSpeed;                                 // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShootForceDependingOnShootDirectionFromPlayerDirection; // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            CurveShootForceFromPlayerSpeed;                    // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            CurveRatioFromPlayerOrientation;                   // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            CurveShootForceFromBallSpeed;                      // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            CurveRatioFromBallDirectionDiff;                   // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        MinCharaOrientationForNegativeEffect;              // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            NegativeCurveFromPlayerSpeed;                      // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            PitchDependingForce;                               // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            CurveRatioFromShootForceFactor;                    // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            CurveRatioFromShootImpactHeight;                   // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BPE_ApplyAngle(const class AActor* _actor, const struct FShootPrepTargetData& _ShootData, float* _fPitch, EApplyMode* _PitchApplyMode, float* _fYaw, EApplyMode* _YawApplyMode) const;
	float BPE_ApplyMultiplierForce(const class AActor* _actor, const struct FShootPrepTargetData& _ShootData) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Shoot_BallCharaOrientationModifier_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Shoot_BallCharaOrientationModifier_C")
	}
	static class UBP_Shoot_BallCharaOrientationModifier_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Shoot_BallCharaOrientationModifier_C>();
	}
};
DUMPER7_ASSERTS_UBP_Shoot_BallCharaOrientationModifier_C;

}

