#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SCPlayerCameraManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Runtime_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SCPlayerCameraManager.BP_SCPlayerCameraManager_C
// 0x0090 (0x2580 - 0x24F0)
class ABP_SCPlayerCameraManager_C final : public ARuntimePlayerCameraManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x24F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere;                                            // 0x24F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHandle;                                       // 0x2500(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalCrowdActive;                                  // 0x2508(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2509[0x7];                                     // 0x2509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 MainCageActor;                                     // 0x2510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          UseMainCageActor;                                  // 0x2518(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2519[0x7];                                     // 0x2519(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        UnstoppableThreshold;                              // 0x2520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TimeLocalCrowdActive;                              // 0x2528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CheckAngleRate;                                    // 0x2530(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2534[0x4];                                     // 0x2534(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CrowdTriggerAngle;                                 // 0x2538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      ObjectTypeToCheck;                                 // 0x2540(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                Camera_Forward;                                    // 0x2550(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                AbilitySystemComponent;                            // 0x2568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          InARVolume;                                        // 0x2570(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AsyncTraceOver(const TArray<struct FSCTraceResult>& _results);
	void CheckAngle();
	void ComputeTraceResults(const TArray<struct FSCTraceResult>& _results, bool* CrowdIsVisibleAndNotPlaying, bool* CrowdIsNotVisibleButPlaying);
	void ComputeTraceSetup();
	void ExecuteUbergraph_BP_SCPlayerCameraManager(int32 EntryPoint);
	void IsNotInCineCam(bool* IsNotCineCamera);
	void LaunchAsyncTrace(const TArray<struct FSCTraceSetup>& TraceArray);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SCPlayerCameraManager_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SCPlayerCameraManager_C")
	}
	static class ABP_SCPlayerCameraManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SCPlayerCameraManager_C>();
	}
};
DUMPER7_ASSERTS_ABP_SCPlayerCameraManager_C;

}

