#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpiderCam_2RailLDCameraData

#include "Basic.hpp"

#include "BP_2RailLDCameraActor_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SpiderCam_2RailLDCameraData.BP_SpiderCam_2RailLDCameraData_C
// 0x0030 (0x0DF0 - 0x0DC0)
class ABP_SpiderCam_2RailLDCameraData_C : public ABP_2RailLDCameraActor_C
{
public:
	uint8                                         Pad_DB1[0x7];                                      // 0x0DB1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBoxComponent*                          DebugField;                                        // 0x0DB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               InitOrientation;                                   // 0x0DC0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DebugHandleLockCameraRail;                         // 0x0DD8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD9[0x7];                                      // 0x0DD9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MinAngleToUnlockCameraRail;                        // 0x0DE0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void HandleLockCameraRail();
	void DrawHandleLockCameraRailDebug(double AngleInDegrees, const struct FVector& CamToTargetDir);
	bool BPE_SwitchToLDCamera(const class AActor* _actorToFollowRef, const class AActor* _actorToLookAtRef, TSubclassOf<class USCCameraData> _overrideCamera);
	struct FTransform BPE_GetActorRefTransform(float _fDt);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SpiderCam_2RailLDCameraData_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SpiderCam_2RailLDCameraData_C")
	}
	static class ABP_SpiderCam_2RailLDCameraData_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SpiderCam_2RailLDCameraData_C>();
	}
};
DUMPER7_ASSERTS_ABP_SpiderCam_2RailLDCameraData_C;

}

