#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Sound_Footsteps_Notify

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Sound_Footsteps_Notify.BP_Sound_Footsteps_Notify_C
// 0x0028 (0x0060 - 0x0038)
class UBP_Sound_Footsteps_Notify_C final : public UAnimNotify
{
public:
	double                                        Preview_Speed;                                     // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Event;                                             // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundSurfaceDataAsset_C*               SoundSurface;                                      // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CurrentGroundSurface;                              // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Force_Speed;                                       // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NewVar;                                            // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void FetchSoundData(class AActor* Owner, bool* IsInGameplay, double* PlayerSpeed, bool* IsLocallyControlled, class UAkSwitchValue** SurfaceSwitch, double* PlayerHeight) const;
	float GetDefaultTriggerWeightThreshold() const;
	bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, const struct FAnimNotifyEventReference& EventReference) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Sound_Footsteps_Notify_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Sound_Footsteps_Notify_C")
	}
	static class UBP_Sound_Footsteps_Notify_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Sound_Footsteps_Notify_C>();
	}
};
DUMPER7_ASSERTS_UBP_Sound_Footsteps_Notify_C;

}

