#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SeasonPassTierViewModel

#include "Basic.hpp"

#include "Enum_SP_TiersAnimation_structs.hpp"
#include "SOSBindings_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SeasonPassTierViewModel.BP_SeasonPassTierViewModel_C
// 0x0010 (0x00B0 - 0x00A0)
class UBP_SeasonPassTierViewModel_C final : public USOSBindingsStoreSeasonTierViewModel
{
public:
	int32                                         TierIDOnSlot;                                      // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SlotTiersNbr;                                      // 0x00A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationID;                                       // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_SP_TiersAnimation                        AnimationType;                                     // 0x00AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUnlockedPremiumRewards;                           // 0x00AD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CanUserPurchaseThisTier(int32 STBalance, bool* bCanPurchase) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SeasonPassTierViewModel_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SeasonPassTierViewModel_C")
	}
	static class UBP_SeasonPassTierViewModel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SeasonPassTierViewModel_C>();
	}
};
DUMPER7_ASSERTS_UBP_SeasonPassTierViewModel_C;

}

