#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Tap_AimAssistAngle

#include "Basic.hpp"

#include "Runtime_structs.hpp"
#include "Runtime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Tap_AimAssistAngle.BP_Tap_AimAssistAngle_C
// 0x0040 (0x0080 - 0x0040)
class UBP_Tap_AimAssistAngle_C final : public UAngleShootModifier
{
public:
	double                                        DotAngleForward;                                   // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DotAngleSide;                                      // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AssistanceStrength;                                // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DecelCompensation;                                 // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableDebug;                                       // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaxRange;                                          // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldAllyBeOnScreen;                             // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveVector*                           DistanceByTimeMinMaxCurve;                         // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BPE_ApplyAngle(const class AActor* _actor, const struct FShootPrepTargetData& _ShootData, float* _fPitch, EApplyMode* _PitchApplyMode, float* _fYaw, EApplyMode* _YawApplyMode) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Tap_AimAssistAngle_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Tap_AimAssistAngle_C")
	}
	static class UBP_Tap_AimAssistAngle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Tap_AimAssistAngle_C>();
	}
};
DUMPER7_ASSERTS_UBP_Tap_AimAssistAngle_C;

}

