#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ThumbnailCharacter

#include "Basic.hpp"

#include "SCCharacterCustomization_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ThumbnailCharacter.BP_ThumbnailCharacter_C
// 0x0150 (0x0400 - 0x02B0)
class ABP_ThumbnailCharacter_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Ball;                                              // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SkySphere;                                         // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterCustomizationComponent_C*  BP_CharacterCustomizationComponent;                // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FSCCharacterCustomizationDescription   CharacterCustomization;                            // 0x02D8(0x00F0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UAnimSequence*                          Animation;                                         // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         AnimationPosition;                                 // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsMannequin;                                      // 0x03D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D5[0x3];                                      // 0x03D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCharacterPartEnumHandler>      ThumbnailBodyPart;                                 // 0x03D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsCustoGenerated;                                 // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x3];                                      // 0x03E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           MannequinColor;                                    // 0x03EC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_ThumbnailCustomizableCharacter_BP_CharacterCustomizationComponent_K2Node_ComponentBoundEvent_0_CharacterGeneratedSignature__DelegateSignature(class UCharacterCustomizationComponent* _characterCustomizationComponent, bool _bWasCharacterGenerated);
	void CreateMannequinMaterial(class UMaterialInterface* SourceMaterial, class UMaterialInstanceDynamic** MannequinDyanemicMaterialInstance);
	void ExecuteUbergraph_BP_ThumbnailCharacter(int32 EntryPoint);
	void IsBodyPartMesh(class USkeletalMeshComponent* meshToCheck, bool* bFound);
	void OnCharacterGenerated();
	void SetMainWorld(class UObject* _mainWorldContext);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_ThumbnailCharacter_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ThumbnailCharacter_C")
	}
	static class ABP_ThumbnailCharacter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ThumbnailCharacter_C>();
	}
};
DUMPER7_ASSERTS_ABP_ThumbnailCharacter_C;

}

