#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ThumbnailScene

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCCharacterCustomization_structs.hpp"
#include "Runtime_classes.hpp"
#include "StructUtilsEngine_structs.hpp"
#include "ECharacterPartTypes_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ThumbnailScene.BP_ThumbnailScene_C
// 0x0118 (0x0208 - 0x00F0)
class UBP_ThumbnailScene_C final : public UItemThumbnailScene
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        ViewOffset;                                        // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSCCharacterCustomizationDescription   DefaultCustomization;                              // 0x0100(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class AThumbnailLevelSequenceActor*>   ViewSequences;                                     // 0x01F0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class ABP_ThumbnailLighting_C*                SceneLighting;                                     // 0x0200(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BuildSinglePart(class UObject* Object, const TArray<struct FSCCharacterPartDescription>& Array, struct FCharacterPartEnumHandler* BodyPart, int32* Index_0, struct FSCCharacterPartDescription* Part);
	void ExecuteUbergraph_BP_ThumbnailScene(int32 EntryPoint);
	void FindARInfos(const struct FSCCharacterCustomizationDescription& Description, class UBP_CustomizationARDataAsset_C** DataAsset);
	bool IsBody(class UObject* Object);
	void PrepareScene();
	void Setup_Customization(class ABP_ThumbnailCharacter_C* Character, TArray<struct FCharacterPartEnumHandler>& BodyParts, struct FStruct_ThumbnailSceneParams& Params_0);
	void Setup_Part_Customization(class ABP_ThumbnailCharacter_C* Character, const struct FStruct_ThumbnailSceneParams& Params_0);
	void SetupSequence(class ULevelSequence* Sequence, int32 ViewIndex);
	void SetupSetCustomization(class ABP_ThumbnailCharacter_C* Character, const struct FStruct_ThumbnailSceneParams& Params_0);
	void SetupView(struct FStruct_ThumbnailSceneParams& Params_0, int32* SceneView);

	void GetViewMatrixParameters(int32 SceneView, struct FViewParameters* OutParameters) const;
	void GetViewOffset(int32 ViewIndex, struct FVector* Offset) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_ThumbnailScene_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ThumbnailScene_C")
	}
	static class UBP_ThumbnailScene_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ThumbnailScene_C>();
	}
};
DUMPER7_ASSERTS_UBP_ThumbnailScene_C;

}

