#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UpdateCameraBB

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "SCCore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_UpdateCameraBB.BP_UpdateCameraBB_C
// 0x0130 (0x01D0 - 0x00A0)
class UBP_UpdateCameraBB_C final : public USCUpdateCameraBlackboardBTService
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ARuntimeMatchGameState*                 RuntimeMatchGameState;                             // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 CameraDataPrematch;                                // 0x00B0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 ActorRefPrematch;                                  // 0x00D8(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 CameraDataPrematchWaitingForPlayers;               // 0x0100(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 ActorRefPrematchWaitingForPlayers;                 // 0x0128(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 IsMatchStateWaitingToStart;                        // 0x0150(0x0028)(Edit, BlueprintVisible)
	class ARuntimeGameState*                      RuntimeGameState;                                  // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 SelfActor;                                         // 0x0180(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 SelfASC;                                           // 0x01A8(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BP_UpdateCameraBB(int32 EntryPoint);
	void InitKeys();
	void OnAllPlayerArrivedAndAssigned();
	void OnMatchStateChanged(class FName _newMatchState);
	void ReceiveActivation(class AActor* OwnerActor);
	void ReceiveTick(class AActor* OwnerActor, float DeltaSeconds);
	void TrySetupMatchStateEvent();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_UpdateCameraBB_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_UpdateCameraBB_C")
	}
	static class UBP_UpdateCameraBB_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UpdateCameraBB_C>();
	}
};
DUMPER7_ASSERTS_UBP_UpdateCameraBB_C;

}

