#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VoiceChatVolume_GameOption

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_VoiceChatVolume_GameOption.BP_VoiceChatVolume_GameOption_C.BPE_SetGameOption
// 0x0030 (0x0030 - 0x0000)
struct BP_VoiceChatVolume_GameOption_C_BPE_SetGameOption final
{
public:
	class ASCBasePlayerController*                _controller;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         _fValue;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USOSBindingsSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UModelProxy*                            CallFunc_BPF_GetServicesViewModelProxy_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVoiceChatProxy*                        K2Node_DynamicCast_AsVoice_Chat_Proxy;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_VoiceChatVolume_GameOption_C_BPE_SetGameOption;

}

