#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VisualLoggerSnapshot

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_VisualLoggerSnapshot.BP_VisualLoggerSnapshot_C.BndEvt__EditableText_156_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_VisualLoggerSnapshot_C_BndEvt__EditableText_156_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_VisualLoggerSnapshot_C_BndEvt__EditableText_156_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature;

// Function BP_VisualLoggerSnapshot.BP_VisualLoggerSnapshot_C.ExecuteUbergraph_BP_VisualLoggerSnapshot
// 0x0080 (0x0080 - 0x0000)
struct BP_VisualLoggerSnapshot_C_ExecuteUbergraph_BP_VisualLoggerSnapshot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0040(0x0010)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_BPF_TakeVisualLoggerSnapshot__outError;   // 0x0068(0x0010)()
	bool                                          CallFunc_BPF_TakeVisualLoggerSnapshot_ReturnValue; // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_VisualLoggerSnapshot_C_ExecuteUbergraph_BP_VisualLoggerSnapshot;

// Function BP_VisualLoggerSnapshot.BP_VisualLoggerSnapshot_C.Tick
// 0x003C (0x003C - 0x0000)
struct BP_VisualLoggerSnapshot_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_VisualLoggerSnapshot_C_Tick;

}

