#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_ResetPosition

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTTask_ResetPosition.BTTask_ResetPosition_C
// 0x0028 (0x00D0 - 0x00A8)
class UBTTask_ResetPosition_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ARuntimeCharacter*                      Player;                                            // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         ResetAfterPickupDuration;                          // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ForceResetAfterDuration;                           // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           HandleDelayForceReset;                             // 0x00C0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           HandleDelayResetAfterPickup;                       // 0x00C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BPE_OnBallOwnershipGained_Event_0(class ABall* Ball);
	void ExecuteUbergraph_BTTask_ResetPosition(int32 EntryPoint);
	void OnForceResetAfterDuration();
	void OnResetAfterPickup();
	void ReceiveAbort(class AActor* OwnerActor);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTTask_ResetPosition_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTTask_ResetPosition_C")
	}
	static class UBTTask_ResetPosition_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_ResetPosition_C>();
	}
};
DUMPER7_ASSERTS_UBTTask_ResetPosition_C;

}

