#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonGame

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CommonGame_structs.hpp"
#include "CommonUser_structs.hpp"
#include "ModularGameplayActors_classes.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "CommonInput_structs.hpp"
#include "CommonUI_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class CommonGame.AsyncAction_CreateWidgetAsync
// 0x0070 (0x00A0 - 0x0030)
class UAsyncAction_CreateWidgetAsync final : public UCancellableAsyncAction
{
public:
	TMulticastInlineDelegate<void(class UUserWidget* UserWidget)> OnComplete;                        // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x60];                                      // 0x0040(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncAction_CreateWidgetAsync* CreateWidgetAsync(class UObject* WorldContextObject, TSoftClassPtr<class UClass> UserWidgetSoftClass, class APlayerController* OwningPlayer, bool bSuspendInputUntilComplete);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncAction_CreateWidgetAsync")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncAction_CreateWidgetAsync")
	}
	static class UAsyncAction_CreateWidgetAsync* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncAction_CreateWidgetAsync>();
	}
};
DUMPER7_ASSERTS_UAsyncAction_CreateWidgetAsync;

// Class CommonGame.AsyncAction_PushContentToLayerForPlayer
// 0x0070 (0x00A0 - 0x0030)
class UAsyncAction_PushContentToLayerForPlayer final : public UCancellableAsyncAction
{
public:
	TMulticastInlineDelegate<void(class UCommonActivatableWidget* UserWidget)> BeforePush;           // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UCommonActivatableWidget* UserWidget)> AfterPush;            // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x50];                                      // 0x0050(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncAction_PushContentToLayerForPlayer* PushContentToLayerForPlayer(class APlayerController* OwningPlayer, TSoftClassPtr<class UClass> WidgetClass, const struct FGameplayTag& LayerName, bool bSuspendInputUntilComplete);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncAction_PushContentToLayerForPlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncAction_PushContentToLayerForPlayer")
	}
	static class UAsyncAction_PushContentToLayerForPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncAction_PushContentToLayerForPlayer>();
	}
};
DUMPER7_ASSERTS_UAsyncAction_PushContentToLayerForPlayer;

// Class CommonGame.AsyncAction_ShowConfirmation
// 0x0028 (0x0058 - 0x0030)
class UAsyncAction_ShowConfirmation final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(ECommonMessagingResult Result)> OnResult;                          // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0040(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ULocalPlayer*                           TargetLocalPlayer;                                 // 0x0048(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonGameDialogDescriptor*            Descriptor;                                        // 0x0050(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UAsyncAction_ShowConfirmation* ShowConfirmationCustom(class UObject* InWorldContextObject, class UCommonGameDialogDescriptor* Descriptor_0);
	static class UAsyncAction_ShowConfirmation* ShowConfirmationOkCancel(class UObject* InWorldContextObject, const class FText& Title, const class FText& Message);
	static class UAsyncAction_ShowConfirmation* ShowConfirmationYesNo(class UObject* InWorldContextObject, const class FText& Title, const class FText& Message);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncAction_ShowConfirmation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncAction_ShowConfirmation")
	}
	static class UAsyncAction_ShowConfirmation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncAction_ShowConfirmation>();
	}
};
DUMPER7_ASSERTS_UAsyncAction_ShowConfirmation;

// Class CommonGame.CommonGameInstance
// 0x0010 (0x01D0 - 0x01C0)
class UCommonGameInstance : public UGameInstance
{
public:
	uint8                                         Pad_1C0[0x8];                                      // 0x01C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonSession_SearchResult*            RequestedSession;                                  // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandlePrivilegeChanged(const class UCommonUserInfo* UserInfo, ECommonUserPrivilege Privilege, ECommonUserAvailability OldAvailability, ECommonUserAvailability NewAvailability);
	void HandlerUserInitialized(const class UCommonUserInfo* UserInfo, bool bSuccess, const class FText& Error, ECommonUserPrivilege RequestedPrivilege, ECommonUserOnlineContext OnlineContext);
	void HandleSystemMessage(const struct FGameplayTag& MessageType, const class FText& Title, const class FText& Message);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonGameInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonGameInstance")
	}
	static class UCommonGameInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonGameInstance>();
	}
};
DUMPER7_ASSERTS_UCommonGameInstance;

// Class CommonGame.CommonLocalPlayer
// 0x0050 (0x0300 - 0x02B0)
class UCommonLocalPlayer : public ULocalPlayer
{
public:
	uint8                                         Pad_2B0[0x50];                                     // 0x02B0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonLocalPlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonLocalPlayer")
	}
	static class UCommonLocalPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonLocalPlayer>();
	}
};
DUMPER7_ASSERTS_UCommonLocalPlayer;

// Class CommonGame.CommonPlayerController
// 0x0000 (0x0880 - 0x0880)
class ACommonPlayerController : public AModularPlayerController
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonPlayerController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonPlayerController")
	}
	static class ACommonPlayerController* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACommonPlayerController>();
	}
};
DUMPER7_ASSERTS_ACommonPlayerController;

// Class CommonGame.CommonPlayerInputKey
// 0x0440 (0x07F0 - 0x03B0)
class UCommonPlayerInputKey final : public UCommonUserWidget
{
public:
	class FName                                   BoundAction;                                       // 0x03B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AxisScale;                                         // 0x03B8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   BoundKeyFallback;                                  // 0x03C0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECommonInputType                              InputTypeOverride;                                 // 0x03D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D9[0x3];                                      // 0x03D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   PresetNameOverride;                                // 0x03DC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECommonKeybindForcedHoldStatus                ForcedHoldKeybindStatus;                           // 0x03E4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsHoldKeybind;                                    // 0x03E5(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowKeybindBorder;                                // 0x03E6(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3E7[0x1];                                      // 0x03E7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              FrameSize;                                         // 0x03E8(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowTimeCountDown;                                // 0x03F8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   BoundKey;                                          // 0x0400(0x0018)(BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            HoldProgressBrush;                                 // 0x0420(0x00D0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                            KeyBindTextBorder;                                 // 0x04F0(0x00D0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                          bShowUnboundStatus;                                // 0x05C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5C1[0x7];                                      // 0x05C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         KeyBindTextFont;                                   // 0x05C8(0x0060)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateFontInfo                         CountdownTextFont;                                 // 0x0628(0x0060)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMeasuredText                          CountdownText;                                     // 0x0688(0x0028)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FMeasuredText                          KeybindText;                                       // 0x06B0(0x0028)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FMargin                                KeybindTextPadding;                                // 0x06D8(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FVector2D                              KeybindFrameMinimumSize;                           // 0x06E8(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   PercentageMaterialParameterName;                   // 0x06F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               ProgressPercentageMID;                             // 0x0700(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_708[0x18];                                     // 0x0708(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CachedKeyBrush;                                    // 0x0720(0x00D0)(Transient, NativeAccessSpecifierPrivate)

public:
	void SetAxisScale(const float NewValue);
	void SetBoundAction(class FName NewBoundAction);
	void SetBoundKey(const struct FKey& NewBoundAction);
	void SetForcedHoldKeybind(bool InForcedHoldKeybind);
	void SetForcedHoldKeybindStatus(ECommonKeybindForcedHoldStatus InForcedHoldKeybindStatus);
	void SetPresetNameOverride(const class FName NewValue);
	void SetShowProgressCountDown(bool bShow);
	void StartHoldProgress(class FName HoldActionName, float HoldDuration);
	void StopHoldProgress(class FName HoldActionName, bool bCompletedSuccessfully);
	void UpdateKeybindWidget();

	bool IsBoundKeyValid() const;
	bool IsHoldKeybind() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonPlayerInputKey")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonPlayerInputKey")
	}
	static class UCommonPlayerInputKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonPlayerInputKey>();
	}
};
DUMPER7_ASSERTS_UCommonPlayerInputKey;

// Class CommonGame.CommonUIExtensions
// 0x0000 (0x0028 - 0x0028)
class UCommonUIExtensions final : public UBlueprintFunctionLibrary
{
public:
	static class UCommonActivatableWidget* GetContentFromLayer_ForPlayer(const class ULocalPlayer* LocalPlayer, const struct FGameplayTag& LayerName, TSoftClassPtr<class UClass> ActivatableWidgetClass);
	static class ULocalPlayer* GetLocalPlayerFromController(class APlayerController* PlayerController);
	static ECommonInputType GetOwningPlayerInputType(const class UUserWidget* WidgetContextObject);
	static class UCommonActivatableWidget* GetTopContentFromLayer_ForPlayer(const class ULocalPlayer* LocalPlayer, const struct FGameplayTag& LayerName);
	static bool IsContentInLayer(const class ULocalPlayer* LocalPlayer, const struct FGameplayTag& LayerName, TSoftClassPtr<class UClass> ActivatableWidgetClass);
	static bool IsOwningPlayerUsingGamepad(const class UUserWidget* WidgetContextObject);
	static bool IsOwningPlayerUsingTouch(const class UUserWidget* WidgetContextObject);
	static void PopAllContentFromLayer(const class ULocalPlayer* LocalPlayer, const struct FGameplayTag& LayerName);
	static void PopContentFromLayer(class UCommonActivatableWidget* ActivatableWidget);
	static void PopContentFromLayerByClass(const class ULocalPlayer* LocalPlayer, const struct FGameplayTag& LayerName, TSoftClassPtr<class UClass> ActivatableWidgetClass);
	static bool PopTopContentFromLayer(const class ULocalPlayer* LocalPlayer, const struct FGameplayTag& LayerName);
	static class UCommonActivatableWidget* PushContentToLayer_ForPlayer(const class ULocalPlayer* LocalPlayer, const struct FGameplayTag& LayerName, TSubclassOf<class UCommonActivatableWidget> WidgetClass);
	static void PushStreamedContentToLayer_ForPlayer(const class ULocalPlayer* LocalPlayer, const struct FGameplayTag& LayerName, TSoftClassPtr<class UClass> WidgetClass);
	static void ResumeInputForPlayer(class APlayerController* PlayerController, class FName SuspendToken);
	static class FName SuspendInputForPlayer(class APlayerController* PlayerController, class FName SuspendReason);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonUIExtensions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonUIExtensions")
	}
	static class UCommonUIExtensions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonUIExtensions>();
	}
};
DUMPER7_ASSERTS_UCommonUIExtensions;

// Class CommonGame.GameUIManagerSubsystem
// 0x0030 (0x0060 - 0x0030)
class UGameUIManagerSubsystem : public UGameInstanceSubsystem
{
public:
	class UGameUIPolicy*                          CurrentPolicy;                                     // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   DefaultUIPolicyClass;                              // 0x0038(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameUIManagerSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameUIManagerSubsystem")
	}
	static class UGameUIManagerSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameUIManagerSubsystem>();
	}
};
DUMPER7_ASSERTS_UGameUIManagerSubsystem;

// Class CommonGame.GameUIPolicy
// 0x0040 (0x0068 - 0x0028)
class UGameUIPolicy : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   LayoutClass;                                       // 0x0030(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FRootViewportLayoutInfo>        RootViewportLayouts;                               // 0x0058(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameUIPolicy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameUIPolicy")
	}
	static class UGameUIPolicy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameUIPolicy>();
	}
};
DUMPER7_ASSERTS_UGameUIPolicy;

// Class CommonGame.CommonGameDialogDescriptor
// 0x0030 (0x0058 - 0x0028)
class UCommonGameDialogDescriptor final : public UObject
{
public:
	class FText                                   Header;                                            // 0x0028(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   Body;                                              // 0x0038(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FConfirmationDialogAction>      ButtonActions;                                     // 0x0048(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonGameDialogDescriptor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonGameDialogDescriptor")
	}
	static class UCommonGameDialogDescriptor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonGameDialogDescriptor>();
	}
};
DUMPER7_ASSERTS_UCommonGameDialogDescriptor;

// Class CommonGame.CommonGameDialog
// 0x0000 (0x04D8 - 0x04D8)
class UCommonGameDialog final : public UCommonActivatableWidget
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonGameDialog")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonGameDialog")
	}
	static class UCommonGameDialog* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonGameDialog>();
	}
};
DUMPER7_ASSERTS_UCommonGameDialog;

// Class CommonGame.CommonMessagingSubsystem
// 0x0000 (0x0030 - 0x0030)
class UCommonMessagingSubsystem final : public ULocalPlayerSubsystem
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonMessagingSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonMessagingSubsystem")
	}
	static class UCommonMessagingSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonMessagingSubsystem>();
	}
};
DUMPER7_ASSERTS_UCommonMessagingSubsystem;

// Class CommonGame.PrimaryGameLayout
// 0x0098 (0x0448 - 0x03B0)
class UPrimaryGameLayout : public UCommonUserWidget
{
public:
	uint8                                         Pad_3B0[0x48];                                     // 0x03B0(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, class UCommonActivatableWidgetContainerBase*> Layers;                  // 0x03F8(0x0050)(ExportObject, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	void RegisterLayer(const struct FGameplayTag& LayerTag, class UCommonActivatableWidgetContainerBase* LayerWidget);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PrimaryGameLayout")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrimaryGameLayout")
	}
	static class UPrimaryGameLayout* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrimaryGameLayout>();
	}
};
DUMPER7_ASSERTS_UPrimaryGameLayout;

}

