#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DiveHorizontal_DataStruct

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct DiveHorizontal_DataStruct.DiveHorizontal_DataStruct
// 0x0030 (0x0030 - 0x0000)
struct FDiveHorizontal_DataStruct final
{
public:
	int32                                         GameplayFrames_Buildup_113_76421B464FE050DD89D19AB9CC0E2784; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GameplayFrames_Motion_114_8B08F3874E6BD7EC1DD37684D527DA2C; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GameplayFrames_Recovery_115_2F2700EF4E116F9B291112B5AFA4AF5A; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AL_FramesFromEnd_117_C494AFF943AA73A857CC499BE1CFCB45; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationFrames_BuildUp_128_F7A5B75E4FF72FA0A3C046965C654108; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationFrames_Motion_129_AF1429294F3C868CB5B30ABFFCE1B459; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationFrames_Recovery_130_18775FBD4DFFBD1D4D047DAA01FD3072; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FrameAdjustment_125_372814D54D0DD64873000986E95AD19D; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ApexTimeStretch_FirstFrame_126_5A36964444A541733B314CB88350187C; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ApexTimeStretch_LastFrame_127_ED5072854AAAC61DAA4134B5DC6F4488; // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FDiveHorizontal_DataStruct;

}

