#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DribbleTableRow

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct DribbleTableRow.DribbleTableRow
// 0x0028 (0x0028 - 0x0000)
struct FDribbleTableRow final
{
public:
	class UClass*                                 DribbleSpeedRootModifierData_38_30D42D7241AAA6F4174E809E3D27972E; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        DurationBeforeApplyTags_67_26D8E2064D90DABED64FCBBB0EC753F9; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TagsDuration_69_6ECF23054CB8E90D363965953280F8CA;  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DribbleEndNotifyFrame_82_34B6888B4200CF22CDD15CB7FE9925EC; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 AvailabilityLayer_85_AEC1DFF7490D2EE908FCCB9FC0CDB82F; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FDribbleTableRow;

}

