#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DribbleGlobalTableRow

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct DribbleGlobalTableRow.DribbleGlobalTableRow
// 0x0028 (0x0028 - 0x0000)
struct FDribbleGlobalTableRow final
{
public:
	int32                                         SnapStartFrame_70_4163A72D48748CAD68FB5DB57B54DA14; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ShootFrame_66_D1F1452C4548C3B287571A907117113A;    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FreezeFrameDuration_63_C6A0693B43D3E810F90F6B9023EA522C; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RedirectionStartFrameFromShoot_72_C3D0C17846623A2D1E7F26A9CBF6DED6; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RedirectionEndFrameFromShoot_79_C2D28E3A49F05661265596832187B60F; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ALStartFrame_68_50652EDB47593573DE280F9C3423F311;  // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FlyModeStartFrame_77_1FAE01494C3ED6875CD651A999136D5F; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FlyModeEndFrame_80_DDFECDB743C6B7A96BFEE9A654FF1D5D; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 DashSpeedRootModifierData_40_E99E3C6148B58E9233EA0AB37AE5E513; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FDribbleGlobalTableRow;

}

