#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EQC_EnemyGoal

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass EQC_EnemyGoal.EQC_EnemyGoal_C
// 0x0028 (0x0058 - 0x0030)
class UEQC_EnemyGoal_C final : public UEnvQueryContext_BlueprintBase
{
public:
	bool                                          NewVar;                                            // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         EQS_Team;                                          // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGoal*                                  Goal;                                              // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NewVar_0;                                          // 0x0040(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ProvideSingleLocation(class UObject* QuerierObject, class AActor* QuerierActor, struct FVector* ResultingLocation) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("EQC_EnemyGoal_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EQC_EnemyGoal_C")
	}
	static class UEQC_EnemyGoal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEQC_EnemyGoal_C>();
	}
};
DUMPER7_ASSERTS_UEQC_EnemyGoal_C;

}

