#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EV_GetAISubsystemData

#include "Basic.hpp"


namespace SDK::Params
{

// Function EV_GetAISubsystemData.EV_GetAISubsystemData_C.ExecuteUbergraph_EV_GetAISubsystemData
// 0x0020 (0x0020 - 0x0000)
struct EV_GetAISubsystemData_C_ExecuteUbergraph_EV_GetAISubsystemData final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARuntimeCharacter*>              CallFunc_BPF_GetPlayersClosestToBall_ReturnValue;  // 0x0008(0x0010)(ReferenceParm)
	float                                         K2Node_Event_DeltaTime;                            // 0x0018(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EV_GetAISubsystemData_C_ExecuteUbergraph_EV_GetAISubsystemData;

// Function EV_GetAISubsystemData.EV_GetAISubsystemData_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct EV_GetAISubsystemData_C_ReceiveTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EV_GetAISubsystemData_C_ReceiveTick;

// Function EV_GetAISubsystemData.EV_GetAISubsystemData_C.Setup Var
// 0x0030 (0x0030 - 0x0000)
struct EV_GetAISubsystemData_C_Setup_Var final
{
public:
	TArray<class ARuntimeCharacter*>              CallFunc_BPF_GetGoalKeepers_ReturnValue;           // 0x0000(0x0010)(ReferenceParm)
	TArray<class ARuntimeCharacter*>              CallFunc_BPF_GetOpponents_ReturnValue;             // 0x0010(0x0010)(ReferenceParm)
	TArray<class ARuntimeCharacter*>              CallFunc_BPF_GetTeammates_ReturnValue;             // 0x0020(0x0010)(ReferenceParm)
};
DUMPER7_ASSERTS_EV_GetAISubsystemData_C_Setup_Var;

}

