#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EV_GetRuntimeCharData

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "StateTreeModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass EV_GetRuntimeCharData.EV_GetRuntimeCharData_C
// 0x0048 (0x0090 - 0x0048)
class UEV_GetRuntimeCharData_C final : public UStateTreeEvaluatorBlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0048(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AAIController*                          AIController;                                      // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ARuntimeCharacter*                      Runtime_Character;                                 // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0060(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Char_Team;                                         // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URuntimeAISubsystem*                    AISubsystem;                                       // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          GkBallInHand;                                      // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_EV_GetRuntimeCharData(int32 EntryPoint);
	void ReceiveTick(const float DeltaTime);
	void ReceiveTreeStart();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("EV_GetRuntimeCharData_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EV_GetRuntimeCharData_C")
	}
	static class UEV_GetRuntimeCharData_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEV_GetRuntimeCharData_C>();
	}
};
DUMPER7_ASSERTS_UEV_GetRuntimeCharData_C;

}

