#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EV_GetAISubsystem

#include "Basic.hpp"


namespace SDK::Params
{

// Function EV_GetAISubsystem.EV_GetAISubsystem_C.ExecuteUbergraph_EV_GetAISubsystem
// 0x0020 (0x0020 - 0x0000)
struct EV_GetAISubsystem_C_ExecuteUbergraph_EV_GetAISubsystem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USCWorldSubsystem*                      CallFunc_BPF_GetWorldSubsystem_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_RuntimeAISubsystem_C*               K2Node_DynamicCast_AsBP_Runtime_AISubsystem;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EV_GetAISubsystem_C_ExecuteUbergraph_EV_GetAISubsystem;

}

