#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EV_GetGoalsData

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "StateTreeModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass EV_GetGoalsData.EV_GetGoalsData_C
// 0x0058 (0x00A0 - 0x0048)
class UEV_GetGoalsData_C final : public UStateTreeEvaluatorBlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0048(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AGoal*                                  Goal;                                              // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Goal_Location;                                     // 0x0058(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGoal*                                  Opponent_Goal;                                     // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Opponent_Goal_Location;                            // 0x0078(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URuntimeAISubsystem*                    AISubsystem;                                       // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Player_Team;                                       // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_EV_GetGoalsData(int32 EntryPoint);
	void ReceiveTreeStart();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("EV_GetGoalsData_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EV_GetGoalsData_C")
	}
	static class UEV_GetGoalsData_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEV_GetGoalsData_C>();
	}
};
DUMPER7_ASSERTS_UEV_GetGoalsData_C;

}

