#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FastTapTableRow

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FastTapTableRow.FastTapTableRow
// 0x0030 (0x0030 - 0x0000)
struct FFastTapTableRow final
{
public:
	int32                                         BuildUpDuration_3_6CC3915F462A28C13118E4B967CBF072; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 DashModifierData_6_41995C0C40D4B40688818F93FD2E1238; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         DashDuration_9_A445E99446B50A1D522583A206760260;   // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 BuildUpModifierData_12_1C2ED4F841F7E0742791D2BF63CB02C4; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         AvailabilityStartFrameRelativeToAnimStart_17_54EA8DA84E3B5D64186BB59A765CA50E; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AvailabilityEndFrameRelativeToAnimEnd_18_A204FCDA4FD909B19E98D98B86069DA6; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FreezeFrameDuration_21_8FF165C340711C5088DDCEBA7E36EB33; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FFastTapTableRow;

}

