#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_AbstractGoToMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Runtime_classes.hpp"
#include "SCCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_AbstractGoToMenu.GA_AbstractGoToMenu_C
// 0x0078 (0x06D0 - 0x0658)
class UGA_AbstractGoToMenu_C : public URuntimeGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0658(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   TransitionName;                                    // 0x0660(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPopMenuOnDeactivation;                            // 0x0668(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_669[0x3];                                      // 0x0669(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           StateToPop;                                        // 0x066C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_674[0x4];                                      // 0x0674(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USCGameFlowSubsystem*                   GameFlowSubsystem;                                 // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<TSoftClassPtr<class UClass>, class FName> PlayerControllerToTransitionNameOverride;         // 0x0680(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_AbstractGoToMenu(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void m_OnTrigger_98A9DA1B4A332F2106BABEB9FA0E8AC3(const struct FInputActionState& _state, bool _bActivated);

	void GetTransitionName(class FName* TransitionName_0) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_AbstractGoToMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_AbstractGoToMenu_C")
	}
	static class UGA_AbstractGoToMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_AbstractGoToMenu_C>();
	}
};
DUMPER7_ASSERTS_UGA_AbstractGoToMenu_C;

}

