#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_BaseShoot

#include "Basic.hpp"

#include "Runtime_structs.hpp"
#include "Runtime_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SCCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_BaseShoot.GA_BaseShoot_C
// 0x0410 (0x0DC0 - 0x09B0)
#pragma pack(push, 0x1)
class alignas(0x10) UGA_BaseShoot_C : public URuntimeShootGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         ShootPrepPriority;                                 // 0x09B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9BC[0x4];                                      // 0x09BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FShootParams                           ShootParams;                                       // 0x09C0(0x0108)(Edit, BlueprintVisible, DisableEditOnInstance, AdvancedDisplay)
	class UAbilityTask_PlayMontageAndWait*        PlayMontageTask;                                   // 0x0AC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           BeforeShootPhaseTag;                               // 0x0AD0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           AfterShootPhaseTag;                                // 0x0AD8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  DataAppliedGameplayTag;                            // 0x0AE0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsSprinting;                                       // 0x0B00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_B01[0xF];                                      // 0x0B01(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTargetingContext                      TargetingContextData;                              // 0x0B10(0x00E0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           ShootDirectionName;                                // 0x0BF0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash)
	int32                                         iLookAtHandle;                                     // 0x0BF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BFC[0x4];                                      // 0x0BFC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSCCameraLookAtServiceBehavior         CameraLookAtParams;                                // 0x0C00(0x0188)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         MinDistanceForLookAt;                              // 0x0D88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D8C[0x4];                                      // 0x0D8C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnPostLookAt;                                      // 0x0D90(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          UseTargetLookAt;                                   // 0x0DA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA1[0x7];                                      // 0x0DA1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MinDistanceBetweenTargetAndPlayerForLookAt;        // 0x0DA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LockCameraOption;                                  // 0x0DB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BindLookatOnFreezeFrameEnd(class ABall* Ball);
	void ExecuteUbergraph_GA_BaseShoot(int32 EntryPoint);
	void FindAimPointByCamera(ELockDirectionOption LockDirectionOption, class ABall* Ball, struct FVector* Aim_Point);
	void RemoveLookAt();
	void TriggerFinalLookAt(class ABall* _ball, const struct FBounceData& _bounceData, float _fSpeedAtBounce);
	void TriggerLookAtToAimPoint(class ABall* Ball, ELockDirectionOption LockDirectionOption);
	void TryToTriggerLookAt(ELockDirectionOption LockDirectionOption, class ABall* Ball);

	void MakeShootDirectionTargetData(const struct FShootPrepTargetData& InShootPrep, struct FGameplayAbilityTargetDataHandle* Result) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_BaseShoot_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_BaseShoot_C")
	}
	static class UGA_BaseShoot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_BaseShoot_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UGA_BaseShoot_C;

}

