#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_BallSteal_Base

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "FreezeFrameOverrideStruct_structs.hpp"
#include "SCCombatSystem_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SCCore_structs.hpp"


namespace SDK::Params
{

// Function GA_BallSteal_Base.GA_BallSteal_Base_C.ExecuteUbergraph_GA_BallSteal_Base
// 0x3060 (0x3060 - 0x0000)
struct GA_BallSteal_Base_C_ExecuteUbergraph_GA_BallSteal_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityExecOrigin                            Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget)> K2Node_CreateDelegate_OutputDelegate; // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPendingHit                            K2Node_CustomEvent__hit_5;                         // 0x0020(0x0350)(ConstParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent__context_5;                     // 0x0370(0x0028)()
	class UAbilityTask_HandleHitboxBase*          K2Node_CustomEvent__payloadTarget_5;               // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPendingHit                            K2Node_CustomEvent__hit_4;                         // 0x03A0(0x0350)(ConstParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent__context_4;                     // 0x06F0(0x0028)()
	class UAbilityTask_HandleHitboxBase*          K2Node_CustomEvent__payloadTarget_4;               // 0x0718(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0720(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPendingHit                            K2Node_CustomEvent__hit_3;                         // 0x0730(0x0350)(ConstParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent__context_3;                     // 0x0A80(0x0028)()
	class UAbilityTask_HandleHitboxBase*          K2Node_CustomEvent__payloadTarget_3;               // 0x0AA8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0AB0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPendingHit                            K2Node_CustomEvent__hit_2;                         // 0x0AC0(0x0350)(ConstParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent__context_2;                     // 0x0E10(0x0028)()
	class UAbilityTask_HandleHitboxBase*          K2Node_CustomEvent__payloadTarget_2;               // 0x0E38(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0E40(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPendingHit                            K2Node_CustomEvent__hit_1;                         // 0x0E50(0x0350)(ConstParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent__context_1;                     // 0x11A0(0x0028)()
	class UAbilityTask_HandleHitboxBase*          K2Node_CustomEvent__payloadTarget_1;               // 0x11C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget)> K2Node_CreateDelegate_OutputDelegate_4; // 0x11D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPendingHit                            K2Node_CustomEvent__hit;                           // 0x11E0(0x0350)(ConstParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent__context;                       // 0x1530(0x0028)()
	class UAbilityTask_HandleHitboxBase*          K2Node_CustomEvent__payloadTarget;                 // 0x1558(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget)> K2Node_CreateDelegate_OutputDelegate_5; // 0x1560(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_HandleHitboxBase*          Temp_object_Variable;                              // 0x1570(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x1578(0x0028)()
	struct FPendingHit                            Temp_struct_Variable_1;                            // 0x15A0(0x0350)(ContainsInstancedReference)
	class UAbilityTask_HandleAttack*              CallFunc_BPF_HandleAttack_ReturnValue;             // 0x18F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x18F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18F9[0x7];                                     // 0x18F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNamedFloatTargetData                  K2Node_MakeStruct_NamedFloatTargetData;            // 0x1900(0x0020)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle;          // 0x1920(0x0028)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x1948(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_NetworkHitProjection*      CallFunc_BPF_NetworkHitProjection_ReturnValue;     // 0x1958(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x1960(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1961[0x7];                                     // 0x1961(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue;                  // 0x1968(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x1970(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x1980(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1981[0x7];                                     // 0x1981(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Data;                           // 0x1988(0x0028)(ConstParm)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> K2Node_CreateDelegate_OutputDelegate_8; // 0x19B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_2;                            // 0x19C0(0x0028)()
	uint8                                         Pad_19E8[0x8];                                     // 0x19E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitTargetDataHandle                   CallFunc_GetTargetData__outData;                   // 0x19F0(0x03A0)(ContainsInstancedReference)
	bool                                          CallFunc_GetTargetData_ReturnValue;                // 0x1D90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityExecOrigin                            Temp_byte_Variable_1;                              // 0x1D91(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x1D92(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D93[0x1];                                     // 0x1D93(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x1D94(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x1DA4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x1DB4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x1DC4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x1DD4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_14;           // 0x1DE4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_15;           // 0x1DF4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_16;           // 0x1E04(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E14[0x4];                                     // 0x1E14(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_SCPlayMontageAndWait*      CallFunc_BPF_PlayServerMontage_ReturnValue;        // 0x1E18(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_17;           // 0x1E20(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x1E30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E31[0x3];                                     // 0x1E31(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_18;           // 0x1E34(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_19;           // 0x1E44(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_20;           // 0x1E54(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_21;           // 0x1E64(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_22;           // 0x1E74(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_23;           // 0x1E84(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_24;           // 0x1E94(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_25;           // 0x1EA4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_26;           // 0x1EB4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_27;           // 0x1EC4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ED4[0x4];                                     // 0x1ED4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue_1;                // 0x1ED8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x1EE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EE1[0x3];                                     // 0x1EE1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_28;           // 0x1EE4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x1EF4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasBallControlNeededTag_ReturnValue;      // 0x1EF5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityExecOrigin                            K2Node_Event_AbilityExec;                          // 0x1EF6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EF7[0x9];                                     // 0x1EF7(0x0009)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPendingHit                            K2Node_Event_Hit_Description;                      // 0x1F00(0x0350)(ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       K2Node_Event_Player_Context;                       // 0x2250(0x0028)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x2278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2279[0x7];                                     // 0x2279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARuntimeCharacter*                      CallFunc_BPF_GetRuntimeCharacter_ReturnValue;      // 0x2280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2288[0x8];                                     // 0x2288(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTargetingContext                      CallFunc_BPF_SaveActorState__targetingContext;     // 0x2290(0x00E0)()
	EAbilityExecOrigin                            Temp_byte_Variable_2;                              // 0x2370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x2371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2372[0xE];                                     // 0x2372(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPendingHit                            K2Node_CustomEvent_Hit_Description_1;              // 0x2380(0x0350)(ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Player_Context_1;               // 0x26D0(0x0028)()
	uint8                                         Pad_26F8[0x8];                                     // 0x26F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPendingHit                            K2Node_CustomEvent_Hit_Description;                // 0x2700(0x0350)(ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Player_Context;                 // 0x2A50(0x0028)()
	EAbilityExecOrigin                            CallFunc_BPF_SetNamedBoolTargetData__eOut;         // 0x2A78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPF_SetNamedBoolTargetData_ReturnValue;   // 0x2A79(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x2A7A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A7B[0x1];                                     // 0x2A7B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_29;           // 0x2A7C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAbilityExecOrigin                            CallFunc_BPF_SetNamedFloatTargetData__eOut;        // 0x2A8C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A8D[0x3];                                     // 0x2A8D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BPF_SetNamedFloatTargetData_ReturnValue;  // 0x2A90(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A94[0x4];                                     // 0x2A94(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_ComputeFreezeFrame_ReturnValue;           // 0x2A98(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x2AA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x2AA1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AA2[0x2];                                     // 0x2AA2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_30;           // 0x2AA4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_31;           // 0x2AB4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_32;           // 0x2AC4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AD4[0x4];                                     // 0x2AD4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x2AD8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x2AE0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x2AE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x2AE9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AEA[0x2];                                     // 0x2AEA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_33;           // 0x2AEC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x2AFC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AFD[0x3];                                     // 0x2AFD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle_1;        // 0x2B00(0x0028)()
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x2B28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x2B29(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B2A[0x2];                                     // 0x2B2A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_34;           // 0x2B2C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B3C[0x4];                                     // 0x2B3C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle_2;        // 0x2B40(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeBallStealTargetData_ReturnValue;      // 0x2B68(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_GetProvidedTargetData__outData;           // 0x2B90(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue; // 0x2BB8(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_GetProvidedTargetData__outData_1;         // 0x2BE0(0x0028)()
	class UAbilityTask_SCStartAbilityState*       CallFunc_BPF_StartAbilityState_ReturnValue;        // 0x2C08(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputGameplayAbilityTargetData        CallFunc_BPF_FindInputTargetData__outData;         // 0x2C10(0x0058)()
	bool                                          CallFunc_BPF_FindInputTargetData_ReturnValue;      // 0x2C68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C69[0x7];                                     // 0x2C69(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle_3;        // 0x2C70(0x0028)()
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x2C98(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C99[0x7];                                     // 0x2C99(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue_1; // 0x2CA0(0x0028)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x2CC8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FNamedFloatTargetData                  K2Node_MakeStruct_NamedFloatTargetData_1;          // 0x2CD0(0x0020)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x2CF0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle_4;        // 0x2CF8(0x0028)()
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x2D20(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue_2; // 0x2D28(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeBallStealTargetData_ReturnValue_1;    // 0x2D50(0x0028)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_35;           // 0x2D78(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x2D88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x2D90(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x2D98(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x2DA0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_1;                       // 0x2DA8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityExecOrigin                            Temp_byte_Variable_3;                              // 0x2DB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityExecOutputWithValidation              CallFunc_BPF_PickAndPlaySlotMontage__eOut;         // 0x2DB1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DB2[0x6];                                     // 0x2DB2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_SCPlaySlotMontageAndWait*  CallFunc_BPF_PickAndPlaySlotMontage_ReturnValue;   // 0x2DB8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x2DC0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC1[0x3];                                     // 0x2DC1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_BPF_GetSlot_ReturnValue;                  // 0x2DC4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x2DCC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DCD[0x3];                                     // 0x2DCD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_GetProvidedTargetData__outData_2;         // 0x2DD0(0x0028)()
	struct FInputGameplayAbilityTargetData        CallFunc_BPF_FindInputTargetData__outData_1;       // 0x2DF8(0x0058)()
	bool                                          CallFunc_BPF_FindInputTargetData_ReturnValue_1;    // 0x2E50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E51[0x7];                                     // 0x2E51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle_5;        // 0x2E58(0x0028)()
	EAbilityExecOutputWithValidation              CallFunc_BPF_SwapPlayingSlotMontage__eOut;         // 0x2E80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E81[0x7];                                     // 0x2E81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_SCPlaySlotMontageAndWait*  CallFunc_BPF_SwapPlayingSlotMontage_ReturnValue;   // 0x2E88(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue_3; // 0x2E90(0x0028)()
	uint8                                         Pad_2EB8[0x8];                                     // 0x2EB8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSequencePlayInfos                 CallFunc_BPF_PickSlotAnimSequence__outSequenceInfos; // 0x2EC0(0x0130)()
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x2FF0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x2FF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FF9[0x7];                                     // 0x2FF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlaySyncAestheticMontage*  CallFunc_BPF_PlayAbilitySyncAestheticMontage_ReturnValue; // 0x3000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x3008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x3009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x300A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_300B[0x1];                                     // 0x300B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_36;           // 0x300C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x301C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301D[0x3];                                     // 0x301D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BPF_SetNamedFloatTargetData__fValue_ImplicitCast; // 0x3020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3024[0x4];                                     // 0x3024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x3028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x3030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x3038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_1;        // 0x3040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_WaitDelay_Time_ImplicitCast;              // 0x3048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BPF_PlayAbilitySyncAestheticMontage__fBlendInDuration_ImplicitCast; // 0x304C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BPF_PlayAbilitySyncAestheticMontage__fEndMontageAtWorldTime_ImplicitCast; // 0x3050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BPF_PlayAbilitySyncAestheticMontage__fPlayMontageAtWorldTime_ImplicitCast; // 0x3054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BallSteal_Base_C_ExecuteUbergraph_GA_BallSteal_Base;

// Function GA_BallSteal_Base.GA_BallSteal_Base_C.Get Data Source
// 0x0008 (0x0008 - 0x0000)
struct GA_BallSteal_Base_C_Get_Data_Source final
{
public:
	TSubclassOf<class UTargetDatasource>          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BallSteal_Base_C_Get_Data_Source;

// Function GA_BallSteal_Base.GA_BallSteal_Base_C.HasBallControlNeededTag
// 0x0048 (0x0048 - 0x0000)
struct GA_BallSteal_Base_C_HasBallControlNeededTag final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x0008(0x0020)()
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BallSteal_Base_C_HasBallControlNeededTag;

// Function GA_BallSteal_Base.GA_BallSteal_Base_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_BallSteal_Base_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BallSteal_Base_C_K2_OnEndAbility;

// Function GA_BallSteal_Base.GA_BallSteal_Base_C.m_BuildClientHitboxPayload_EFE3695F4AA92945DC930692E614233A
// 0x0380 (0x0380 - 0x0000)
struct GA_BallSteal_Base_C_m_BuildClientHitboxPayload_EFE3695F4AA92945DC930692E614233A final
{
public:
	struct FPendingHit                            _hit;                                              // 0x0000(0x0350)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       _context;                                          // 0x0350(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UAbilityTask_HandleHitboxBase*          _payloadTarget;                                    // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BallSteal_Base_C_m_BuildClientHitboxPayload_EFE3695F4AA92945DC930692E614233A;

// Function GA_BallSteal_Base.GA_BallSteal_Base_C.m_OnHit_EFE3695F4AA92945DC930692E614233A
// 0x0380 (0x0380 - 0x0000)
struct GA_BallSteal_Base_C_m_OnHit_EFE3695F4AA92945DC930692E614233A final
{
public:
	struct FPendingHit                            _hit;                                              // 0x0000(0x0350)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       _context;                                          // 0x0350(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UAbilityTask_HandleHitboxBase*          _payloadTarget;                                    // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BallSteal_Base_C_m_OnHit_EFE3695F4AA92945DC930692E614233A;

// Function GA_BallSteal_Base.GA_BallSteal_Base_C.m_OnHitRecovery_EFE3695F4AA92945DC930692E614233A
// 0x0380 (0x0380 - 0x0000)
struct GA_BallSteal_Base_C_m_OnHitRecovery_EFE3695F4AA92945DC930692E614233A final
{
public:
	struct FPendingHit                            _hit;                                              // 0x0000(0x0350)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       _context;                                          // 0x0350(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UAbilityTask_HandleHitboxBase*          _payloadTarget;                                    // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BallSteal_Base_C_m_OnHitRecovery_EFE3695F4AA92945DC930692E614233A;

// Function GA_BallSteal_Base.GA_BallSteal_Base_C.m_OnHitRejected_EFE3695F4AA92945DC930692E614233A
// 0x0380 (0x0380 - 0x0000)
struct GA_BallSteal_Base_C_m_OnHitRejected_EFE3695F4AA92945DC930692E614233A final
{
public:
	struct FPendingHit                            _hit;                                              // 0x0000(0x0350)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       _context;                                          // 0x0350(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UAbilityTask_HandleHitboxBase*          _payloadTarget;                                    // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BallSteal_Base_C_m_OnHitRejected_EFE3695F4AA92945DC930692E614233A;

// Function GA_BallSteal_Base.GA_BallSteal_Base_C.m_OnHitValidated_EFE3695F4AA92945DC930692E614233A
// 0x0380 (0x0380 - 0x0000)
struct GA_BallSteal_Base_C_m_OnHitValidated_EFE3695F4AA92945DC930692E614233A final
{
public:
	struct FPendingHit                            _hit;                                              // 0x0000(0x0350)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       _context;                                          // 0x0350(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UAbilityTask_HandleHitboxBase*          _payloadTarget;                                    // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BallSteal_Base_C_m_OnHitValidated_EFE3695F4AA92945DC930692E614233A;

// Function GA_BallSteal_Base.GA_BallSteal_Base_C.m_OnMiss_EFE3695F4AA92945DC930692E614233A
// 0x0380 (0x0380 - 0x0000)
struct GA_BallSteal_Base_C_m_OnMiss_EFE3695F4AA92945DC930692E614233A final
{
public:
	struct FPendingHit                            _hit;                                              // 0x0000(0x0350)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       _context;                                          // 0x0350(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UAbilityTask_HandleHitboxBase*          _payloadTarget;                                    // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BallSteal_Base_C_m_OnMiss_EFE3695F4AA92945DC930692E614233A;

// Function GA_BallSteal_Base.GA_BallSteal_Base_C.MakeBallStealTargetData
// 0x0128 (0x0128 - 0x0000)
struct GA_BallSteal_Base_C_MakeBallStealTargetData final
{
public:
	bool                                          InPayload;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       _inContext;                                        // 0x0008(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayAbilityTargetDataHandle       ReturnValue;                                       // 0x0030(0x0028)(Parm, OutParm, ReturnParm)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_GetBuildPayloadTargetData__outData;   // 0x0060(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_GetProvidedTargetData__outData;           // 0x0088(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue; // 0x00B0(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue_1; // 0x00D8(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_AppendHitPrediction_ReturnValue;          // 0x0100(0x0028)()
};
DUMPER7_ASSERTS_GA_BallSteal_Base_C_MakeBallStealTargetData;

// Function GA_BallSteal_Base.GA_BallSteal_Base_C.On Handle Attack Client Hitbox Payload
// 0x0380 (0x0380 - 0x0000)
struct GA_BallSteal_Base_C_On_Handle_Attack_Client_Hitbox_Payload final
{
public:
	struct FPendingHit                            Hit_Description_0;                                 // 0x0000(0x0350)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       Player_Context;                                    // 0x0350(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_GA_BallSteal_Base_C_On_Handle_Attack_Client_Hitbox_Payload;

// Function GA_BallSteal_Base.GA_BallSteal_Base_C.On Handle Attack Hit
// 0x0380 (0x0380 - 0x0000)
struct GA_BallSteal_Base_C_On_Handle_Attack_Hit final
{
public:
	struct FPendingHit                            Hit_Description_0;                                 // 0x0000(0x0350)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       Player_Context;                                    // 0x0350(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_GA_BallSteal_Base_C_On_Handle_Attack_Hit;

// Function GA_BallSteal_Base.GA_BallSteal_Base_C.OnHitAndBuildPayload
// 0x0390 (0x0390 - 0x0000)
struct GA_BallSteal_Base_C_OnHitAndBuildPayload final
{
public:
	EAbilityExecOrigin                            AbilityExec;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPendingHit                            Hit_Description_0;                                 // 0x0010(0x0350)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       Player_Context;                                    // 0x0360(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_GA_BallSteal_Base_C_OnHitAndBuildPayload;

// Function GA_BallSteal_Base.GA_BallSteal_Base_C.OnHitPredicted_3C960D6243F3F6C8F7B04E933D3EFF7E
// 0x0028 (0x0028 - 0x0000)
struct GA_BallSteal_Base_C_OnHitPredicted_3C960D6243F3F6C8F7B04E933D3EFF7E final
{
public:
	struct FGameplayAbilityTargetDataHandle       Data;                                              // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_GA_BallSteal_Base_C_OnHitPredicted_3C960D6243F3F6C8F7B04E933D3EFF7E;

// Function GA_BallSteal_Base.GA_BallSteal_Base_C.UpdatePickerAndConfiguration
// 0x0028 (0x0028 - 0x0000)
struct GA_BallSteal_Base_C_UpdatePickerAndConfiguration final
{
public:
	bool                                          bIsInBuildPayload;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UAnimSequencePickerSlotContainer> CallFunc_Evaluate_Picker_And_Configuration_OutDefaultPicker; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBasicMontagePlayerConfiguration*       CallFunc_Evaluate_Picker_And_Configuration_OutDefaultConfiguration; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UAnimSequencePickerSlotContainer> CallFunc_Evaluate_Picker_And_Configuration_OutPostHitPicker; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBasicMontagePlayerConfiguration*       CallFunc_Evaluate_Picker_And_Configuration_OutPostHitConfiguration; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BallSteal_Base_C_UpdatePickerAndConfiguration;

// Function GA_BallSteal_Base.GA_BallSteal_Base_C.ComputeFreezeFrame
// 0x07F0 (0x07F0 - 0x0000)
struct GA_BallSteal_Base_C_ComputeFreezeFrame final
{
public:
	struct FPendingHit                            InPendingHit;                                      // 0x0000(0x0350)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	double                                        ReturnValue;                                       // 0x0350(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       LocalTargetDataHandle;                             // 0x0358(0x0028)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHurtTargetDataHandle                  CallFunc_BPF_MakeHurtTargetDataHandle_ReturnValue; // 0x0390(0x03A0)(ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle;          // 0x0730(0x0028)()
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0758(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue; // 0x0760(0x0028)()
	struct FFreezeFrameOverrideStruct             CallFunc_Array_Get_Item;                           // 0x0788(0x0060)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x07E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x07EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesContainerMatchTagQuery_ReturnValue;   // 0x07ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPF_Evaluate_ReturnValue;                 // 0x07EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BallSteal_Base_C_ComputeFreezeFrame;

// Function GA_BallSteal_Base.GA_BallSteal_Base_C.Evaluate Picker And Configuration
// 0x0028 (0x0028 - 0x0000)
struct GA_BallSteal_Base_C_Evaluate_Picker_And_Configuration final
{
public:
	bool                                          bIsInBuildPayload;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UAnimSequencePickerSlotContainer> OutDefaultPicker;                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBasicMontagePlayerConfiguration*       OutDefaultConfiguration;                           // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UAnimSequencePickerSlotContainer> OutPostHitPicker;                            // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBasicMontagePlayerConfiguration*       OutPostHitConfiguration;                           // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BallSteal_Base_C_Evaluate_Picker_And_Configuration;

}

