#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_BallSteal_Block

#include "Basic.hpp"

#include "SCCore_structs.hpp"
#include "Runtime_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_BallSteal_Block.GA_BallSteal_Block_C.BPE_ClientPreparePayload
// 0x04E0 (0x04E0 - 0x0000)
struct GA_BallSteal_Block_C_BPE_ClientPreparePayload final
{
public:
	struct FGameplayAbilityTargetDataHandle       _handle;                                           // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	const class USCAbilitySystemComponent*        _component;                                        // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       _result;                                           // 0x0030(0x0028)(Parm, OutParm)
	class UBallPlayersInteractionComponent*       BallPLayerInteraction;                             // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FBallInterceptionPointTargetData       BallInterception;                                  // 0x0060(0x0120)(Edit, BlueprintVisible)
	struct FGameplayAbilityTargetDataHandle       Result;                                            // 0x0180(0x0028)(Edit, BlueprintVisible)
	bool                                          LocalIsDash;                                       // 0x01A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNearestBallOwned;                                // 0x01A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AB[0x5];                                      // 0x01AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x01B0(0x0028)(ConstParm)
	class UPlayerBallOwnership*                   CallFunc_BPF_GetPlayerBallOwnership_ReturnValue;   // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ARuntimePlayerState*                    CallFunc_BPF_GetPlayerState_ReturnValue;           // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPawn_ReturnValue;                      // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle;          // 0x0218(0x0028)()
	struct FNamedBoolTargetData                   K2Node_MakeStruct_NamedBoolTargetData;             // 0x0240(0x0020)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_InitTargetDataFromManifest__out;      // 0x0260(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle_1;        // 0x0288(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_InitTargetDataFromManifest__out_1;    // 0x02B0(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue; // 0x02D8(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeManifestTargetData__out;              // 0x0300(0x0028)()
	TSubclassOf<class UTargetDatasource>          K2Node_Select_Default;                             // 0x0328(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_BPF_HasOwner_ReturnValue;                 // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_GetProvidedTargetData__outData;           // 0x0338(0x0028)()
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARuntimeCharacter*                      CallFunc_BPF_GetRuntimeCharacter_ReturnValue;      // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayAbilityTargetDataHandle> CallFunc_BPF_PickTargets__outTargetData;         // 0x0370(0x0010)(ReferenceParm)
	class ABall*                                  CallFunc_BPF_GetNearestBall_ReturnValue;           // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_Array_Get_Item;                           // 0x0388(0x0028)()
	struct FBallInterceptionPointTargetData       CallFunc_BPF_FindSingleTarget__outData;            // 0x03B0(0x0120)()
	bool                                          CallFunc_BPF_FindSingleTarget_ReturnValue;         // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x04D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BallSteal_Block_C_BPE_ClientPreparePayload;

// Function GA_BallSteal_Block.GA_BallSteal_Block_C.Evaluate Picker And Configuration
// 0x0240 (0x0240 - 0x0000)
struct GA_BallSteal_Block_C_Evaluate_Picker_And_Configuration final
{
public:
	bool                                          bIsInBuildPayload;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UAnimSequencePickerSlotContainer> OutDefaultPicker;                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBasicMontagePlayerConfiguration*       OutDefaultConfiguration;                           // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UAnimSequencePickerSlotContainer> OutPostHitPicker;                            // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBasicMontagePlayerConfiguration*       OutPostHitConfiguration;                           // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       TargetDataUsed;                                    // 0x0028(0x0028)(Edit, BlueprintVisible)
	bool                                          IsDash;                                            // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNearestBallOwned;                                // 0x0051(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UAnimSequencePickerSlotContainer> Picker;                                      // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FBallInterceptionPointTargetData       CallFunc_GetTargetDataPure__outData;               // 0x0060(0x0120)()
	bool                                          CallFunc_GetTargetDataPure_ReturnValue;            // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNamedBoolTargetData                   CallFunc_GetTargetDataNamed__outData;              // 0x0188(0x0020)()
	bool                                          CallFunc_GetTargetDataNamed_ReturnValue;           // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_GetBuildPayloadTargetData__outData;   // 0x01B0(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_GetProvidedTargetData__outData;           // 0x01D8(0x0028)()
	class UBasicMontagePlayerConfiguration*       Temp_object_Variable;                              // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20A[0x6];                                      // 0x020A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_Select_Default;                             // 0x0210(0x0028)()
	class UBasicMontagePlayerConfiguration*       K2Node_Select_Default_1;                           // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BallSteal_Block_C_Evaluate_Picker_And_Configuration;

}

