#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_BallSteal_Base

#include "Basic.hpp"

#include "FreezeFrameOverrideStruct_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Runtime_classes.hpp"
#include "Engine_structs.hpp"
#include "SCCombatSystem_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SCCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_BallSteal_Base.GA_BallSteal_Base_C
// 0x06B8 (0x0D10 - 0x0658)
class UGA_BallSteal_Base_C : public URuntimeGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0658(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBasicMontagePlayerConfiguration*       Default_Ball_Steal_Configuration;                  // 0x0660(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBasicMontagePlayerConfiguration*       PostBallStealConfiguration;                        // 0x0668(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Tracking;                                          // 0x0670(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EBallStealTracking_DirectionSource            DirSelection;                                      // 0x0678(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldBallControl;                                 // 0x0679(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanBallControl;                                    // 0x067A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67B[0x5];                                      // 0x067B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UAnimSequencePickerSlotContainer> Default_Picker;                              // 0x0680(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	double                                        Computed_Freeze_Frame_Duration;                    // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSequencePlayInfos                 Sequence_Infos;                                    // 0x0690(0x0130)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	struct FGameplayTag                           BallStealTag;                                      // 0x07C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_SCPlayMontageAndWait*      BallStealAnimTask;                                 // 0x07C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 OnHitEffect;                                       // 0x07D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   AnimSlot;                                          // 0x07D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UsePrediction;                                     // 0x07E0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E1[0x3];                                      // 0x07E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PreductionDuration;                                // 0x07E4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugPrediction;                                   // 0x07E8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E9[0x3];                                      // 0x07E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           FreezeTag;                                         // 0x07EC(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F4[0x4];                                      // 0x07F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DefaultFreezeDuration;                             // 0x07F8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFreezeFrameOverrideStruct>     FreezeOverrides;                                   // 0x0800(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference)
	class UAbilityTask_NetworkHitProjection*      AttackPredictionTask;                              // 0x0810(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_HandleAttack*              AttackTask;                                        // 0x0818(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask*                           PostHitTask;                                       // 0x0820(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBasicMontagePlayerConfiguration*       Actual_Ball_Steal_Configuration;                   // 0x0828(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UAnimSequencePickerSlotContainer> Actual_Picker;                               // 0x0830(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          bEndAbilityOnHit;                                  // 0x0838(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_839[0x3];                                      // 0x0839(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DelayToEndAbilityPostHit;                          // 0x083C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPendingHit                            Hit_Description;                                   // 0x0840(0x0350)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       Hit_Player_Context;                                // 0x0B90(0x0028)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	TSubclassOf<class UTargetDatasource>          Default_Data_Source;                               // 0x0BB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAbilityTask*                           EndAbilityDelayTask;                               // 0x0BC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBasicMontagePlayerConfiguration*       Actual_Post_Hit_Ball_Steal_Configuration;          // 0x0BC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UAnimSequencePickerSlotContainer> Actual_PostHit_Picker;                       // 0x0BD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         Pad_BD8[0x8];                                      // 0x0BD8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTargetingContext                      TargetingContext;                                  // 0x0BE0(0x00E0)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	struct FGameplayAbilityTargetDataHandle       BallStealTargetData;                               // 0x0CC0(0x0028)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	double                                        BlendInDuration;                                   // 0x0CE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StartTimeOffset;                                   // 0x0CF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EndTimeOffset;                                     // 0x0CF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlaySyncAestheticMontage*  Pre_Anime_Task;                                    // 0x0D00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bRequestPreanimation;                              // 0x0D08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPE_BuildPayload();
	void EndTasksBeforeSwap();
	void ExecuteUbergraph_GA_BallSteal_Base(int32 EntryPoint);
	TSubclassOf<class UTargetDatasource> Get_Data_Source();
	bool HasBallControlNeededTag();
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void m_BuildClientHitboxPayload_EFE3695F4AA92945DC930692E614233A(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget);
	void m_OnCanMoveInterrupt_38EB9BD343AF33FEAEA2258B3C67D77D();
	void m_OnCanMoveInterrupt_66E0D73F4109CD08EC76CAB6EA73509F();
	void m_OnCanMoveInterrupt_FE9713DD489DBB5A45F773B89E1122B5();
	void m_OnHit_EFE3695F4AA92945DC930692E614233A(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget);
	void m_OnHitRecovery_EFE3695F4AA92945DC930692E614233A(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget);
	void m_OnHitRejected_EFE3695F4AA92945DC930692E614233A(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget);
	void m_OnHitValidated_EFE3695F4AA92945DC930692E614233A(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget);
	void m_OnMiss_EFE3695F4AA92945DC930692E614233A(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget);
	void m_OnMoveInterrupt_38EB9BD343AF33FEAEA2258B3C67D77D();
	void m_OnMoveInterrupt_66E0D73F4109CD08EC76CAB6EA73509F();
	void m_OnMoveInterrupt_FE9713DD489DBB5A45F773B89E1122B5();
	void m_OnValidNullMontageChosen_38EB9BD343AF33FEAEA2258B3C67D77D();
	void m_OnValidNullMontageChosen_66E0D73F4109CD08EC76CAB6EA73509F();
	void m_OnValidNullMontageChosen_FE9713DD489DBB5A45F773B89E1122B5();
	struct FGameplayAbilityTargetDataHandle MakeBallStealTargetData(bool InPayload, const struct FGameplayAbilityTargetDataHandle& _inContext);
	void On_Handle_Attack_Client_Hitbox_Payload(const struct FPendingHit& Hit_Description_0, const struct FGameplayAbilityTargetDataHandle& Player_Context);
	void On_Handle_Attack_Hit(const struct FPendingHit& Hit_Description_0, const struct FGameplayAbilityTargetDataHandle& Player_Context);
	void OnBlendedIn_38EB9BD343AF33FEAEA2258B3C67D77D();
	void OnBlendedIn_66E0D73F4109CD08EC76CAB6EA73509F();
	void OnBlendedIn_FE9713DD489DBB5A45F773B89E1122B5();
	void OnBlendOut_38EB9BD343AF33FEAEA2258B3C67D77D();
	void OnBlendOut_66E0D73F4109CD08EC76CAB6EA73509F();
	void OnBlendOut_FE9713DD489DBB5A45F773B89E1122B5();
	void OnCancelled_38EB9BD343AF33FEAEA2258B3C67D77D();
	void OnCancelled_66E0D73F4109CD08EC76CAB6EA73509F();
	void OnCancelled_FE9713DD489DBB5A45F773B89E1122B5();
	void OnCompleted_38EB9BD343AF33FEAEA2258B3C67D77D();
	void OnCompleted_66E0D73F4109CD08EC76CAB6EA73509F();
	void OnCompleted_FE9713DD489DBB5A45F773B89E1122B5();
	void OnFinish_2B7F5F224FA7A967B37D5AB09C48CC85();
	void OnHitAndBuildPayload(EAbilityExecOrigin AbilityExec, const struct FPendingHit& Hit_Description_0, const struct FGameplayAbilityTargetDataHandle& Player_Context);
	void OnHitPredicted_3C960D6243F3F6C8F7B04E933D3EFF7E(const struct FGameplayAbilityTargetDataHandle& Data);
	void OnHitProjectionFailed_3C960D6243F3F6C8F7B04E933D3EFF7E();
	void OnHitRejected();
	void OnInterrupted_38EB9BD343AF33FEAEA2258B3C67D77D();
	void OnInterrupted_66E0D73F4109CD08EC76CAB6EA73509F();
	void OnInterrupted_FE9713DD489DBB5A45F773B89E1122B5();
	void OnStateEnded_8FEDA3454D8CA58A0F34EDB17243716D();
	void OnStateInterrupted_8FEDA3454D8CA58A0F34EDB17243716D();
	void OnSync_493B85524E6ECFF59ED3C1817CBB2484();
	void OnSync_A2491CEA4F15DEF5C41FB4A60BC37716();
	void StartStateTasks_8FEDA3454D8CA58A0F34EDB17243716D();
	void UpdatePickerAndConfiguration(bool bIsInBuildPayload);

	double ComputeFreezeFrame(const struct FPendingHit& InPendingHit) const;
	void Evaluate_Picker_And_Configuration(bool bIsInBuildPayload, TSubclassOf<class UAnimSequencePickerSlotContainer>* OutDefaultPicker, class UBasicMontagePlayerConfiguration** OutDefaultConfiguration, TSubclassOf<class UAnimSequencePickerSlotContainer>* OutPostHitPicker, class UBasicMontagePlayerConfiguration** OutPostHitConfiguration) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_BallSteal_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_BallSteal_Base_C")
	}
	static class UGA_BallSteal_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_BallSteal_Base_C>();
	}
};
DUMPER7_ASSERTS_UGA_BallSteal_Base_C;

}

