#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_BallSteal_Tackle_GoalKeeper

#include "Basic.hpp"

#include "SCCombatSystem_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_BallSteal_Tackle_GoalKeeper.GA_BallSteal_Tackle_GoalKeeper_C.ExecuteUbergraph_GA_BallSteal_Tackle_GoalKeeper
// 0x0710 (0x0710 - 0x0000)
struct GA_BallSteal_Tackle_GoalKeeper_C_ExecuteUbergraph_GA_BallSteal_Tackle_GoalKeeper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPendingHit                            K2Node_Event_Hit_Description_1;                    // 0x0010(0x0350)(ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       K2Node_Event_Player_Context_1;                     // 0x0360(0x0028)()
	uint8                                         Pad_388[0x8];                                      // 0x0388(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPendingHit                            K2Node_Event_Hit_Description;                      // 0x0390(0x0350)(ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       K2Node_Event_Player_Context;                       // 0x06E0(0x0028)()
	bool                                          CallFunc_ShouldHandleHit_Result;                   // 0x0708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldHandleHit_Result_1;                 // 0x0709(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BallSteal_Tackle_GoalKeeper_C_ExecuteUbergraph_GA_BallSteal_Tackle_GoalKeeper;

// Function GA_BallSteal_Tackle_GoalKeeper.GA_BallSteal_Tackle_GoalKeeper_C.HasBallControlNeededTag
// 0x0001 (0x0001 - 0x0000)
struct GA_BallSteal_Tackle_GoalKeeper_C_HasBallControlNeededTag final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BallSteal_Tackle_GoalKeeper_C_HasBallControlNeededTag;

// Function GA_BallSteal_Tackle_GoalKeeper.GA_BallSteal_Tackle_GoalKeeper_C.On Handle Attack Client Hitbox Payload
// 0x0380 (0x0380 - 0x0000)
struct GA_BallSteal_Tackle_GoalKeeper_C_On_Handle_Attack_Client_Hitbox_Payload final
{
public:
	struct FPendingHit                            Hit_Description_0;                                 // 0x0000(0x0350)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       Player_Context;                                    // 0x0350(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_GA_BallSteal_Tackle_GoalKeeper_C_On_Handle_Attack_Client_Hitbox_Payload;

// Function GA_BallSteal_Tackle_GoalKeeper.GA_BallSteal_Tackle_GoalKeeper_C.On Handle Attack Hit
// 0x0380 (0x0380 - 0x0000)
struct GA_BallSteal_Tackle_GoalKeeper_C_On_Handle_Attack_Hit final
{
public:
	struct FPendingHit                            Hit_Description_0;                                 // 0x0000(0x0350)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       Player_Context;                                    // 0x0350(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_GA_BallSteal_Tackle_GoalKeeper_C_On_Handle_Attack_Hit;

// Function GA_BallSteal_Tackle_GoalKeeper.GA_BallSteal_Tackle_GoalKeeper_C.ShouldHandleHit
// 0x0380 (0x0380 - 0x0000)
struct GA_BallSteal_Tackle_GoalKeeper_C_ShouldHandleHit final
{
public:
	struct FPendingHit                            PendingHit;                                        // 0x0000(0x0350)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       Context;                                           // 0x0350(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Result;                                            // 0x0378(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x037A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BallSteal_Tackle_GoalKeeper_C_ShouldHandleHit;

// Function GA_BallSteal_Tackle_GoalKeeper.GA_BallSteal_Tackle_GoalKeeper_C.Evaluate Picker And Configuration
// 0x0048 (0x0048 - 0x0000)
struct GA_BallSteal_Tackle_GoalKeeper_C_Evaluate_Picker_And_Configuration final
{
public:
	bool                                          bIsInBuildPayload;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UAnimSequencePickerSlotContainer> OutDefaultPicker;                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBasicMontagePlayerConfiguration*       OutDefaultConfiguration;                           // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UAnimSequencePickerSlotContainer> OutPostHitPicker;                            // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBasicMontagePlayerConfiguration*       OutPostHitConfiguration;                           // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UAnimSequencePickerSlotContainer> CallFunc_Evaluate_Picker_And_Configuration_OutDefaultPicker; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBasicMontagePlayerConfiguration*       CallFunc_Evaluate_Picker_And_Configuration_OutDefaultConfiguration; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UAnimSequencePickerSlotContainer> CallFunc_Evaluate_Picker_And_Configuration_OutPostHitPicker; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBasicMontagePlayerConfiguration*       CallFunc_Evaluate_Picker_And_Configuration_OutPostHitConfiguration; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BallSteal_Tackle_GoalKeeper_C_Evaluate_Picker_And_Configuration;

}

