#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Dribble

#include "Basic.hpp"

#include "Runtime_classes.hpp"
#include "Engine_structs.hpp"
#include "SCCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Dribble.GA_Dribble_C
// 0x0038 (0x0690 - 0x0658)
class UGA_Dribble_C : public URuntimeGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0658(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSubclassOf<class UAnimSequencePicker>        DribblePicker;                                     // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 Availability_Layer;                                // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        DurationBeforeApplyTag;                            // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TagTimerHandle;                                    // 0x0678(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        TagDuration;                                       // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AvailabilityLayerID;                               // 0x0688(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AfterMontage();
	void ApplyTags();
	void BPE_BuildPayload();
	void ExecuteUbergraph_GA_Dribble(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void m_OnCanMoveInterrupt_200D831E4EDE0DA3F7C9A3BA319A3DD1();
	void m_OnMoveInterrupt_200D831E4EDE0DA3F7C9A3BA319A3DD1();
	void m_OnValidNullMontageChosen_200D831E4EDE0DA3F7C9A3BA319A3DD1();
	void OnBlendedIn_200D831E4EDE0DA3F7C9A3BA319A3DD1();
	void OnBlendOut_200D831E4EDE0DA3F7C9A3BA319A3DD1();
	void OnCancelled_200D831E4EDE0DA3F7C9A3BA319A3DD1();
	void OnCompleted_200D831E4EDE0DA3F7C9A3BA319A3DD1();
	void OnInterrupted_200D831E4EDE0DA3F7C9A3BA319A3DD1();
	void OnSync_035EF7BD4B40A49B285A978A6FD24E72();
	void RemoveTags();
	void SetupVarFromDataTable();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Dribble_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Dribble_C")
	}
	static class UGA_Dribble_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Dribble_C>();
	}
};
DUMPER7_ASSERTS_UGA_Dribble_C;

}

