#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_ExtraEffort

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_Sprint_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_ExtraEffort.GA_ExtraEffort_C
// 0x0028 (0x08D0 - 0x08A8)
class UGA_ExtraEffort_C final : public UGA_Sprint_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_ExtraEffort_C;                   // 0x08A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Duration;                                          // 0x08B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B4[0x4];                                      // 0x08B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           TimerHandle;                                       // 0x08B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         FreeBallDuration;                                  // 0x08C0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C4[0x4];                                      // 0x08C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           FreeBallTimerHandle;                               // 0x08C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Added_1398CECD47E4974789968D97016723CC();
	void EndFreeBall();
	void EndTimer();
	void ExecuteUbergraph_GA_ExtraEffort(int32 EntryPoint);
	void K2_CommitExecute();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnSync_70D4216340598282B49BA1A8774DF490();

	void GetInputInfosForWatchInputTask(class USCInputAction** InputAction, struct FInputGameplayAbilityTargetData* InputTargetData) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_ExtraEffort_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_ExtraEffort_C")
	}
	static class UGA_ExtraEffort_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_ExtraEffort_C>();
	}
};
DUMPER7_ASSERTS_UGA_ExtraEffort_C;

}

