#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Fidgets

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SCCore_structs.hpp"
#include "SCCore_classes.hpp"
#include "FidgetOverrideStruct_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Fidgets.GA_Fidgets_C
// 0x01E8 (0x0830 - 0x0648)
class UGA_Fidgets_C final : public USCGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0648(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBaseActorConditionInstance            CanPlayFidgetCondition;                            // 0x0650(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, ContainsInstancedReference)
	struct FFloatInterval                         FidgetPlayRateRange;                               // 0x0660(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatInterval                         DefaultFidgetTimeRange;                            // 0x0668(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimMontage*>                   DefaultMontages;                                   // 0x0670(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	TArray<struct FFidgetOverrideStruct>          MontageOverride;                                   // 0x0680(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference)
	struct FAnimSequencePlayInfos                 AnimSequenceInfosToPlay;                           // 0x0690(0x0130)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	class UAbilityTask_WaitDelay*                 DelayUntilNextFidgetTask;                          // 0x07C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitDelay*                 DelayUntilAnimEndTask;                             // 0x07C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_HandleGameplayCue*         FidgetCueTask;                                     // 0x07D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CueTargetDataHandle;                               // 0x07D8(0x0028)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	class UAbilityTask_TickAction*                CheckCanPlayFidgetConditionTask;                   // 0x0800(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FFidgetOverrideStruct                  FoundFidgetOverrideStruct;                         // 0x0808(0x0028)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)

public:
	void Cancel_All_Tasks();
	void ExecuteUbergraph_GA_Fidgets(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnAnimatingAbilityCleared();
	void OnAnyAbilityMontageStarted(class UAnimMontage* Montage);
	void OnFinish_232B9BAE4B3614DCCA8EF48E8C5D03B2();
	void OnFinish_BA5031D54A07C7CEE94D44B9476A8B83();
	void OnFinish_E50BB7A5429CC60EB2B44C89185DC4AE();
	void OnTick_46CF56E641AA54E1D1BAB69ED6CD690D(float fDeltaTime);
	void RestartFidgetTimer();
	void StartCanPlayFidgetCheckTask();
	void StartFidgetTimer();

	void Get_Fidget_Infos(struct FFidgetOverrideStruct* OutResultValue) const;
	void PickRandomMontage(class UAnimMontage** Output) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Fidgets_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Fidgets_C")
	}
	static class UGA_Fidgets_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Fidgets_C>();
	}
};
DUMPER7_ASSERTS_UGA_Fidgets_C;

}

