#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_LockMove

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Runtime_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FreezeFrameOverrideStruct_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SCCombatSystem_structs.hpp"
#include "SCCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "LockMoveTableRow_structs.hpp"


namespace SDK::Params
{

// Function GA_LockMove.GA_LockMove_C.BallInterceptionHandlingForBehavior
// 0x01C0 (0x01C0 - 0x0000)
struct GA_LockMove_C_BallInterceptionHandlingForBehavior final
{
public:
	struct FGameplayAbilityTargetDataHandle       Context;                                           // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBallInterceptionPointTargetData       CallFunc_GetTargetDataPure__outData;               // 0x0040(0x0120)()
	bool                                          CallFunc_GetTargetDataPure_ReturnValue;            // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromArray_ReturnValue; // 0x0168(0x0020)()
	class ARuntimeCharacter*                      CallFunc_BPF_GetRuntimeCharacter_ReturnValue;      // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BPF_GetStatus_ReturnValue;                // 0x0190(0x0020)()
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_LockMove_C_BallInterceptionHandlingForBehavior;

// Function GA_LockMove.GA_LockMove_C.BallInterceptionHandlingForOuterboxPreAnimation
// 0x01B0 (0x01B0 - 0x0000)
struct GA_LockMove_C_BallInterceptionHandlingForOuterboxPreAnimation final
{
public:
	struct FGameplayAbilityTargetDataHandle       Context;                                           // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Can_Handle;                                        // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0030(0x0020)()
	struct FBallInterceptionPointTargetData       CallFunc_GetTargetDataPure__outData;               // 0x0050(0x0120)()
	bool                                          CallFunc_GetTargetDataPure_ReturnValue;            // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARuntimeCharacter*                      CallFunc_BPF_GetRuntimeCharacter_ReturnValue;      // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BPF_GetStatus_ReturnValue;                // 0x0180(0x0020)()
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_LockMove_C_BallInterceptionHandlingForOuterboxPreAnimation;

// Function GA_LockMove.GA_LockMove_C.ComputeBallControlPreAnimation
// 0x0680 (0x0680 - 0x0000)
struct GA_LockMove_C_ComputeBallControlPreAnimation final
{
public:
	struct FGameplayAbilityTargetDataHandle       InContext;                                         // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UAnimMontage*                           OutMontage;                                        // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bOutMirror;                                        // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        OutWorldSyncTime;                                  // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OutAnimSyncTime;                                   // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OutAnimBlendOutTime;                               // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBaseHitDescTargetDataHandle           CallFunc_GetTargetData__outData;                   // 0x0050(0x03A0)(ContainsInstancedReference)
	bool                                          CallFunc_GetTargetData_ReturnValue;                // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetAnimationPicker_Picker;                // 0x0400(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSequencePickerInstance            CallFunc_BPF_MakeAnimSequencePickerInstance__instance; // 0x0410(0x0038)(ContainsInstancedReference)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0448(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimSequencePlayInfos                 CallFunc_BPF_PickAnimSequence__outSequenceInfos;   // 0x0450(0x0130)()
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x0580(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_589[0x7];                                      // 0x0589(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNotifyEvent                       CallFunc_FindNotifyByClass__outFoundNotify;        // 0x0590(0x00B8)(ContainsInstancedReference)
	bool                                          CallFunc_FindNotifyByClass__bOutFound;             // 0x0648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_649[0x3];                                      // 0x0649(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetNotifyTriggerTime_ReturnValue;         // 0x064C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_OutAnimSyncTime_ImplicitCast; // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0668(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_1;        // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_LockMove_C_ComputeBallControlPreAnimation;

// Function GA_LockMove.GA_LockMove_C.ExecuteUbergraph_GA_LockMove
// 0x4940 (0x4940 - 0x0000)
struct GA_LockMove_C_ExecuteUbergraph_GA_LockMove final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetToggleDefenseModeValue_ReturnValue;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPendingHit                            K2Node_CustomEvent__hit_7;                         // 0x0010(0x0350)(ConstParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent__context_7;                     // 0x0360(0x0028)()
	class UAbilityTask_HandleHitboxBase*          K2Node_CustomEvent__payloadTarget_7;               // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget)> K2Node_CreateDelegate_OutputDelegate; // 0x0390(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPendingHit                            K2Node_CustomEvent__hit_6;                         // 0x03A0(0x0350)(ConstParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent__context_6;                     // 0x06F0(0x0028)()
	class UAbilityTask_HandleHitboxBase*          K2Node_CustomEvent__payloadTarget_6;               // 0x0718(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0720(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPendingHit                            K2Node_CustomEvent__hit_5;                         // 0x0730(0x0350)(ConstParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent__context_5;                     // 0x0A80(0x0028)()
	class UAbilityTask_HandleHitboxBase*          K2Node_CustomEvent__payloadTarget_5;               // 0x0AA8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0AB0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_HandleHitboxBase*          Temp_object_Variable;                              // 0x0AC0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x0AC8(0x0028)()
	struct FPendingHit                            Temp_struct_Variable_1;                            // 0x0AF0(0x0350)(ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0E40(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0E50(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0E60(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0E70(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_SCStartAbilityState*       CallFunc_BPF_StartAbilityState_ReturnValue;        // 0x0E80(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0E88(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0E98(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E99[0x3];                                      // 0x0E99(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0E9C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0EAC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EBC[0x4];                                      // 0x0EBC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_SCStartAbilityState*       CallFunc_BPF_StartAbilityState_ReturnValue_1;      // 0x0EC0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0EC8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0ED8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED9[0x7];                                      // 0x0ED9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLockMoveTableRow                      CallFunc_GetDataTableRowFromNamePure_OutRow;       // 0x0EE0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromNamePure_ReturnValue;  // 0x0EF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EF1[0x3];                                      // 0x0EF1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x0EF4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFloatRange                            CallFunc_BPF_MakeUpperBoundFloatRange_ReturnValue; // 0x0F04(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F14[0x4];                                      // 0x0F14(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0F18(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_HandleAvailabilityTags*    CallFunc_BPF_HandleAvailabilityTagsFromData_ReturnValue; // 0x0F20(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0F28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0F29(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2A[0x6];                                      // 0x0F2A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue;                  // 0x0F30(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FInputActionState& _state, bool _bActivated)> K2Node_CreateDelegate_OutputDelegate_12; // 0x0F38(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0F48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F49[0x7];                                      // 0x0F49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionState                      K2Node_CustomEvent__state_2;                       // 0x0F50(0x0098)(ConstParm)
	bool                                          K2Node_CustomEvent__bActivated_2;                  // 0x0FE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0FE9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FEA[0x6];                                      // 0x0FEA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionState                      Temp_struct_Variable_2;                            // 0x0FF0(0x0098)()
	class UAbilityTask_WatchInput*                CallFunc_BPF_WatchInput_ReturnValue;               // 0x1088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x1090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x10A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPF_GetInputState__bOutActive;            // 0x10A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A2[0x6];                                     // 0x10A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionState                      CallFunc_BPF_GetInputState__outState;              // 0x10A8(0x0098)()
	bool                                          CallFunc_BPF_GetInputState__bOutActive_1;          // 0x1140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1141[0x7];                                     // 0x1141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionState                      CallFunc_BPF_GetInputState__outState_1;            // 0x1148(0x0098)()
	struct FInputActionState                      K2Node_CustomEvent__state_1;                       // 0x11E0(0x0098)(ConstParm)
	bool                                          K2Node_CustomEvent__bActivated_1;                  // 0x1278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1279[0x3];                                     // 0x1279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FInputActionState& _state, bool _bActivated)> K2Node_CreateDelegate_OutputDelegate_14; // 0x127C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x128C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_128D[0x3];                                     // 0x128D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionState                      Temp_struct_Variable_3;                            // 0x1290(0x0098)()
	class UAbilityTask_WatchInput*                CallFunc_BPF_WatchInput_ReturnValue_1;             // 0x1328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_15;           // 0x1330(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x1340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1341[0x7];                                     // 0x1341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_HandleGameplayCue*         CallFunc_BPF_HandleGameplayCue_ReturnValue;        // 0x1348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_HandleAvailabilityTags*    CallFunc_BPF_HandleAvailabilityTagsFromData_ReturnValue_1; // 0x1350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x1358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x1359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_135A[0x6];                                     // 0x135A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_HandleLooseGameplayTags*   CallFunc_BPF_HandleLooseGameplayTag_ReturnValue;   // 0x1360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAbilityExecOrigin                            Temp_byte_Variable;                                // 0x1368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x1369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_136A[0x2];                                     // 0x136A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_fDeltaTime;                     // 0x136C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float fDeltaTime)>             K2Node_CreateDelegate_OutputDelegate_16;           // 0x1370(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x1380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1384[0x4];                                     // 0x1384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_TickAction*                CallFunc_BPF_TickAction_ReturnValue;               // 0x1388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x1390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x1391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1392[0x2];                                     // 0x1392(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_17;           // 0x1394(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_18;           // 0x13A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_19;           // 0x13B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C4[0x4];                                     // 0x13C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Data;                           // 0x13C8(0x0028)(ConstParm)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> K2Node_CreateDelegate_OutputDelegate_20; // 0x13F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x1400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x1401(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x1402(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1403[0x1];                                     // 0x1403(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_21;           // 0x1404(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1414[0xC];                                     // 0x1414(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPendingHit                            K2Node_CustomEvent__hit_4;                         // 0x1420(0x0350)(ConstParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent__context_4;                     // 0x1770(0x0028)()
	class UAbilityTask_HandleHitboxBase*          K2Node_CustomEvent__payloadTarget_4;               // 0x1798(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget)> K2Node_CreateDelegate_OutputDelegate_22; // 0x17A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPendingHit                            K2Node_CustomEvent__hit_3;                         // 0x17B0(0x0350)(ConstParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent__context_3;                     // 0x1B00(0x0028)()
	class UAbilityTask_HandleHitboxBase*          K2Node_CustomEvent__payloadTarget_3;               // 0x1B28(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget)> K2Node_CreateDelegate_OutputDelegate_23; // 0x1B30(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPendingHit                            K2Node_CustomEvent__hit_2;                         // 0x1B40(0x0350)(ConstParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent__context_2;                     // 0x1E90(0x0028)()
	class UAbilityTask_HandleHitboxBase*          K2Node_CustomEvent__payloadTarget_2;               // 0x1EB8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget)> K2Node_CreateDelegate_OutputDelegate_24; // 0x1EC0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPendingHit                            K2Node_CustomEvent__hit_1;                         // 0x1ED0(0x0350)(ConstParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent__context_1;                     // 0x2220(0x0028)()
	class UAbilityTask_HandleHitboxBase*          K2Node_CustomEvent__payloadTarget_1;               // 0x2248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget)> K2Node_CreateDelegate_OutputDelegate_25; // 0x2250(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPendingHit                            K2Node_CustomEvent__hit;                           // 0x2260(0x0350)(ConstParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent__context;                       // 0x25B0(0x0028)()
	class UAbilityTask_HandleHitboxBase*          K2Node_CustomEvent__payloadTarget;                 // 0x25D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget)> K2Node_CreateDelegate_OutputDelegate_26; // 0x25E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_HandleHitboxBase*          Temp_object_Variable_1;                            // 0x25F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_4;                            // 0x25F8(0x0028)()
	struct FPendingHit                            Temp_struct_Variable_5;                            // 0x2620(0x0350)(ContainsInstancedReference)
	bool                                          Temp_bool_Variable_2;                              // 0x2970(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2971[0xF];                                     // 0x2971(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitTargetDataHandle                   CallFunc_GetTargetData__outData;                   // 0x2980(0x03A0)(ContainsInstancedReference)
	bool                                          CallFunc_GetTargetData_ReturnValue;                // 0x2D20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D21[0xF];                                     // 0x2D21(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitTargetDataHandle                   CallFunc_GetTargetData__outData_1;                 // 0x2D30(0x03A0)(ContainsInstancedReference)
	bool                                          CallFunc_GetTargetData_ReturnValue_1;              // 0x30D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D1[0x3];                                     // 0x30D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFloatRangeBound                       K2Node_MakeStruct_FloatRangeBound;                 // 0x30D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30DC[0x4];                                     // 0x30DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_HandleLooseGameplayTags*   CallFunc_BPF_HandleLooseGameplayTag_ReturnValue_1; // 0x30E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_27;           // 0x30E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x30F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30F9[0x3];                                     // 0x30F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_28;           // 0x30FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_310C[0x4];                                     // 0x310C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitForPrediction*         CallFunc_BPF_ClientWatchPrediction_ReturnValue;    // 0x3110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_29;           // 0x3118(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x3128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3129[0x7];                                     // 0x3129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitForPrediction*         CallFunc_BPF_ClientWaitForPrediction_ReturnValue;  // 0x3130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x3138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3139[0x3];                                     // 0x3139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_30;           // 0x313C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x314C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314D[0x3];                                     // 0x314D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_struct_Variable_6;                            // 0x3150(0x0020)()
	struct FGameplayTagContainer                  Temp_struct_Variable_7;                            // 0x3170(0x0020)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_31;           // 0x3190(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_32;           // 0x31A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitForPrediction*         CallFunc_BPF_ClientWatchPrediction_ReturnValue_1;  // 0x31B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_HandleLooseGameplayTags*   CallFunc_BPF_HandleLooseGameplayTag_ReturnValue_2; // 0x31B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_16;                   // 0x31C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_17;                   // 0x31C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C2[0x2];                                     // 0x31C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFloatRangeBound                       K2Node_MakeStruct_FloatRangeBound_1;               // 0x31C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_33;           // 0x31CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31DC[0x4];                                     // 0x31DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionState                      K2Node_CustomEvent__state;                         // 0x31E0(0x0098)(ConstParm)
	bool                                          K2Node_CustomEvent__bActivated;                    // 0x3278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3279[0x3];                                     // 0x3279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FInputActionState& _state, bool _bActivated)> K2Node_CreateDelegate_OutputDelegate_34; // 0x327C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x328C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_328D[0x3];                                     // 0x328D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionState                      Temp_struct_Variable_8;                            // 0x3290(0x0098)()
	class UAbilityTask_WatchInput*                CallFunc_BPF_WatchInput_ReturnValue_2;             // 0x3328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAbilityExecOrigin                            Temp_byte_Variable_1;                              // 0x3330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_18;                   // 0x3331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3332[0x2];                                     // 0x3332(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_35;           // 0x3334(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_36;           // 0x3344(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_37;           // 0x3354(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3364[0x4];                                     // 0x3364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue_1;                // 0x3368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_19;                   // 0x3370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_20;                   // 0x3371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3372[0x6];                                     // 0x3372(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetAnimationPicker_Picker;                // 0x3378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimSequencePickerInstance            CallFunc_BPF_MakeAnimSequencePickerInstance__instance; // 0x3380(0x0038)(ContainsInstancedReference)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x33B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPendingHit                            K2Node_CustomEvent__hit_8;                         // 0x33C0(0x0350)(ConstParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent__context_8;                     // 0x3710(0x0028)()
	class UAbilityTask_HandleHitboxBase*          K2Node_CustomEvent__payloadTarget_8;               // 0x3738(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget)> K2Node_CreateDelegate_OutputDelegate_38; // 0x3740(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEvent                       CallFunc_FindNotifyByClass__outFoundNotify;        // 0x3750(0x00B8)(ContainsInstancedReference)
	bool                                          CallFunc_FindNotifyByClass__bOutFound;             // 0x3808(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3809[0x3];                                     // 0x3809(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetNotifyTriggerTime_ReturnValue;         // 0x380C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_39;           // 0x3810(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FNamedFloatTargetData                  K2Node_MakeStruct_NamedFloatTargetData;            // 0x3820(0x0020)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle;          // 0x3840(0x0028)()
	bool                                          K2Node_CustomEvent_WithDelay;                      // 0x3868(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3869[0x7];                                     // 0x3869(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue; // 0x3870(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTaskOwnerInterface> CallFunc_BPF_TaskWaitAnyGameplayTagAdded__container_CastInput; // 0x3878(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UGameplayTask_WaitGameplayTagAdded*     CallFunc_BPF_TaskWaitAnyGameplayTagAdded_ReturnValue; // 0x3888(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTaskOwnerInterface> CallFunc_BPF_TaskWaitAnyGameplayTagRemoved__container_CastInput; // 0x3890(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UGameplayTask_WaitGameplayTagRemoved*   CallFunc_BPF_TaskWaitAnyGameplayTagRemoved_ReturnValue; // 0x38A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_21;                   // 0x38A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_22;                   // 0x38A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38AA[0x2];                                     // 0x38AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_40;           // 0x38AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAbilityExecOrigin                            K2Node_CustomEvent_AbilityExec;                    // 0x38BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38BD[0x3];                                     // 0x38BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPendingHit                            K2Node_CustomEvent_Hit_Description;                // 0x38C0(0x0350)(ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Player_Context;                 // 0x3C10(0x0028)(ConstParm)
	class UAbilityTask_HandleHitboxComponent*     CallFunc_BPF_HandleHitboxComponent_ReturnValue;    // 0x3C38(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeManifest_Context;                     // 0x3C40(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue; // 0x3C68(0x0028)()
	struct FAnimSequencePlayInfos                 CallFunc_BPF_PickAnimSequence__outSequenceInfos;   // 0x3C90(0x0130)()
	bool                                          CallFunc_IsValid_ReturnValue_23;                   // 0x3DC0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC1[0x7];                                     // 0x3DC1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_BPF_MakeGameplayCueParametersFromPendingHit_ReturnValue; // 0x3DC8(0x00D8)(ContainsInstancedReference)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x3EA0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_ComputeFreezeFrame_ReturnValue;           // 0x3EA8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityExecOrigin                            CallFunc_BPF_AbilityExecEnumToOutput__eOut;        // 0x3EB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x3EB1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EB2[0x6];                                     // 0x3EB2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x3EB8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x3EC0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x3ED0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ED1[0x3];                                     // 0x3ED1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_41;           // 0x3ED4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x3EE4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x3EE5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EE6[0x2];                                     // 0x3EE6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue_2; // 0x3EE8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x3EF0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x3F00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F01[0x7];                                     // 0x3F01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue_3; // 0x3F08(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FPendingHit                            K2Node_CustomEvent__hit_9;                         // 0x3F10(0x0350)(ConstParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent__context_9;                     // 0x4260(0x0028)()
	class UAbilityTask_HandleHitboxBase*          K2Node_CustomEvent__payloadTarget_9;               // 0x4288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTaskOwnerInterface> CallFunc_BPF_TaskWaitAnyGameplayTagRemoved__container_CastInput_1; // 0x4290(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UGameplayTask_WaitGameplayTagRemoved*   CallFunc_BPF_TaskWaitAnyGameplayTagRemoved_ReturnValue_1; // 0x42A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_24;                   // 0x42A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42A9[0x3];                                     // 0x42A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget)> K2Node_CreateDelegate_OutputDelegate_42; // 0x42AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_43;           // 0x42BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42CC[0x4];                                     // 0x42CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WatchInput*                CallFunc_BPF_WatchInput_ReturnValue_3;             // 0x42D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_25;                   // 0x42D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_26;                   // 0x42D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42DA[0x6];                                     // 0x42DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionState                      Temp_struct_Variable_9;                            // 0x42E0(0x0098)()
	bool                                          Temp_bool_Variable_5;                              // 0x4378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4379[0x7];                                     // 0x4379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionState                      K2Node_CustomEvent__state_3;                       // 0x4380(0x0098)(ConstParm)
	bool                                          K2Node_CustomEvent__bActivated_3;                  // 0x4418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityExecOrigin                            CallFunc_BPF_SetNamedFloatTargetData__eOut;        // 0x4419(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441A[0x2];                                     // 0x441A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BPF_SetNamedFloatTargetData_ReturnValue;  // 0x441C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x4420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4421[0x3];                                     // 0x4421(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FInputActionState& _state, bool _bActivated)> K2Node_CreateDelegate_OutputDelegate_44; // 0x4424(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4434[0x4];                                     // 0x4434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x4438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x4440(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x4448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPF_Evaluate_ReturnValue;                 // 0x4450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_27;                   // 0x4451(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4452[0x6];                                     // 0x4452(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2; // 0x4458(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_45;           // 0x4460(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_28;                   // 0x4470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x4471(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4472[0x6];                                     // 0x4472(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_SCStartAbilityState*       CallFunc_BPF_StartAbilityState_ReturnValue_2;      // 0x4478(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_29;                   // 0x4480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x4481(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x4482(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4483[0x5];                                     // 0x4483(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x4488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_46;           // 0x4490(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_47;           // 0x44A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_48;           // 0x44B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BPF_GetTimePassedSinceGameStart_ReturnValue; // 0x44C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C4[0x4];                                     // 0x44C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3; // 0x44C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x44D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x44E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_PickTarget__outTargetData;            // 0x44F0(0x0028)()
	struct FNamedFloatTargetData                  K2Node_MakeStruct_NamedFloatTargetData_1;          // 0x4518(0x0020)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle_1;        // 0x4538(0x0028)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_49;           // 0x4560(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& _context, bool* _bReturnResult)> K2Node_CreateDelegate_OutputDelegate_50; // 0x4570(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_HandleHitboxComponent*     CallFunc_BPF_HandleHitboxComponent_ReturnValue_1;  // 0x4580(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_30;                   // 0x4588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4589[0x7];                                     // 0x4589(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_HandleHitboxBase*          K2Node_Select_Default;                             // 0x4590(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BallInterceptionHandlingForOuterboxPreAnimation_Can_Handle; // 0x4598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
