#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Locomotion

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "SCCore_structs.hpp"
#include "SCCombatSystem_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_Locomotion.GA_Locomotion_C.ExecuteUbergraph_GA_Locomotion
// 0x25F0 (0x25F0 - 0x0000)
struct GA_Locomotion_C_ExecuteUbergraph_GA_Locomotion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EMovementMode, TSubclassOf<class UTagAvailabilityLayerContainer>> K2Node_MakeMap_Map;       // 0x0008(0x0050)(ConstParm)
	class UAbilityTask_TagsPerMovementMode*       CallFunc_BPF_TagsPerMovementMode_ReturnValue;      // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget)> K2Node_CreateDelegate_OutputDelegate; // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0xF];                                       // 0x0071(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPendingHit                            K2Node_CustomEvent__hit_5;                         // 0x0080(0x0350)(ConstParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent__context_3;                     // 0x03D0(0x0028)()
	class UAbilityTask_HandleHitboxBase*          K2Node_CustomEvent__payloadTarget_3;               // 0x03F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPendingHit                            K2Node_CustomEvent__hit_4;                         // 0x0400(0x0350)(ConstParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent__context_2;                     // 0x0750(0x0028)()
	class UAbilityTask_HandleHitboxBase*          K2Node_CustomEvent__payloadTarget_2;               // 0x0778(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0780(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPendingHit                            K2Node_CustomEvent__hit_3;                         // 0x0790(0x0350)(ConstParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent__context_1;                     // 0x0AE0(0x0028)()
	class UAbilityTask_HandleHitboxBase*          K2Node_CustomEvent__payloadTarget_1;               // 0x0B08(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0B10(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPendingHit                            K2Node_CustomEvent__hit_2;                         // 0x0B20(0x0350)(ConstParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent__context;                       // 0x0E70(0x0028)()
	class UAbilityTask_HandleHitboxBase*          K2Node_CustomEvent__payloadTarget;                 // 0x0E98(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0EA0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_HandleHitboxBase*          Temp_object_Variable;                              // 0x0EB0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x0EB8(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_GenerateBallControlContext_ReturnValue;   // 0x0EE0(0x0028)()
	uint8                                         Pad_F08[0x8];                                      // 0x0F08(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPendingHit                            Temp_struct_Variable_1;                            // 0x0F10(0x0350)(ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x1260(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x1270(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_SCStartAbilityState*       CallFunc_BPF_StartAbilityState_ReturnValue;        // 0x1280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_HandleLooseGameplayTags*   CallFunc_BPF_HandleLooseGameplayTag_ReturnValue;   // 0x1288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x1290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x1291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1292[0x6];                                     // 0x1292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_HandleAvailabilityTags*    CallFunc_BPF_HandleAvailabilityTagsFromData_ReturnValue; // 0x1298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x12A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A1[0x3];                                     // 0x12A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FPendingHit& _hit, const float _fTimeSincePredictionStart)> K2Node_CreateDelegate_OutputDelegate_6; // 0x12A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12B4[0xC];                                     // 0x12B4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPendingHit                            K2Node_CustomEvent__hit_1;                         // 0x12C0(0x0350)(ConstParm, ContainsInstancedReference)
	float                                         K2Node_CustomEvent__fTimeSincePredictionStart_1;   // 0x1610(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1614[0xC];                                     // 0x1614(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPendingHit                            K2Node_CustomEvent__hit;                           // 0x1620(0x0350)(ConstParm, ContainsInstancedReference)
	float                                         K2Node_CustomEvent__fTimeSincePredictionStart;     // 0x1970(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPendingHit& _hit, const float _fTimeSincePredictionStart)> K2Node_CreateDelegate_OutputDelegate_7; // 0x1974(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x1984(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1988[0x8];                                     // 0x1988(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPendingHit                            Temp_struct_Variable_2;                            // 0x1990(0x0350)(ContainsInstancedReference)
	struct FHitTargetDataHandle                   CallFunc_Conv_HitTargetDataHandle_ReturnValue;     // 0x1CE0(0x03A0)(ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle;          // 0x2080(0x0028)()
	class UAnimMontage*                           CallFunc_GetBallControlPreAnimationParameters_OutMontage; // 0x20A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBallControlPreAnimationParameters_bOutMirror; // 0x20B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20B1[0x7];                                     // 0x20B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetBallControlPreAnimationParameters_OutWorldSyncTime; // 0x20B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetBallControlPreAnimationParameters_OutAnimSyncTime; // 0x20C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetBallControlPreAnimationParameters_OutAnimBlendOutTime; // 0x20C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x20D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlaySimulatedAestheticMontage* CallFunc_BPF_PlaySimulatedTimedAstheticMontage_ReturnValue; // 0x20E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x20E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20E9[0x3];                                     // 0x20E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x20EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x20FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x210C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x211C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x212C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_14;           // 0x213C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_15;           // 0x214C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_16;           // 0x215C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_17;           // 0x216C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_18;           // 0x217C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_19;           // 0x218C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x219C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x219D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219E[0x2];                                     // 0x219E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_HandleCharacterLocomotion* CallFunc_BPF_HandleCharacterLocomotion_ReturnValue; // 0x21A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x21A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x21A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21AA[0x6];                                     // 0x21AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPendingHit                            K2Node_CustomEvent__hit_6;                         // 0x21B0(0x0350)(ConstParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent__context_4;                     // 0x2500(0x0028)()
	class UAbilityTask_HandleHitboxBase*          K2Node_CustomEvent__payloadTarget_4;               // 0x2528(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x2530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2531[0x7];                                     // 0x2531(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTargetDatasourceInstance              K2Node_MakeStruct_TargetDatasourceInstance;        // 0x2538(0x0048)(ContainsInstancedReference)
	double                                        K2Node_CustomEvent_Delay;                          // 0x2580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_HandleHitboxComponent*     CallFunc_BPF_HandleHitboxComponent_ReturnValue;    // 0x2588(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x2590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityExecOrigin                            Temp_byte_Variable;                                // 0x2591(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2592[0x6];                                     // 0x2592(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PredictHit*                CallFunc_BPF_PredictHit_ReturnValue;               // 0x2598(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget)> K2Node_CreateDelegate_OutputDelegate_20; // 0x25A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x25B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25B1[0x7];                                     // 0x25B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_ActorCondition*            CallFunc_BPF_EvaluateOverTime_ReturnValue;         // 0x25B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x25C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityExecOutputWithValidation              CallFunc_BPF_PlayMontageFromAestheticMontage__eOut; // 0x25C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C2[0x6];                                     // 0x25C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageFromAestheticMontage* CallFunc_BPF_PlayMontageFromAestheticMontage_ReturnValue; // 0x25C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x25D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x25D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25D2[0x2];                                     // 0x25D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BPF_PlaySimulatedTimedAstheticMontage__fWorldSyncTime_ImplicitCast; // 0x25D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BPF_PlaySimulatedTimedAstheticMontage__fAnimSyncTime_ImplicitCast; // 0x25D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BPF_PlaySimulatedTimedAstheticMontage__fBlendOutAnimTime_ImplicitCast; // 0x25DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x25E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25E4[0x4];                                     // 0x25E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_HandlePrep_Delay_ImplicitCast;            // 0x25E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Locomotion_C_ExecuteUbergraph_GA_Locomotion;

// Function GA_Locomotion.GA_Locomotion_C.GenerateBallControlContext
// 0x04A0 (0x04A0 - 0x0000)
struct GA_Locomotion_C_GenerateBallControlContext final
{
public:
	struct FGameplayAbilityTargetDataHandle       InTargetDataHandle;                                // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayAbilityTargetDataHandle       ReturnValue;                                       // 0x0028(0x0028)(Parm, OutParm, ReturnParm)
	struct FBaseHitDescTargetDataHandle           CallFunc_GetTargetDataPure__outData;               // 0x0050(0x03A0)(ContainsInstancedReference)
	bool                                          CallFunc_GetTargetDataPure_ReturnValue;            // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle;          // 0x03F8(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_InitTargetDataFromManifest__out;      // 0x0420(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue; // 0x0448(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeManifestTargetData__out;              // 0x0470(0x0028)()
};
DUMPER7_ASSERTS_GA_Locomotion_C_GenerateBallControlContext;

// Function GA_Locomotion.GA_Locomotion_C.GeneratePreBallControlContext
// 0x0420 (0x0420 - 0x0000)
struct GA_Locomotion_C_GeneratePreBallControlContext final
{
public:
	struct FGameplayAbilityTargetDataHandle       InTargetDataHandle;                                // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayAbilityTargetDataHandle       ReturnValue;                                       // 0x0028(0x0028)(Parm, OutParm, ReturnParm)
	struct FBaseHitDescTargetDataHandle           CallFunc_GetTargetDataPure__outData;               // 0x0050(0x03A0)(ContainsInstancedReference)
	bool                                          CallFunc_GetTargetDataPure_ReturnValue;            // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle;          // 0x03F8(0x0028)()
};
DUMPER7_ASSERTS_GA_Locomotion_C_GeneratePreBallControlContext;

// Function GA_Locomotion.GA_Locomotion_C.GetBallControlPreAnimationParameters
// 0x0670 (0x0670 - 0x0000)
struct GA_Locomotion_C_GetBallControlPreAnimationParameters final
{
public:
	struct FGameplayAbilityTargetDataHandle       InContext;                                         // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UAnimMontage*                           OutMontage;                                        // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bOutMirror;                                        // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        OutWorldSyncTime;                                  // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OutAnimSyncTime;                                   // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OutAnimBlendOutTime;                               // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitTargetDataHandle                   CallFunc_GetTargetData__outData;                   // 0x0050(0x03A0)(ContainsInstancedReference)
	bool                                          CallFunc_GetTargetData_ReturnValue;                // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x03F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEvent                       CallFunc_FindNotifyByClass__outFoundNotify;        // 0x0410(0x00B8)(ContainsInstancedReference)
	bool                                          CallFunc_FindNotifyByClass__bOutFound;             // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C9[0x3];                                      // 0x04C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetNotifyTriggerTime_ReturnValue;         // 0x04CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x04D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSequencePickerInstance            CallFunc_BPF_MakeAnimSequencePickerInstance__instance; // 0x04E0(0x0038)(ContainsInstancedReference)
	uint8                                         Pad_518[0x8];                                      // 0x0518(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSequencePlayInfos                 CallFunc_BPF_PickAnimSequence__outSequenceInfos;   // 0x0520(0x0130)()
	double                                        K2Node_FunctionResult_OutAnimSyncTime_ImplicitCast; // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_1;        // 0x0668(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Locomotion_C_GetBallControlPreAnimationParameters;

// Function GA_Locomotion.GA_Locomotion_C.HandlePrep
// 0x0008 (0x0008 - 0x0000)
struct GA_Locomotion_C_HandlePrep final
{
public:
	double                                        Delay;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Locomotion_C_HandlePrep;

// Function GA_Locomotion.GA_Locomotion_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Locomotion_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Locomotion_C_K2_OnEndAbility;

// Function GA_Locomotion.GA_Locomotion_C.m_BuildClientHitboxPayload_188456AB43D6E26F5A28ABA6369574C9
// 0x0380 (0x0380 - 0x0000)
struct GA_Locomotion_C_m_BuildClientHitboxPayload_188456AB43D6E26F5A28ABA6369574C9 final
{
public:
	struct FPendingHit                            _hit;                                              // 0x0000(0x0350)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       _context;                                          // 0x0350(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UAbilityTask_HandleHitboxBase*          _payloadTarget;                                    // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Locomotion_C_m_BuildClientHitboxPayload_188456AB43D6E26F5A28ABA6369574C9;

// Function GA_Locomotion.GA_Locomotion_C.m_OnHit_188456AB43D6E26F5A28ABA6369574C9
// 0x0380 (0x0380 - 0x0000)
struct GA_Locomotion_C_m_OnHit_188456AB43D6E26F5A28ABA6369574C9 final
{
public:
	struct FPendingHit                            _hit;                                              // 0x0000(0x0350)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       _context;                                          // 0x0350(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UAbilityTask_HandleHitboxBase*          _payloadTarget;                                    // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Locomotion_C_m_OnHit_188456AB43D6E26F5A28ABA6369574C9;

// Function GA_Locomotion.GA_Locomotion_C.m_OnHitRecovery_188456AB43D6E26F5A28ABA6369574C9
// 0x0380 (0x0380 - 0x0000)
struct GA_Locomotion_C_m_OnHitRecovery_188456AB43D6E26F5A28ABA6369574C9 final
{
public:
	struct FPendingHit                            _hit;                                              // 0x0000(0x0350)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       _context;                                          // 0x0350(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UAbilityTask_HandleHitboxBase*          _payloadTarget;                                    // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Locomotion_C_m_OnHitRecovery_188456AB43D6E26F5A28ABA6369574C9;

// Function GA_Locomotion.GA_Locomotion_C.m_OnHitRejected_188456AB43D6E26F5A28ABA6369574C9
// 0x0380 (0x0380 - 0x0000)
struct GA_Locomotion_C_m_OnHitRejected_188456AB43D6E26F5A28ABA6369574C9 final
{
public:
	struct FPendingHit                            _hit;                                              // 0x0000(0x0350)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       _context;                                          // 0x0350(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UAbilityTask_HandleHitboxBase*          _payloadTarget;                                    // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Locomotion_C_m_OnHitRejected_188456AB43D6E26F5A28ABA6369574C9;

// Function GA_Locomotion.GA_Locomotion_C.m_OnHitValidated_188456AB43D6E26F5A28ABA6369574C9
// 0x0380 (0x0380 - 0x0000)
struct GA_Locomotion_C_m_OnHitValidated_188456AB43D6E26F5A28ABA6369574C9 final
{
public:
	struct FPendingHit                            _hit;                                              // 0x0000(0x0350)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       _context;                                          // 0x0350(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UAbilityTask_HandleHitboxBase*          _payloadTarget;                                    // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Locomotion_C_m_OnHitValidated_188456AB43D6E26F5A28ABA6369574C9;

// Function GA_Locomotion.GA_Locomotion_C.m_OnPredicted_33CD39214CD88E12458341A4DF8DBC10
// 0x0360 (0x0360 - 0x0000)
struct GA_Locomotion_C_m_OnPredicted_33CD39214CD88E12458341A4DF8DBC10 final
{
public:
	struct FPendingHit                            _hit;                                              // 0x0000(0x0350)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	float                                         _fTimeSincePredictionStart;                        // 0x0350(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Locomotion_C_m_OnPredicted_33CD39214CD88E12458341A4DF8DBC10;

// Function GA_Locomotion.GA_Locomotion_C.m_OnPredictionCanceled_33CD39214CD88E12458341A4DF8DBC10
// 0x0360 (0x0360 - 0x0000)
struct GA_Locomotion_C_m_OnPredictionCanceled_33CD39214CD88E12458341A4DF8DBC10 final
{
public:
	struct FPendingHit                            _hit;                                              // 0x0000(0x0350)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	float                                         _fTimeSincePredictionStart;                        // 0x0350(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Locomotion_C_m_OnPredictionCanceled_33CD39214CD88E12458341A4DF8DBC10;

// Function GA_Locomotion.GA_Locomotion_C.PrepareTargetData
// 0x00D0 (0x00D0 - 0x0000)
struct GA_Locomotion_C_PrepareTargetData final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData_In;                                     // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FGameplayAbilityTargetDataHandle       TargetData_Out;                                    // 0x0028(0x0028)(Parm, OutParm)
	class UAbilityTask_PlaySimulatedAestheticMontage* K2Node_DynamicCast_AsAbility_Task_Play_Simulated_Aesthetic_Montage; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMontageInstancePosition_ReturnValue;   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FNamedFloatTargetData                  K2Node_MakeStruct_NamedFloatTargetData;            // 0x0060(0x0020)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle;          // 0x0080(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue; // 0x00A8(0x0028)()
};
DUMPER7_ASSERTS_GA_Locomotion_C_PrepareTargetData;

}

