#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Locomotion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCCore_structs.hpp"
#include "Runtime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Locomotion.GA_Locomotion_C
// 0x01B8 (0x0810 - 0x0658)
class UGA_Locomotion_C final : public URuntimeGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0658(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FInputStablizationSettings             InputStabilizationSettings;                        // 0x0660(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor)
	struct FBaseActorConditionInstance            PreAnimationCondition;                             // 0x0670(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, ContainsInstancedReference)
	float                                         BallControlPreAnimationDuration;                   // 0x0680(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BallControlPreAnimationLifeSpan;                   // 0x0684(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BallControlPreAnimationFullWeightDuration;         // 0x0688(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BallControlPreAnimationTimer;                      // 0x068C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlaySimulatedAestheticMontage* PreAnimationTask;                              // 0x0690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UAnimSequencePicker>        BallControlPicker;                                 // 0x0698(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAbilityTask_SCPlayMontageAndWait*      ControlTask;                                       // 0x06A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         BallControlPreAnimationCooldownDuration;           // 0x06A8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BallControlPreAnimationCooldownTimer;              // 0x06AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSequencePlayInfos                 PlayInfos;                                         // 0x06B0(0x0130)(Edit, BlueprintVisible)
	bool                                          CanInterruptPreAnimation;                          // 0x07E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E1[0x7];                                      // 0x07E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_HandleHitboxBase*          HandleHitboxTask;                                  // 0x07E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 BallControlPredictionDatasource;                   // 0x07F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 PickerPrediction;                                  // 0x07F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         PreAnimAvailabilityTagsIndex;                      // 0x0800(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_804[0x4];                                      // 0x0804(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UTagAvailabilityLayerContainer> ControlAvailabilityTags;                       // 0x0808(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void BallControlBranch();
	void ExecuteUbergraph_GA_Locomotion(int32 EntryPoint);
	struct FGameplayAbilityTargetDataHandle GenerateBallControlContext(const struct FGameplayAbilityTargetDataHandle& InTargetDataHandle);
	struct FGameplayAbilityTargetDataHandle GeneratePreBallControlContext(const struct FGameplayAbilityTargetDataHandle& InTargetDataHandle);
	void GetBallControlPreAnimationParameters(const struct FGameplayAbilityTargetDataHandle& InContext, class UAnimMontage** OutMontage, bool* bOutMirror, double* OutWorldSyncTime, double* OutAnimSyncTime, double* OutAnimBlendOutTime);
	void HandlePrep(double Delay);
	void K2_ActivateAbility();
	void K2_CommitExecute();
	void K2_OnEndAbility(bool bWasCancelled);
	void m_BuildClientHitboxPayload_188456AB43D6E26F5A28ABA6369574C9(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget);
	void m_OnCanMoveInterrupt_1FFC394346EB2206EFC4ABAFC88E2385();
	void m_OnHit_188456AB43D6E26F5A28ABA6369574C9(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget);
	void m_OnHitRecovery_188456AB43D6E26F5A28ABA6369574C9(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget);
	void m_OnHitRejected_188456AB43D6E26F5A28ABA6369574C9(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget);
	void m_OnHitValidated_188456AB43D6E26F5A28ABA6369574C9(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget);
	void m_OnInvalidated_14A4C59D46A262D9CFAEAA8B516F7479();
	void m_OnMoveInterrupt_1FFC394346EB2206EFC4ABAFC88E2385();
	void m_OnPredicted_33CD39214CD88E12458341A4DF8DBC10(const struct FPendingHit& _hit, const float _fTimeSincePredictionStart);
	void m_OnPredictionCanceled_33CD39214CD88E12458341A4DF8DBC10(const struct FPendingHit& _hit, const float _fTimeSincePredictionStart);
	void m_OnValidated_14A4C59D46A262D9CFAEAA8B516F7479();
	void m_OnValidNullMontageChosen_1FFC394346EB2206EFC4ABAFC88E2385();
	void OnBlendedIn_1FFC394346EB2206EFC4ABAFC88E2385();
	void OnBlendOut_1FFC394346EB2206EFC4ABAFC88E2385();
	void OnBlendOut_AF171FC04E05DC241F34469EFF2C6ABF();
	void OnCancelled_1FFC394346EB2206EFC4ABAFC88E2385();
	void OnCompleted_1FFC394346EB2206EFC4ABAFC88E2385();
	void OnEnded_AF171FC04E05DC241F34469EFF2C6ABF();
	void OnInterrupted_1FFC394346EB2206EFC4ABAFC88E2385();
	void OnStateEnded_E3DF55D84CEB290C199EBE87D30ABFD9();
	void OnStateInterrupted_E3DF55D84CEB290C199EBE87D30ABFD9();
	void PrepareTargetData(const struct FGameplayAbilityTargetDataHandle& TargetData_In, struct FGameplayAbilityTargetDataHandle* TargetData_Out);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Locomotion_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Locomotion_C")
	}
	static class UGA_Locomotion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Locomotion_C>();
	}
};
DUMPER7_ASSERTS_UGA_Locomotion_C;

}

