#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_LookAtBall

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCCore_structs.hpp"
#include "Runtime_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_LookAtBall.GA_LookAtBall_C
// 0x0530 (0x0B88 - 0x0658)
class UGA_LookAtBall_C final : public URuntimeGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0658(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSCCameraLookAtServiceBehavior         LookAtBallParamStartOnActor;                       // 0x0660(0x0188)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ABall*                                  PotentialBallToLookAt;                             // 0x07E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         LookAtBallHandle;                                  // 0x07F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F4[0x4];                                      // 0x07F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraComponentThird*                  CamComp;                                           // 0x07F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           DelayBeforeRemovingLocoFreeze;                     // 0x0800(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_MoveToCollision*           FreezeMovePlayer;                                  // 0x0808(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          FocusForwardPlayerAfterReorientation;              // 0x0810(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_811[0x7];                                      // 0x0811(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PreviousCamOrientation;                            // 0x0818(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WatchInput*                WatchInputTask;                                    // 0x0830(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitInputRedirection*      WaitRedirectionTask;                               // 0x0838(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         ToleranceAngleToRedirect;                          // 0x0840(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_844[0x4];                                      // 0x0844(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSCCameraLookAtServiceBehavior         LookAtBallEnd;                                     // 0x0848(0x0188)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FInputGameplayAbilityTargetData        WatchedInputTargetData;                            // 0x09D0(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        ClicLetDuration;                                   // 0x0A28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ClearOrientationOverride_DelayedHandler;           // 0x0A30(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCameraLockBallService*                 LockBallCameraService;                             // 0x0A38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        TimeAheadUsedForBallPosPrediction;                 // 0x0A40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSCCameraLookAtServiceBehaviorConfig   LookAtBallParamLockMove;                           // 0x0A48(0x0138)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        ZeroDampingDistanceArroundCharacter;               // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BindServiceState();
	void BlendInputOrientationToCurrentView();
	void CanGoBackToInitialOrientation(bool* GoBackToInitialOrientation);
	void ExecuteUbergraph_GA_LookAtBall(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_CommitExecute();
	void K2_OnEndAbility(bool bWasCancelled);
	void LookAt(bool* Succeeded);
	void m_OnTrigger_198AD80845F70DD7D1000BAE516C8349(const struct FInputActionState& _state, bool _bActivated);
	void m_OnTrigger_BEDC9599465F55AF7406A6A2E2676BE7(const struct FInputActionState& _state, bool _bActivated);
	void OnLockBallStateUpdate(EServiceStateUpdate eStateUpdate);
	void ResetAbility(bool EndGA);
	void UnbindServiceState();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_LookAtBall_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_LookAtBall_C")
	}
	static class UGA_LookAtBall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_LookAtBall_C>();
	}
};
DUMPER7_ASSERTS_UGA_LookAtBall_C;

}

