#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_LockMove

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "FreezeFrameOverrideStruct_structs.hpp"
#include "Engine_structs.hpp"
#include "Runtime_structs.hpp"
#include "Runtime_classes.hpp"
#include "SCCore_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_LockMove.GA_LockMove_C
// 0x0588 (0x0BE0 - 0x0658)
#pragma pack(push, 0x1)
class alignas(0x10) UGA_LockMove_C : public URuntimeGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0658(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABall*                                  PotentialBallToLookAt;                             // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCameraComponentThird*                  CamComp;                                           // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSCCameraLookAtServiceBehavior         LookAtBallParam;                                   // 0x0670(0x0188)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         LookAtBallHandle;                                  // 0x07F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           HitboxID;                                          // 0x07FC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_804[0x4];                                      // 0x0804(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  StatesBasedOnLockMove;                             // 0x0808(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_828[0x8];                                      // 0x0828(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBallInterceptionPointTargetData       BallInterceptionDuringHit;                         // 0x0830(0x0120)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ShouldDeflectOrCatch;                              // 0x0950(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_951[0x7];                                      // 0x0951(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_HandleLooseGameplayTags*   HandleLooseTag;                                    // 0x0958(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         PreAnimationCooldownTimer;                         // 0x0960(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_964[0x4];                                      // 0x0964(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBaseActorConditionInstance            PreAnimationCondition;                             // 0x0968(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, ContainsInstancedReference)
	class UAbilityTask*                           PreAnimationMontageTask;                           // 0x0978(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_SCPlayMontageAndWait*      HitMontageTask;                                    // 0x0980(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         PreAnimationCooldownDuration;                      // 0x0988(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PreAnimationDuration;                              // 0x098C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 PreAnimationPicker;                                // 0x0990(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 DefenseModePredictionDatasource;                   // 0x0998(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         PreAnimationTimer;                                 // 0x09A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PreAnimationLifeSpan;                              // 0x09A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A8[0x8];                                      // 0x09A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSequencePlayInfos                 PlayInfos;                                         // 0x09B0(0x0130)(Edit, BlueprintVisible)
	TSubclassOf<class UAnimSequencePicker>        LockMoveBallControlPicker;                         // 0x0AE0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UAnimSequencePicker>        LockMoveHitPicker;                                 // 0x0AE8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         PreAnimationFullWeightDuration;                    // 0x0AF0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AF4[0x4];                                      // 0x0AF4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_HandleHitboxBase*          HandleHitboxTask;                                  // 0x0AF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          CanInterruptPreAnimation;                          // 0x0B00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B01[0x3];                                      // 0x0B01(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           FreezeTag;                                         // 0x0B04(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B0C[0x4];                                      // 0x0B0C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DefaultFreezeDuration;                             // 0x0B10(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Computed_Freeze_Frame_Duration;                    // 0x0B18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFreezeFrameOverrideStruct>     FreezeFrameOverrides;                              // 0x0B20(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference)
	class UAbilityTask_ApplyRootMotionConstantForce* PreAnimationRootMotionSourceTask;               // 0x0B30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnablePreAnimation;                               // 0x0B38(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bForceMovementOnPreAnimation;                      // 0x0B39(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPredictedInnerHit;                                // 0x0B3A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B3B[0x5];                                      // 0x0B3B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 DefenseModePredictionDatasource_InnerBox;          // 0x0B40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Pre_Animation_Duration_Inner_Box;                  // 0x0B48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           InnerHitboxId;                                     // 0x0B50(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_HandleHitboxBase*          HandleInnerHitboxTask;                             // 0x0B58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bDismissOuterboxPreAnimHit;                        // 0x0B60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B61[0x7];                                      // 0x0B61(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       ProjectionHit;                                     // 0x0B68(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayAbilityTargetDataHandle       ProjectionTime;                                    // 0x0B90(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bAbilityActive;                                    // 0x0BB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bToggleDefenceMode;                                // 0x0BB9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BBA[0x6];                                      // 0x0BBA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WatchInput*                WatchInputTask;                                    // 0x0BC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ToggleDefenseModeTag;                              // 0x0BC8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_HandleLooseGameplayTags*   HandleBallControlLooseTag;                         // 0x0BD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Added_AB0069F048C33F608F4ED6A558F549F6();
	void Added_AB7403244EF9910F61860A9429567692();
	void Added_D2423D7B4427AEABB8A13C9C50BC2E0D();
	void BallInterceptionHandlingForBehavior(const struct FGameplayAbilityTargetDataHandle& Context);
	void BallInterceptionHandlingForOuterboxPreAnimation(const struct FGameplayAbilityTargetDataHandle& Context, bool* Can_Handle);
	void BPE_BuildPayload();
	void ComputeBallControlPreAnimation(const struct FGameplayAbilityTargetDataHandle& InContext, class UAnimMontage** OutMontage, bool* bOutMirror, double* OutWorldSyncTime, double* OutAnimSyncTime, double* OutAnimBlendOutTime);
	void EndToggleState();
	void ExecuteUbergraph_GA_LockMove(int32 EntryPoint);
	float GetToggleDefenseModeValue();
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_CommitExecute();
	void K2_OnEndAbility(bool bWasCancelled);
	void LookAt(bool Remove);
	void m_BuildClientHitboxPayload_660E14AD41600E2D6C501AAFE5E2B518(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget);
	void m_BuildClientHitboxPayload_978C98CA4D8D102AEAC1619787249762(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget);
	void m_OnCanMoveInterrupt_C85A83FA408ED850695CAEA4D0446510();
	void m_OnHit_660E14AD41600E2D6C501AAFE5E2B518(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget);
	void m_OnHit_978C98CA4D8D102AEAC1619787249762(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget);
	void m_OnHitRecovery_660E14AD41600E2D6C501AAFE5E2B518(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget);
	void m_OnHitRecovery_978C98CA4D8D102AEAC1619787249762(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget);
	void m_OnHitRejected_660E14AD41600E2D6C501AAFE5E2B518(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget);
	void m_OnHitRejected_978C98CA4D8D102AEAC1619787249762(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget);
	void m_OnHitValidated_660E14AD41600E2D6C501AAFE5E2B518(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget);
	void m_OnHitValidated_978C98CA4D8D102AEAC1619787249762(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget);
	void m_OnMoveInterrupt_C85A83FA408ED850695CAEA4D0446510();
	void m_OnTrigger_1C1A0ED04F906D12167E0DA516B02F5D(const struct FInputActionState& _state, bool _bActivated);
	void m_OnTrigger_2C11103F45405ACF05C0B7BA21105D0C(const struct FInputActionState& _state, bool _bActivated);
	void m_OnTrigger_B45DEB8C4289F7B8B51E258941B4BBE1(const struct FInputActionState& _state, bool _bActivated);
	void m_OnTrigger_BC482665482168E58A1E64B568BCC4B9(const struct FInputActionState& _state, bool _bActivated);
	void m_OnValidNullMontageChosen_C85A83FA408ED850695CAEA4D0446510();
	void MakeManifest(const struct FGameplayAbilityTargetDataHandle& Handle, struct FGameplayAbilityTargetDataHandle* Context);
	void MovingState(bool WithDelay);
	void OnBlendedIn_C85A83FA408ED850695CAEA4D0446510();
	void OnBlendOut_474B2CCF4D790D79CA397692DD64D230();
	void OnBlendOut_C85A83FA408ED850695CAEA4D0446510();
	void OnCancelled_C85A83FA408ED850695CAEA4D0446510();
	void OnCatchup_A5EF05D341ADBB38C9D22BAB858BAF59();
	void OnCatchup_BA29600F4818A85BCC8665A96DA38D14();
	void OnCatchup_D3FADFC449ADF73AB6EF209B7700D894();
	void OnCompleted_C85A83FA408ED850695CAEA4D0446510();
	void OnEnded_474B2CCF4D790D79CA397692DD64D230();
	void OnFinish_896C095341836569B0C799909447689D();
	void OnFinish_B2E7B3304CE3E46C007E7982F879D042();
	void OnHitAndBuildPayload(EAbilityExecOrigin AbilityExec, const struct FPendingHit& Hit_Description, const struct FGameplayAbilityTargetDataHandle& Player_Context);
	void OnHitPredicted_3351BFD041BA549FCC3E1ABC2865BBB0(const struct FGameplayAbilityTargetDataHandle& Data);
	void OnHitProjectionFailed_3351BFD041BA549FCC3E1ABC2865BBB0();
	void OnInterrupted_C85A83FA408ED850695CAEA4D0446510();
	void OnRejected_A5EF05D341ADBB38C9D22BAB858BAF59();
	void OnRejected_BA29600F4818A85BCC8665A96DA38D14();
	void OnRejected_D3FADFC449ADF73AB6EF209B7700D894();
	void OnStateEnded_8BD98EE64E207074DB6DC4ADC9585F1D();
	void OnStateEnded_BC9CE18D488A0366A0CCE8A3D1E2B363();
	void OnStateEnded_C28279794F787B168CD1A39A47ACA682();
	void OnStateInterrupted_8BD98EE64E207074DB6DC4ADC9585F1D();
	void OnStateInterrupted_BC9CE18D488A0366A0CCE8A3D1E2B363();
	void OnStateInterrupted_C28279794F787B168CD1A39A47ACA682();
	void OnSync_2D78F8E24228E2AA392DF6836C5E5C69();
	void OnSync_7ADDD3BC4BBEDD9113F9B09EA4ADB269();
	void OnSync_F1279D4A45AE2F4EE9C0DEAFFC2F1539();
	void OnTick_A06B21B94372873D5A78F586AA27A7EA(float fDeltaTime);
	void PreAnimation();
	void Removed_6DA04CB14C20913652FAD8B1E748B866();
	void Removed_9AD10AAE4E8EF064AD12FB82CF335E1A();
	void Removed_E82AA0DE43AF2D51A424E1A7882A83B6();
	void StartStateTasks_8BD98EE64E207074DB6DC4ADC9585F1D();
	void StartStateTasks_BC9CE18D488A0366A0CCE8A3D1E2B363();
	void StartStateTasks_C28279794F787B168CD1A39A47ACA682();
	void StopPreAnimation();
	void StopState();
	void ValidateHit(const struct FGameplayAbilityTargetDataHandle& _context, bool* _bReturnResult);

	double ComputeFreezeFrame(const struct FPendingHit& InPendingHit) const;
	void GetAnimationPicker(class UClass** Picker) const;
	void MakeBallControlManifest(const struct FGameplayAbilityTargetDataHandle& Handle, struct FGameplayAbilityTargetDataHandle* Context) const;
	void MakeDeflectManifest(const struct FGameplayAbilityTargetDataHandle& Handle, struct FGameplayAbilityTargetDataHandle* Context, struct FGameplayAbilityTargetDataHandle* Handle1) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_LockMove_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_LockMove_C")
	}
	static class UGA_LockMove_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_LockMove_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UGA_LockMove_C;

}

