#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_PushBall

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_BaseShoot_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "SCCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_PushBall.GA_PushBall_C
// 0x0060 (0x0E10 - 0x0DB0)
class UGA_PushBall_C : public UGA_BaseShoot_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_PushBall_C;                      // 0x0DB0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UClass*>                         Status;                                            // 0x0DB8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSubclassOf<class UAnimSequencePicker>        Picker;                                            // 0x0DC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayTagContainer                  AvailabilityLayerTags;                             // 0x0DD0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        Duration_Before_Apply_Tags;                        // 0x0DF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Duration_Tags;                                     // 0x0DF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABall*                                  Ball;                                              // 0x0E00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            TackleCooldownAfterReleaseBall;                    // 0x0E08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void BPE_BuildPayload();
	void ExecuteUbergraph_GA_PushBall(int32 EntryPoint);
	void GetCameraDirection(struct FGameplayAbilityTargetDataHandle* CameraDirection);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void m_BuildClientPayload_28011DC94815BC842EC36FA73C30C7D9(const struct FGameplayAbilityTargetDataHandle& Data);
	void m_OnCanMoveInterrupt_911C45A34C387FDA2050A58229B60969();
	void m_OnMoveInterrupt_911C45A34C387FDA2050A58229B60969();
	void m_OnShoot_9FC7E1194EDDED5FB27083AAECC86B64();
	void m_OnShootCanceled_9FC7E1194EDDED5FB27083AAECC86B64();
	void m_OnValidNullMontageChosen_911C45A34C387FDA2050A58229B60969();
	void OnBlendedIn_911C45A34C387FDA2050A58229B60969();
	void OnBlendOut_911C45A34C387FDA2050A58229B60969();
	void OnCancel_28011DC94815BC842EC36FA73C30C7D9(const struct FGameplayAbilityTargetDataHandle& Data);
	void OnCancelled_911C45A34C387FDA2050A58229B60969();
	void OnCompleted_911C45A34C387FDA2050A58229B60969();
	void OnInterrupted_911C45A34C387FDA2050A58229B60969();
	void OnSync_28011DC94815BC842EC36FA73C30C7D9(const struct FGameplayAbilityTargetDataHandle& Data);
	void OnTimeOut_28011DC94815BC842EC36FA73C30C7D9(const struct FGameplayAbilityTargetDataHandle& Data);

	struct FGameplayAbilityTargetDataHandle GenerateContext() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_PushBall_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_PushBall_C")
	}
	static class UGA_PushBall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_PushBall_C>();
	}
};
DUMPER7_ASSERTS_UGA_PushBall_C;

}

