#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Shoot_GoalKeeper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_BaseShoot_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "SCCore_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Runtime_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Shoot_GoalKeeper.GA_Shoot_GoalKeeper_C
// 0x0100 (0x0EB0 - 0x0DB0)
class UGA_Shoot_GoalKeeper_C : public UGA_BaseShoot_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Shoot_GoalKeeper_C;              // 0x0DB0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTagContainer                  CameraShootGameplayTag;                            // 0x0DB8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UClass*>                         Status;                                            // 0x0DD8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 CameraShake;                                       // 0x0DE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USCInputAction*                         IAMagnus;                                          // 0x0DF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTargetDataConditionInstance           ConditionsToSyncEarly;                             // 0x0DF8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, ContainsInstancedReference)
	bool                                          Sync_by_Conditions;                                // 0x0E08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_E09[0x7];                                      // 0x0E09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_HandleLooseGameplayTags*   BeforeTagTask;                                     // 0x0E10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	TSubclassOf<class UAnimSequencePickerSlotContainer> HighPicker;                                  // 0x0E18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   AnimSlot;                                          // 0x0E20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	TSubclassOf<class UAnimSequencePickerSlotContainer> LowPicker;                                   // 0x0E28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FSCNetworkSyncData                     SCNetworkSyncData;                                 // 0x0E30(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ABall*                                  Ball;                                              // 0x0E40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Time_RemainingAfterBuildUp;                        // 0x0E48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4C[0x4];                                      // 0x0E4C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRTInputActionsForNetworkSyncShoot     Input_Actions_for_Network_Sync_Shoot;              // 0x0E50(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UClass*                                 MKRotationForceComputation;                        // 0x0E68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 MKDirectionComputation;                            // 0x0E70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       OverrideComputation;                               // 0x0E78(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          LockCameraShoot;                                   // 0x0EA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyShoot();
	void BPE_BuildPayload();
	void ExecuteUbergraph_GA_Shoot_GoalKeeper(int32 EntryPoint);
	void InitOverrideComputationForKeyBoard(bool IsKeyBoardController);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void m_BuildClientPayload_05995E844724AC31CF7E90AC71CE173C(const struct FGameplayAbilityTargetDataHandle& Data);
	void m_BuildClientPayload_63F2E00741CD4BB948BC938AE8AA78A3(const struct FGameplayAbilityTargetDataHandle& Data);
	void m_OnCanMoveInterrupt_D13E6CF94B0258CA7286AA89D67818D1();
	void m_OnCanMoveInterrupt_EE9806F844F4B80C99B6A8AF429D68AA();
	void m_OnMoveInterrupt_D13E6CF94B0258CA7286AA89D67818D1();
	void m_OnMoveInterrupt_EE9806F844F4B80C99B6A8AF429D68AA();
	void m_OnShoot_8072760F42FB5358011094B5F18BD4D0();
	void m_OnShootCanceled_8072760F42FB5358011094B5F18BD4D0();
	void m_OnValidNullMontageChosen_D13E6CF94B0258CA7286AA89D67818D1();
	void m_OnValidNullMontageChosen_EE9806F844F4B80C99B6A8AF429D68AA();
	void OnBlendedIn_D13E6CF94B0258CA7286AA89D67818D1();
	void OnBlendedIn_EE9806F844F4B80C99B6A8AF429D68AA();
	void OnBlendOut_D13E6CF94B0258CA7286AA89D67818D1();
	void OnBlendOut_EE9806F844F4B80C99B6A8AF429D68AA();
	void OnCancel_05995E844724AC31CF7E90AC71CE173C(const struct FGameplayAbilityTargetDataHandle& Data);
	void OnCancel_63F2E00741CD4BB948BC938AE8AA78A3(const struct FGameplayAbilityTargetDataHandle& Data);
	void OnCancelled_D13E6CF94B0258CA7286AA89D67818D1();
	void OnCancelled_EE9806F844F4B80C99B6A8AF429D68AA();
	void OnCompleted_D13E6CF94B0258CA7286AA89D67818D1();
	void OnCompleted_EE9806F844F4B80C99B6A8AF429D68AA();
	void OnInterrupted_D13E6CF94B0258CA7286AA89D67818D1();
	void OnInterrupted_EE9806F844F4B80C99B6A8AF429D68AA();
	void OnSync_05995E844724AC31CF7E90AC71CE173C(const struct FGameplayAbilityTargetDataHandle& Data);
	void OnSync_63F2E00741CD4BB948BC938AE8AA78A3(const struct FGameplayAbilityTargetDataHandle& Data);
	void OnTimeOut_05995E844724AC31CF7E90AC71CE173C(const struct FGameplayAbilityTargetDataHandle& Data);
	void OnTimeOut_63F2E00741CD4BB948BC938AE8AA78A3(const struct FGameplayAbilityTargetDataHandle& Data);
	void OverrideLockShoot(int32 GameOption, bool IsKeyboard);
	void UpdateShootPrep(const struct FGameplayAbilityTargetDataHandle& _context);

	void GetCameraDirection(struct FGameplayAbilityTargetDataHandle* CameraDirection) const;
	struct FGameplayAbilityTargetDataHandle MakeTargetDataPickerForHighShoot() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Shoot_GoalKeeper_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Shoot_GoalKeeper_C")
	}
	static class UGA_Shoot_GoalKeeper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Shoot_GoalKeeper_C>();
	}
};
DUMPER7_ASSERTS_UGA_Shoot_GoalKeeper_C;

}

