#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Shoot

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ShootDataRow_structs.hpp"
#include "Runtime_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SCCore_structs.hpp"


namespace SDK::Params
{

// Function GA_Shoot.GA_Shoot_C.ExecuteUbergraph_GA_Shoot
// 0x0E90 (0x0E90 - 0x0000)
struct GA_Shoot_C_ExecuteUbergraph_GA_Shoot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Data_3;                         // 0x0008(0x0028)(ConstParm)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> K2Node_CreateDelegate_OutputDelegate; // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Data_2;                         // 0x0040(0x0028)(ConstParm)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Data_1;                         // 0x0078(0x0028)(ConstParm)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> K2Node_CreateDelegate_OutputDelegate_2; // 0x00A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Data;                           // 0x00B0(0x0028)(ConstParm)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> K2Node_CreateDelegate_OutputDelegate_3; // 0x00D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x00E8(0x0028)()
	struct FInputGameplayAbilityTargetData        CallFunc_GetTargetDataPure__outData;               // 0x0110(0x0058)()
	bool                                          CallFunc_GetTargetDataPure_ReturnValue;            // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_BPF_GetSlot_ReturnValue;                  // 0x016C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNearlyZero2D_ReturnValue;               // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FShootParamsTargetData                 CallFunc_GetTargetDataPure__outData_1;             // 0x0178(0x0118)()
	bool                                          CallFunc_GetTargetDataPure_ReturnValue_1;          // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0294(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FShootParams                           CallFunc_UpdateShootParamsTags_out_ShootParams;    // 0x02A8(0x0108)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x03B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x03C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x03D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x03E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x03F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0400(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x0410(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_1;                            // 0x0420(0x0028)(ConstParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x0448(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x0458(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_14;           // 0x0468(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_15;           // 0x0478(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_16;           // 0x0488(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_17;           // 0x0498(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_18;           // 0x04A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_19;           // 0x04B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_20;           // 0x04C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_21;           // 0x04D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityExecOrigin                            Temp_byte_Variable;                                // 0x04E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityExecOrigin                            Temp_byte_Variable_1;                              // 0x04EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EB[0x5];                                      // 0x04EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_GetProvidedTargetData__outData;           // 0x04F0(0x0028)()
	class ARuntimeCharacter*                      CallFunc_BPF_GetRuntimeCharacter_ReturnValue;      // 0x0518(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0520(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBotControlled_ReturnValue;              // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_529[0x7];                                      // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCBasePlayerController*                K2Node_DynamicCast_AsSCBase_Player_Controller;     // 0x0530(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0539(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPF_IsControllerTypeKeyBoard_ReturnValue; // 0x053A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x053B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x053C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBotControlled_ReturnValue_1;            // 0x053D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53E[0x2];                                      // 0x053E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_22;           // 0x0540(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_23;           // 0x0550(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_wildcard_Variable;                            // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_561[0x3];                                      // 0x0561(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_24;           // 0x0564(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_574[0x4];                                      // 0x0574(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_GetProvidedTargetData__outData_1;         // 0x0578(0x0028)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_25;           // 0x05A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARuntimeCharacter*                      CallFunc_BPF_GetRuntimeCharacter_ReturnValue_1;    // 0x05B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARuntimeCharacter*                      CallFunc_BPF_GetRuntimeCharacter_ReturnValue_2;    // 0x05B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBotControlled_ReturnValue_2;            // 0x05C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBotControlled_ReturnValue_3;            // 0x05C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C2[0x2];                                      // 0x05C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_26;           // 0x05C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_27;           // 0x05D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E4[0x4];                                      // 0x05E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x05E8(0x00B0)(ConstParm)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_699[0x7];                                      // 0x0699(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputGameplayAbilityTargetData        CallFunc_BPF_FindCurrentInputTargetData__outData;  // 0x06A0(0x0058)()
	bool                                          CallFunc_BPF_FindCurrentInputTargetData_ReturnValue; // 0x06F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F9[0x7];                                      // 0x06F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARuntimeCharacter*                      CallFunc_BPF_GetRuntimeCharacter_ReturnValue_3;    // 0x0700(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRTInputActionsForNetworkSyncShoot     K2Node_MakeStruct_RTInputActionsForNetworkSyncShoot; // 0x0708(0x0018)(NoDestructor)
	class ABall*                                  CallFunc_BPF_GetBallPure_ReturnValue;              // 0x0720(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_GetProvidedTargetData__outData_2;         // 0x0728(0x0028)()
	EAbilityExecOrigin                            Temp_byte_Variable_2;                              // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_751[0xF];                                      // 0x0751(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSequencePlayInfos                 CallFunc_GetTargetDataPure__outData_2;             // 0x0760(0x0130)()
	bool                                          CallFunc_GetTargetDataPure_ReturnValue_2;          // 0x0890(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_891[0x7];                                      // 0x0891(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_GetProvidedTargetData__outData_3;         // 0x0898(0x0028)()
	struct FGameplayTagContainer                  CallFunc_BPF_GetAbilityTags_ReturnValue;           // 0x08C0(0x0020)()
	class UAbilityTask_HandleLooseGameplayTags*   CallFunc_BPF_HandleLooseGameplayTags_ReturnValue;  // 0x08E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle;          // 0x08E8(0x0028)()
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0910(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_911[0x3];                                      // 0x0911(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_28;           // 0x0914(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAbilityExecOrigin                            Temp_byte_Variable_3;                              // 0x0924(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_925[0x3];                                      // 0x0925(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x0928(0x0020)()
	class UAbilityTask_HandleLooseGameplayTags*   CallFunc_BPF_HandleLooseGameplayTags_ReturnValue_1; // 0x0948(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0950(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_951[0x7];                                      // 0x0951(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARuntimeCharacter*                      CallFunc_BPF_GetRuntimeCharacter_ReturnValue_4;    // 0x0958(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_29;           // 0x0960(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTargetingContext                      CallFunc_BPF_SaveActorState__targetingContext;     // 0x0970(0x00E0)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_GetProvidedTargetData__outData_4;         // 0x0A50(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue; // 0x0A78(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue_1; // 0x0AA0(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle_1;        // 0x0AC8(0x0028)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0AF0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BPF_MakeRuntimeGameplayEffectContextHandle__outHandle; // 0x0AF8(0x0018)()
	class ARuntimeCharacter*                      CallFunc_BPF_GetRuntimeCharacter_ReturnValue_5;    // 0x0B10(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_HandleGameplayCue*         CallFunc_BPF_HandleGameplayCue_ReturnValue;        // 0x0B18(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPF_SetBall_ReturnValue;                  // 0x0B20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0B21(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B22[0x6];                                      // 0x0B22(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_HandleLooseGameplayTags*   CallFunc_BPF_HandleLooseGameplayTags_ReturnValue_2; // 0x0B28(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0B30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B31[0x7];                                      // 0x0B31(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSCConditionsToSyncEarly               Temp_struct_Variable_2;                            // 0x0B38(0x0018)(ConstParm, NoDestructor, ContainsInstancedReference)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_1; // 0x0B50(0x0020)()
	class UAbilityTask_HandleLooseGameplayTags*   CallFunc_BPF_HandleLooseGameplayTags_ReturnValue_3; // 0x0B70(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_ApplyShoot*                CallFunc_BPF_ApplyShootTask_ReturnValue;           // 0x0B78(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0B80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0B81(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B82[0x6];                                      // 0x0B82(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0B88(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTargetDatasourceInstance              K2Node_MakeStruct_TargetDatasourceInstance;        // 0x0B90(0x0048)(ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       K2Node_MakeStruct_GameplayAbilityTargetDataHandle; // 0x0BD8(0x0028)()
	struct FOnDemandTargetProvider                K2Node_MakeStruct_OnDemandTargetProvider;          // 0x0C00(0x0058)(ContainsInstancedReference)
	bool                                          CallFunc_BPF_ValidateTarget_ReturnValue;           // 0x0C58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0C59(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0C5A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5B[0x5];                                      // 0x0C5B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ARuntimeCharacter*                      CallFunc_BPF_GetRuntimeCharacter_ReturnValue_6;    // 0x0C60(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCameraComponentThird*                  CallFunc_BPF_GetCameraThird_ReturnValue;           // 0x0C68(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0C70(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C71[0x7];                                      // 0x0C71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URuntimeSaveSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0C78(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URuntimeSaveSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0C80(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0C88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0C89(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityExecOrigin                            Temp_byte_Variable_4;                              // 0x0C8A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityExecOrigin                            Temp_byte_Variable_5;                              // 0x0C8B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C8C[0x4];                                      // 0x0C8C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue_2; // 0x0C90(0x0028)()
	class UAbilityTask_HandleLooseGameplayTags*   CallFunc_BPF_HandleLooseGameplayTags_ReturnValue_4; // 0x0CB8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0CC0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC1[0x7];                                      // 0x0CC1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_GetProvidedTargetData__outData_5;         // 0x0CC8(0x0028)()
	EAbilityExecOrigin                            CallFunc_BPF_SetNamedBoolTargetData__eOut;         // 0x0CF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPF_SetNamedBoolTargetData_ReturnValue;   // 0x0CF1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CF2[0x6];                                      // 0x0CF2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARuntimeCharacter*                      CallFunc_BPF_GetRuntimeCharacter_ReturnValue_7;    // 0x0CF8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BPF_GetVelocityFromTargetingContext_ReturnValue; // 0x0D00(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0D18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D19[0x7];                                      // 0x0D19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0D20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0D28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0D29(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2A[0x6];                                      // 0x0D2A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UAnimSequencePickerSlotContainer> K2Node_Select_Default;                       // 0x0D30(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FRTNetworkSyncShootTimeArg             K2Node_MakeStruct_RTNetworkSyncShootTimeArg;       // 0x0D38(0x0028)()
	EAbilityExecOutputWithValidation              CallFunc_BPF_PickAndPlaySlotMontage__eOut;         // 0x0D60(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D61[0x7];                                      // 0x0D61(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_SCPlaySlotMontageAndWait*  CallFunc_BPF_PickAndPlaySlotMontage_ReturnValue;   // 0x0D68(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_NetworkSyncShootData*      CallFunc_BPF_NetworkSyncShootDataWithInputs_ReturnValue; // 0x0D70(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0D78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0D79(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0D7A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D7B[0x5];                                      // 0x0D7B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UAnimSequencePickerSlotContainer> CallFunc_SelectFinalAnimPicker_Picker;       // 0x0D80(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x0D88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D89[0x3];                                      // 0x0D89(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ABall* _ball, const struct FBounceData& _bounceData, float _fSpeedAtBounce)> K2Node_CreateDelegate_OutputDelegate_30; // 0x0D8C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9C[0x4];                                      // 0x0D9C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URuntimeSaveSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0DA0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARuntimeCharacter*                      CallFunc_BPF_GetRuntimeCharacter_ReturnValue_8;    // 0x0DA8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x0DB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DB1[0x3];                                      // 0x0DB1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BPF_GetGameOptionSavedValue_ReturnValue;  // 0x0DB4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_GetProvidedTargetData__outData_6;         // 0x0DB8(0x0028)()
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0DE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityExecOrigin                            CallFunc_BPF_SetNamedBoolTargetData__eOut_1;       // 0x0DE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPF_SetNamedBoolTargetData_ReturnValue_1; // 0x0DE9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DEA[0x2];                                      // 0x0DEA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0DEC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityExecOrigin                            CallFunc_BPF_SetNamedIntegerTargetData__eOut;      // 0x0DF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DF1[0x3];                                      // 0x0DF1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BPF_SetNamedIntegerTargetData_ReturnValue; // 0x0DF4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0DF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0DF9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x0DFA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityExecOrigin                            Temp_byte_Variable_6;                              // 0x0DFB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityExecOutputWithValidation              CallFunc_BPF_PickAndPlaySlotMontage__eOut_1;       // 0x0DFC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DFD[0x3];                                      // 0x0DFD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_SCPlaySlotMontageAndWait*  CallFunc_BPF_PickAndPlaySlotMontage_ReturnValue_1; // 0x0E00(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x0E08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x0E09(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityExecOrigin                            CallFunc_BPF_SetNamedBoolTargetData__eOut_2;       // 0x0E0A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPF_SetNamedBoolTargetData_ReturnValue_2; // 0x0E0B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0E0C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_5;                    // 0x0E0D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityExecOutputWithValidation              CallFunc_BPF_PickAndPlaySlotMontage__eOut_2;       // 0x0E0E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E0F[0x1];                                      // 0x0E0F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_SCPlaySlotMontageAndWait*  CallFunc_BPF_PickAndPlaySlotMontage_ReturnValue_2; // 0x0E10(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x0E18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_6;                    // 0x0E19(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1A[0x6];                                      // 0x0E1A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0E20(0x0020)()
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x0E40(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0E50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E51[0x7];                                      // 0x0E51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue_3; // 0x0E58(0x0028)()
	double                                        CallFunc_SelectFloat_A_ImplicitCast;               // 0x0E80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Shoot_C_ExecuteUbergraph_GA_Shoot;

// Function GA_Shoot.GA_Shoot_C.InitOverrideComputationForKeyBoard
// 0x0158 (0x0158 - 0x0000)
struct GA_Shoot_C_InitOverrideComputationForKeyBoard final
{
public:
	bool                                          IsKeyBoardController;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOverrideDirectionComputationTargetData K2Node_MakeStruct_OverrideDirectionComputationTargetData; // 0x0008(0x0018)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle;          // 0x0020(0x0028)()
	struct FOverrideRotationForceComputationTargetData K2Node_MakeStruct_OverrideRotationForceComputationTargetData; // 0x0048(0x0018)()
	struct FOverrideRotationForceComputationTargetData K2Node_MakeStruct_OverrideRotationForceComputationTargetData_1; // 0x0060(0x0018)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle_1;        // 0x0078(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle_2;        // 0x00A0(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue; // 0x00C8(0x0028)()
	struct FOverrideDirectionComputationTargetData K2Node_MakeStruct_OverrideDirectionComputationTargetData_1; // 0x00F0(0x0018)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle_3;        // 0x0108(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue_1; // 0x0130(0x0028)()
};
DUMPER7_ASSERTS_GA_Shoot_C_InitOverrideComputationForKeyBoard;

// Function GA_Shoot.GA_Shoot_C.InitTargetDatasAndConfiguration
// 0x0530 (0x0530 - 0x0000)
struct GA_Shoot_C_InitTargetDatasAndConfiguration final
{
public:
	struct FVector                                LocalCamDir;                                       // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       LocalCommunTargetData;                             // 0x0018(0x0028)(Edit, BlueprintVisible)
	class ARuntimeCharacter*                      CallFunc_BPF_GetRuntimeCharacter_ReturnValue;      // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USCCameraComponent*                     CallFunc_BPF_GetSCCamera_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FNamedVectorNormalizedTargetData       K2Node_MakeStruct_NamedVectorNormalizedTargetData; // 0x0050(0x0030)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle;          // 0x0088(0x0028)()
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue; // 0x00E0(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_GetProvidedTargetData__outData;           // 0x0108(0x0028)()
	struct FSimulatedShootData                    CallFunc_GetTargetData__outData;                   // 0x0130(0x0070)()
	bool                                          CallFunc_GetTargetData_ReturnValue;                // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue;        // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARuntimeCharacter*                      CallFunc_BPF_GetRuntimeCharacter_ReturnValue_1;    // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue_1; // 0x01D0(0x0028)()
	struct FVector                                CallFunc_BPF_GetVelocityFromTargetingContext_ReturnValue; // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetData_Direction   K2Node_MakeStruct_GameplayAbilityTargetData_Direction; // 0x0210(0x0030)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle_1;        // 0x0248(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue_2; // 0x0270(0x0028)()
	class ARuntimeCharacter*                      CallFunc_BPF_GetRuntimeCharacter_ReturnValue_2;    // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue_3; // 0x02A0(0x0028)()
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  CallFunc_BPF_GetForwardFromTargetingContext_ReturnValue; // 0x02D0(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Quat_VectorForward_ReturnValue;           // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARuntimeCharacter*                      CallFunc_BPF_GetRuntimeCharacter_ReturnValue_3;    // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetData_Direction   K2Node_MakeStruct_GameplayAbilityTargetData_Direction_1; // 0x0310(0x0030)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle_2;        // 0x0340(0x0028)()
	class ABall*                                  CallFunc_BPF_GetBallPure_ReturnValue;              // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue_4; // 0x0370(0x0028)()
	uint8                                         Pad_398[0x8];                                      // 0x0398(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActorLocationTargetData               CallFunc_BPF_MakeActorLocationTargetDataFromActor__result; // 0x03A0(0x0110)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle_3;        // 0x04B0(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle_4;        // 0x04D8(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue_5; // 0x0500(0x0028)()
};
DUMPER7_ASSERTS_GA_Shoot_C_InitTargetDatasAndConfiguration;

// Function GA_Shoot.GA_Shoot_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Shoot_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_GA_Shoot_C_K2_ActivateAbilityFromEvent;

// Function GA_Shoot.GA_Shoot_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Shoot_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Shoot_C_K2_OnEndAbility;

// Function GA_Shoot.GA_Shoot_C.m_BuildClientPayload_2AA78B3F4B3D61AEE19D01A27D33DB17
// 0x0028 (0x0028 - 0x0000)
struct GA_Shoot_C_m_BuildClientPayload_2AA78B3F4B3D61AEE19D01A27D33DB17 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Data;                                              // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_GA_Shoot_C_m_BuildClientPayload_2AA78B3F4B3D61AEE19D01A27D33DB17;

// Function GA_Shoot.GA_Shoot_C.OnCancel_2AA78B3F4B3D61AEE19D01A27D33DB17
// 0x0028 (0x0028 - 0x0000)
struct GA_Shoot_C_OnCancel_2AA78B3F4B3D61AEE19D01A27D33DB17 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Data;                                              // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_GA_Shoot_C_OnCancel_2AA78B3F4B3D61AEE19D01A27D33DB17;

// Function GA_Shoot.GA_Shoot_C.OnSync_2AA78B3F4B3D61AEE19D01A27D33DB17
// 0x0028 (0x0028 - 0x0000)
struct GA_Shoot_C_OnSync_2AA78B3F4B3D61AEE19D01A27D33DB17 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Data;                                              // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_GA_Shoot_C_OnSync_2AA78B3F4B3D61AEE19D01A27D33DB17;

// Function GA_Shoot.GA_Shoot_C.OnTimeOut_2AA78B3F4B3D61AEE19D01A27D33DB17
// 0x0028 (0x0028 - 0x0000)
struct GA_Shoot_C_OnTimeOut_2AA78B3F4B3D61AEE19D01A27D33DB17 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Data;                                              // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_GA_Shoot_C_OnTimeOut_2AA78B3F4B3D61AEE19D01A27D33DB17;

// Function GA_Shoot.GA_Shoot_C.OverrideLockShoot
// 0x0008 (0x0008 - 0x0000)
struct GA_Shoot_C_OverrideLockShoot final
{
public:
	int32                                         GameOption;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsKeyboard;                                        // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Shoot_C_OverrideLockShoot;

// Function GA_Shoot.GA_Shoot_C.UpdateShootParamsTags
// 0x0218 (0x0218 - 0x0000)
struct GA_Shoot_C_UpdateShootParamsTags final
{
public:
	struct FShootParams                           in_ShootParams;                                    // 0x0000(0x0108)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FShootParams                           out_ShootParams;                                   // 0x0108(0x0108)(Parm, OutParm)
	struct FGameplayTag                           CallFunc_DefineShootType_ShootType;                // 0x0210(0x0008)(NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Shoot_C_UpdateShootParamsTags;

// Function GA_Shoot.GA_Shoot_C.UpdateShootPrep
// 0x0118 (0x0118 - 0x0000)
struct GA_Shoot_C_UpdateShootPrep final
{
public:
	struct FGameplayAbilityTargetDataHandle       _context;                                          // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class ARuntimeCharacter*                      CallFunc_BPF_GetRuntimeCharacter_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABall*                                  CallFunc_BPF_GetBallPure_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FShootPrepTargetData                   CallFunc_BPF_MakePrepTargetDataFromClass_ReturnValue; // 0x0038(0x00E0)(ContainsInstancedReference)
};
DUMPER7_ASSERTS_GA_Shoot_C_UpdateShootPrep;

// Function GA_Shoot.GA_Shoot_C.DefineShootType
// 0x0140 (0x0140 - 0x0000)
struct GA_Shoot_C_DefineShootType final
{
public:
	struct FShootParams                           ShootParams_0;                                     // 0x0000(0x0108)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FGameplayTag                           ShootType;                                         // 0x0108(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	struct FShootDataRow                          CallFunc_GetDataTableRowFromNamePure_OutRow;       // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromNamePure_ReturnValue;  // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Shoot_C_DefineShootType;

// Function GA_Shoot.GA_Shoot_C.SelectFinalAnimPicker
// 0x0120 (0x0120 - 0x0000)
struct GA_Shoot_C_SelectFinalAnimPicker final
{
public:
	struct FShootParams                           ShootParams_0;                                     // 0x0000(0x0108)(BlueprintVisible, BlueprintReadOnly, Parm)
	TSubclassOf<class UAnimSequencePickerSlotContainer> Picker;                                      // 0x0108(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_DefineShootType_ShootType;                // 0x0110(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Shoot_C_SelectFinalAnimPicker;

}

