#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Shoot_GoalKeeper

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Runtime_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "SCCore_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Shoot_GoalKeeper.GA_Shoot_GoalKeeper_C.ExecuteUbergraph_GA_Shoot_GoalKeeper
// 0x1290 (0x1290 - 0x0000)
struct GA_Shoot_GoalKeeper_C_ExecuteUbergraph_GA_Shoot_GoalKeeper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityExecOrigin                            Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> K2Node_CreateDelegate_OutputDelegate; // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URuntimeSaveSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAbilityExecOrigin                            Temp_byte_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BPF_GetGameOptionSavedValue_ReturnValue;  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URuntimeSaveSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URuntimeSaveSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x0048(0x0028)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0084(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Data_3;                         // 0x0098(0x0028)(ConstParm)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> K2Node_CreateDelegate_OutputDelegate_3; // 0x00C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Data_2;                         // 0x00D0(0x0028)(ConstParm)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> K2Node_CreateDelegate_OutputDelegate_4; // 0x00F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Data_1;                         // 0x0108(0x0028)(ConstParm)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> K2Node_CreateDelegate_OutputDelegate_5; // 0x0130(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Data;                           // 0x0140(0x0028)(ConstParm)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> K2Node_CreateDelegate_OutputDelegate_6; // 0x0168(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_1;                            // 0x0178(0x0028)()
	struct FShootParamsTargetData                 CallFunc_GetTargetDataPure__outData;               // 0x01A0(0x0118)()
	bool                                          CallFunc_GetTargetDataPure_ReturnValue;            // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNetworkSyncTargetData                 CallFunc_GetTargetDataPure__outData_1;             // 0x02C0(0x01F0)()
	bool                                          CallFunc_GetTargetDataPure_ReturnValue_1;          // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1[0xF];                                      // 0x04B1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSequencePlayInfos                 CallFunc_GetTargetDataPure__outData_2;             // 0x04C0(0x0130)()
	bool                                          CallFunc_GetTargetDataPure_ReturnValue_2;          // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F1[0x3];                                      // 0x05F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x05F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0604(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0614(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0624(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x0634(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x0644(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x0654(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_14;           // 0x0664(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_674[0x4];                                      // 0x0674(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRTNetworkSyncShootTimeArg             K2Node_MakeStruct_RTNetworkSyncShootTimeArg;       // 0x0680(0x0028)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_15;           // 0x06A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle;          // 0x06B8(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue; // 0x06E0(0x0028)()
	struct FSCGameplayAbilitySingleTargetData     K2Node_MakeStruct_SCGameplayAbilitySingleTargetData; // 0x0708(0x0018)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle_1;        // 0x0720(0x0028)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_16;           // 0x0748(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue_1; // 0x0758(0x0028)()
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Data_7;                         // 0x0780(0x0028)(ConstParm)
	struct FGameplayTagContainer                  CallFunc_BPF_GetAbilityTags_ReturnValue;           // 0x07A8(0x0020)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle_2;        // 0x07C8(0x0028)()
	struct FGameplayEffectContextHandle           CallFunc_BPF_MakeRuntimeGameplayEffectContextHandle__outHandle; // 0x07F0(0x0018)()
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> K2Node_CreateDelegate_OutputDelegate_17; // 0x0808(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_HandleGameplayCue*         CallFunc_BPF_HandleGameplayCue_ReturnValue;        // 0x0818(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_GetProvidedTargetData__outData;           // 0x0820(0x0028)()
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0848(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_849[0x7];                                      // 0x0849(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARuntimeCharacter*                      CallFunc_BPF_GetRuntimeCharacter_ReturnValue;      // 0x0850(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0858(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBotControlled_ReturnValue;              // 0x0860(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_861[0x7];                                      // 0x0861(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCBasePlayerController*                K2Node_DynamicCast_AsSCBase_Player_Controller;     // 0x0868(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0870(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0871(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPF_IsControllerTypeKeyBoard_ReturnValue; // 0x0872(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0873(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0874(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBotControlled_ReturnValue_1;            // 0x0875(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_876[0x2];                                      // 0x0876(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_18;           // 0x0878(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_19;           // 0x0888(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_20;           // 0x0898(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_wildcard_Variable;                            // 0x08A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityExecOrigin                            CallFunc_BPF_SetNamedBoolTargetData__eOut;         // 0x08A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPF_SetNamedBoolTargetData_ReturnValue;   // 0x08AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8AB[0x1];                                      // 0x08AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_21;           // 0x08AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x08BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x08BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8BE[0x2];                                      // 0x08BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_GetProvidedTargetData__outData_1;         // 0x08C0(0x0028)()
	EAbilityExecOrigin                            CallFunc_BPF_SetNamedIntegerTargetData__eOut;      // 0x08E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E9[0x3];                                      // 0x08E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BPF_SetNamedIntegerTargetData_ReturnValue; // 0x08EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARuntimeCharacter*                      CallFunc_BPF_GetRuntimeCharacter_ReturnValue_1;    // 0x08F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBotControlled_ReturnValue_2;            // 0x08F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x08F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8FA[0x6];                                      // 0x08FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARuntimeCharacter*                      CallFunc_BPF_GetRuntimeCharacter_ReturnValue_2;    // 0x0900(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBotControlled_ReturnValue_3;            // 0x0908(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_909[0x3];                                      // 0x0909(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_22;           // 0x090C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_23;           // 0x091C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92C[0x4];                                      // 0x092C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0930(0x00B0)(ConstParm)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x09E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle_3;        // 0x09E8(0x0028)()
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0A10(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTargetDatasourceInstance              K2Node_MakeStruct_TargetDatasourceInstance;        // 0x0A18(0x0048)(ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       K2Node_MakeStruct_GameplayAbilityTargetDataHandle; // 0x0A60(0x0028)()
	struct FOnDemandTargetProvider                K2Node_MakeStruct_OnDemandTargetProvider;          // 0x0A88(0x0058)(ContainsInstancedReference)
	class ARuntimeCharacter*                      CallFunc_BPF_GetRuntimeCharacter_ReturnValue_3;    // 0x0AE0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPF_ValidateTarget_ReturnValue;           // 0x0AE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPF_SetBall_ReturnValue;                  // 0x0AE9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityExecOrigin                            Temp_byte_Variable_2;                              // 0x0AEA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AEB[0x5];                                      // 0x0AEB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_HandleLooseGameplayTags*   CallFunc_BPF_HandleLooseGameplayTags_ReturnValue;  // 0x0AF0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0AF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AF9[0x7];                                      // 0x0AF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x0B00(0x0020)()
	class UAbilityTask_HandleLooseGameplayTags*   CallFunc_BPF_HandleLooseGameplayTags_ReturnValue_1; // 0x0B20(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0B28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B29[0x7];                                      // 0x0B29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_ApplyShoot*                CallFunc_BPF_ApplyShootTask_ReturnValue;           // 0x0B30(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0B38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0B39(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B3A[0x6];                                      // 0x0B3A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARuntimeCharacter*                      CallFunc_BPF_GetRuntimeCharacter_ReturnValue_4;    // 0x0B40(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABall*                                  CallFunc_BPF_GetBallPure_ReturnValue;              // 0x0B48(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARuntimeCharacter*                      CallFunc_BPF_GetRuntimeCharacter_ReturnValue_5;    // 0x0B50(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B58[0x8];                                      // 0x0B58(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTargetingContext                      CallFunc_BPF_SaveActorState__targetingContext;     // 0x0B60(0x00E0)()
	class UAbilityTask_HandleLooseGameplayTags*   CallFunc_BPF_HandleLooseGameplayTags_ReturnValue_2; // 0x0C40(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0C48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C49[0x7];                                      // 0x0C49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_GetProvidedTargetData__outData_2;         // 0x0C50(0x0028)()
	uint8                                         Pad_C78[0x8];                                      // 0x0C78(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSequencePlayInfos                 CallFunc_GetTargetDataPure__outData_3;             // 0x0C80(0x0130)()
	bool                                          CallFunc_GetTargetDataPure_ReturnValue_3;          // 0x0DB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DB1[0x7];                                      // 0x0DB1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle_4;        // 0x0DB8(0x0028)()
	EAbilityExecOrigin                            Temp_byte_Variable_3;                              // 0x0DE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityExecOutputWithValidation              CallFunc_BPF_PickAndPlaySlotMontage__eOut;         // 0x0DE1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DE2[0x6];                                      // 0x0DE2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_SCPlaySlotMontageAndWait*  CallFunc_BPF_PickAndPlaySlotMontage_ReturnValue;   // 0x0DE8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0DF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0DF1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DF2[0x6];                                      // 0x0DF2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSCConditionsToSyncEarly               K2Node_MakeStruct_SCConditionsToSyncEarly;         // 0x0DF8(0x0018)(NoDestructor, ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle_5;        // 0x0E10(0x0028)()
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_2;                            // 0x0E38(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineOrReplaceTargetData_ReturnValue; // 0x0E60(0x0028)()
	struct FShootParamsTargetData                 CallFunc_GetTargetDataPure__outData_4;             // 0x0E88(0x0118)()
	bool                                          CallFunc_GetTargetDataPure_ReturnValue_4;          // 0x0FA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA1[0x7];                                      // 0x0FA1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Data_4;                         // 0x0FA8(0x0028)(ConstParm)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Data_5;                         // 0x0FD0(0x0028)(ConstParm)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> K2Node_CreateDelegate_OutputDelegate_24; // 0x0FF8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputGameplayAbilityTargetData        CallFunc_BPF_FindCurrentInputTargetData__outData;  // 0x1008(0x0058)()
	bool                                          CallFunc_BPF_FindCurrentInputTargetData_ReturnValue; // 0x1060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1061[0x7];                                     // 0x1061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRTInputActionsForNetworkSyncShoot     K2Node_MakeStruct_RTInputActionsForNetworkSyncShoot; // 0x1068(0x0018)(NoDestructor)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> K2Node_CreateDelegate_OutputDelegate_25; // 0x1080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataPickerForHighShoot_ReturnValue; // 0x1090(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_GetProvidedTargetData__outData_3;         // 0x10B8(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_GetProvidedTargetData__outData_4;         // 0x10E0(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue_2; // 0x1108(0x0028)()
	struct FRTNetworkSyncShootTimeArg             K2Node_MakeStruct_RTNetworkSyncShootTimeArg_1;     // 0x1130(0x0028)()
	EAbilityExecOutputWithValidation              CallFunc_BPF_PickAndPlaySlotMontage__eOut_1;       // 0x1158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1159[0x7];                                     // 0x1159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_SCPlaySlotMontageAndWait*  CallFunc_BPF_PickAndPlaySlotMontage_ReturnValue_1; // 0x1160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_NetworkSyncShootData*      CallFunc_BPF_NetworkSyncShootDataWithInputs_ReturnValue; // 0x1168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x1170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x1171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1172[0x2];                                     // 0x1172(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_BPF_GetSlot_ReturnValue;                  // 0x1174(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x117C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_117D[0x3];                                     // 0x117D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSCConditionsToSyncEarly               Temp_struct_Variable_3;                            // 0x1180(0x0018)(ConstParm, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x1198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1199[0x7];                                     // 0x1199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_1; // 0x11A0(0x0020)()
	class UAbilityTask_HandleLooseGameplayTags*   CallFunc_BPF_HandleLooseGameplayTags_ReturnValue_3; // 0x11C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ARuntimeCharacter*                      CallFunc_BPF_GetRuntimeCharacter_ReturnValue_6;    // 0x11C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCameraComponentThird*                  CallFunc_BPF_GetCameraThird_ReturnValue;           // 0x11D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x11D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x11D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x11DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11DB[0x5];                                     // 0x11DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_Data_6;                         // 0x11E0(0x0028)(ConstParm)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x1208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1209[0x3];                                     // 0x1209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ABall* _ball, const struct FBounceData& _bounceData, float _fSpeedAtBounce)> K2Node_CreateDelegate_OutputDelegate_26; // 0x120C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121C[0x4];                                     // 0x121C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue_3; // 0x1220(0x0028)()
	struct FSCNetworkSyncData                     Temp_struct_Variable_4;                            // 0x1248(0x0010)(ConstParm)
	class UAbilityTask_NetworkSyncShootData*      CallFunc_BPF_NetworkSyncShootDataWithInputs_ReturnValue_1; // 0x1258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x1260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1261[0x7];                                     // 0x1261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_A_ImplicitCast;               // 0x1268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x1270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x1278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_m_fCatchupShootTime_ImplicitCast; // 0x1280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Shoot_GoalKeeper_C_ExecuteUbergraph_GA_Shoot_GoalKeeper;

// Function GA_Shoot_GoalKeeper.GA_Shoot_GoalKeeper_C.InitOverrideComputationForKeyBoard
// 0x0158 (0x0158 - 0x0000)
struct GA_Shoot_GoalKeeper_C_InitOverrideComputationForKeyBoard final
{
public:
	bool                                          IsKeyBoardController;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOverrideDirectionComputationTargetData K2Node_MakeStruct_OverrideDirectionComputationTargetData; // 0x0008(0x0018)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle;          // 0x0020(0x0028)()
	struct FOverrideRotationForceComputationTargetData K2Node_MakeStruct_OverrideRotationForceComputationTargetData; // 0x0048(0x0018)()
	struct FOverrideRotationForceComputationTargetData K2Node_MakeStruct_OverrideRotationForceComputationTargetData_1; // 0x0060(0x0018)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle_1;        // 0x0078(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle_2;        // 0x00A0(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue; // 0x00C8(0x0028)()
	struct FOverrideDirectionComputationTargetData K2Node_MakeStruct_OverrideDirectionComputationTargetData_1; // 0x00F0(0x0018)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle_3;        // 0x0108(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue_1; // 0x0130(0x0028)()
};
DUMPER7_ASSERTS_GA_Shoot_GoalKeeper_C_InitOverrideComputationForKeyBoard;

// Function GA_Shoot_GoalKeeper.GA_Shoot_GoalKeeper_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Shoot_GoalKeeper_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_GA_Shoot_GoalKeeper_C_K2_ActivateAbilityFromEvent;

// Function GA_Shoot_GoalKeeper.GA_Shoot_GoalKeeper_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Shoot_GoalKeeper_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Shoot_GoalKeeper_C_K2_OnEndAbility;

// Function GA_Shoot_GoalKeeper.GA_Shoot_GoalKeeper_C.m_BuildClientPayload_05995E844724AC31CF7E90AC71CE173C
// 0x0028 (0x0028 - 0x0000)
struct GA_Shoot_GoalKeeper_C_m_BuildClientPayload_05995E844724AC31CF7E90AC71CE173C final
{
public:
	struct FGameplayAbilityTargetDataHandle       Data;                                              // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_GA_Shoot_GoalKeeper_C_m_BuildClientPayload_05995E844724AC31CF7E90AC71CE173C;

// Function GA_Shoot_GoalKeeper.GA_Shoot_GoalKeeper_C.m_BuildClientPayload_63F2E00741CD4BB948BC938AE8AA78A3
// 0x0028 (0x0028 - 0x0000)
struct GA_Shoot_GoalKeeper_C_m_BuildClientPayload_63F2E00741CD4BB948BC938AE8AA78A3 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Data;                                              // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_GA_Shoot_GoalKeeper_C_m_BuildClientPayload_63F2E00741CD4BB948BC938AE8AA78A3;

// Function GA_Shoot_GoalKeeper.GA_Shoot_GoalKeeper_C.OnCancel_05995E844724AC31CF7E90AC71CE173C
// 0x0028 (0x0028 - 0x0000)
struct GA_Shoot_GoalKeeper_C_OnCancel_05995E844724AC31CF7E90AC71CE173C final
{
public:
	struct FGameplayAbilityTargetDataHandle       Data;                                              // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_GA_Shoot_GoalKeeper_C_OnCancel_05995E844724AC31CF7E90AC71CE173C;

// Function GA_Shoot_GoalKeeper.GA_Shoot_GoalKeeper_C.OnCancel_63F2E00741CD4BB948BC938AE8AA78A3
// 0x0028 (0x0028 - 0x0000)
struct GA_Shoot_GoalKeeper_C_OnCancel_63F2E00741CD4BB948BC938AE8AA78A3 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Data;                                              // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_GA_Shoot_GoalKeeper_C_OnCancel_63F2E00741CD4BB948BC938AE8AA78A3;

// Function GA_Shoot_GoalKeeper.GA_Shoot_GoalKeeper_C.OnSync_05995E844724AC31CF7E90AC71CE173C
// 0x0028 (0x0028 - 0x0000)
struct GA_Shoot_GoalKeeper_C_OnSync_05995E844724AC31CF7E90AC71CE173C final
{
public:
	struct FGameplayAbilityTargetDataHandle       Data;                                              // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_GA_Shoot_GoalKeeper_C_OnSync_05995E844724AC31CF7E90AC71CE173C;

// Function GA_Shoot_GoalKeeper.GA_Shoot_GoalKeeper_C.OnSync_63F2E00741CD4BB948BC938AE8AA78A3
// 0x0028 (0x0028 - 0x0000)
struct GA_Shoot_GoalKeeper_C_OnSync_63F2E00741CD4BB948BC938AE8AA78A3 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Data;                                              // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_GA_Shoot_GoalKeeper_C_OnSync_63F2E00741CD4BB948BC938AE8AA78A3;

// Function GA_Shoot_GoalKeeper.GA_Shoot_GoalKeeper_C.OnTimeOut_05995E844724AC31CF7E90AC71CE173C
// 0x0028 (0x0028 - 0x0000)
struct GA_Shoot_GoalKeeper_C_OnTimeOut_05995E844724AC31CF7E90AC71CE173C final
{
public:
	struct FGameplayAbilityTargetDataHandle       Data;                                              // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_GA_Shoot_GoalKeeper_C_OnTimeOut_05995E844724AC31CF7E90AC71CE173C;

// Function GA_Shoot_GoalKeeper.GA_Shoot_GoalKeeper_C.OnTimeOut_63F2E00741CD4BB948BC938AE8AA78A3
// 0x0028 (0x0028 - 0x0000)
struct GA_Shoot_GoalKeeper_C_OnTimeOut_63F2E00741CD4BB948BC938AE8AA78A3 final
{
public:
	struct FGameplayAbilityTargetDataHandle       Data;                                              // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_GA_Shoot_GoalKeeper_C_OnTimeOut_63F2E00741CD4BB948BC938AE8AA78A3;

// Function GA_Shoot_GoalKeeper.GA_Shoot_GoalKeeper_C.OverrideLockShoot
// 0x0008 (0x0008 - 0x0000)
struct GA_Shoot_GoalKeeper_C_OverrideLockShoot final
{
public:
	int32                                         GameOption;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsKeyboard;                                        // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Shoot_GoalKeeper_C_OverrideLockShoot;

// Function GA_Shoot_GoalKeeper.GA_Shoot_GoalKeeper_C.UpdateShootPrep
// 0x0118 (0x0118 - 0x0000)
struct GA_Shoot_GoalKeeper_C_UpdateShootPrep final
{
public:
	struct FGameplayAbilityTargetDataHandle       _context;                                          // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class ARuntimeCharacter*                      CallFunc_BPF_GetRuntimeCharacter_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABall*                                  CallFunc_BPF_GetBallPure_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FShootPrepTargetData                   CallFunc_BPF_MakePrepTargetDataFromClass_ReturnValue; // 0x0038(0x00E0)(ContainsInstancedReference)
};
DUMPER7_ASSERTS_GA_Shoot_GoalKeeper_C_UpdateShootPrep;

// Function GA_Shoot_GoalKeeper.GA_Shoot_GoalKeeper_C.GetCameraDirection
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Shoot_GoalKeeper_C_GetCameraDirection final
{
public:
	struct FGameplayAbilityTargetDataHandle       CameraDirection;                                   // 0x0000(0x0028)(Parm, OutParm)
	class ARuntimeCharacter*                      CallFunc_BPF_GetRuntimeCharacter_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USCCameraComponent*                     CallFunc_BPF_GetSCCamera_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_AbilityTargetDataFromDirection_ReturnValue; // 0x0088(0x0028)()
};
DUMPER7_ASSERTS_GA_Shoot_GoalKeeper_C_GetCameraDirection;

// Function GA_Shoot_GoalKeeper.GA_Shoot_GoalKeeper_C.MakeTargetDataPickerForHighShoot
// 0x0220 (0x0220 - 0x0000)
struct GA_Shoot_GoalKeeper_C_MakeTargetDataPickerForHighShoot final
{
public:
	struct FGameplayAbilityTargetDataHandle       ReturnValue;                                       // 0x0000(0x0028)(Parm, OutParm, ReturnParm)
	class ARuntimeCharacter*                      CallFunc_BPF_GetRuntimeCharacter_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle;          // 0x0030(0x0028)()
	class ABall*                                  CallFunc_BPF_GetBallPure_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_GetCameraDirection_CameraDirection;       // 0x0060(0x0028)()
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActorLocationTargetData               CallFunc_BPF_MakeActorLocationTargetDataFromActor__result; // 0x0090(0x0110)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue; // 0x01A0(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle_1;        // 0x01C8(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue_1; // 0x01F0(0x0028)()
};
DUMPER7_ASSERTS_GA_Shoot_GoalKeeper_C_MakeTargetDataPickerForHighShoot;

}

