#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Sprint

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Runtime_structs.hpp"
#include "Runtime_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Sprint.GA_Sprint_C
// 0x0250 (0x08A8 - 0x0658)
class UGA_Sprint_C : public URuntimeGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0658(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<double>                                LevelIncreaseTimers;                               // 0x0660(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	int32                                         TimerIndex;                                        // 0x0670(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ActivateFreeBallMode;                              // 0x0674(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_675[0x3];                                      // 0x0675(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DelayBeforeBallRelease;                            // 0x0678(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67C[0x4];                                      // 0x067C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Shoot_Ability_Data;                                // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           BallReleaseTimer;                                  // 0x0688(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	TArray<class UAbilityTask*>                   ActiveStateTasks;                                  // 0x0690(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, AdvancedDisplay)
	class ABall*                                  Ball;                                              // 0x06A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          IsInActive;                                        // 0x06A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_6A9[0x3];                                      // 0x06A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            StaminaMaintenance;                                // 0x06AC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B4[0x4];                                      // 0x06B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         SprintCostPeriod;                                  // 0x06B8(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference)
	struct FGameplayTagContainer                  ShootTagContainer;                                 // 0x06F0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         MinimumSprintDuration;                             // 0x0710(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_714[0x4];                                      // 0x0714(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 MaintenanceCost;                                   // 0x0718(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         HandleFreeBallModeAL;                              // 0x0720(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_724[0x4];                                      // 0x0724(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FShootParams                           ShootParams;                                       // 0x0728(0x0108)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSubclassOf<class UTrajectoryStatus>>  Trajectory_Status;                                 // 0x0830(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Target_Data_Network_Time_Margin;                   // 0x0840(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Target_Data_Network_Tolerance_Margin;              // 0x0844(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UAnimSequencePickerSlotContainer> Picker;                                      // 0x0848(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       AnimSequenceTargetData;                            // 0x0850(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  SprintBonusTag;                                    // 0x0878(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly)
	int32                                         ALRemoveShootId;                                   // 0x0898(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89C[0x4];                                      // 0x089C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UTagAvailabilityLayerContainer> RemoveShootAL;                                 // 0x08A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void CommitExecuteWithoutCue();
	void ExecuteUbergraph_GA_Sprint(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_CommitExecute();
	void K2_OnEndAbility(bool bWasCancelled);
	void m_BuildClientHitboxPayload_C1E4DACD45298B24195AF8AFF010B518(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget);
	void m_BuildClientPayload_A49F64E54C83DABE182D1CAE54A78543(const struct FGameplayAbilityTargetDataHandle& Data);
	void m_OnCanMoveInterrupt_92B162C24649FC480DD3D294D39B6749();
	void m_OnHit_C1E4DACD45298B24195AF8AFF010B518(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget);
	void m_OnHitRecovery_C1E4DACD45298B24195AF8AFF010B518(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget);
	void m_OnHitRejected_C1E4DACD45298B24195AF8AFF010B518(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget);
	void m_OnHitValidated_C1E4DACD45298B24195AF8AFF010B518(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget);
	void m_OnMoveInterrupt_92B162C24649FC480DD3D294D39B6749();
	void m_OnShoot_079862044EDAAD97900C05A0E311862B();
	void m_OnShootCanceled_079862044EDAAD97900C05A0E311862B();
	void m_OnTrigger_D488C9BC4800CF560ED45980DB23B51C(const struct FInputActionState& _state, bool _bActivated);
	void m_OnValidNullMontageChosen_92B162C24649FC480DD3D294D39B6749();
	void OnBlendedIn_92B162C24649FC480DD3D294D39B6749();
	void OnBlendOut_92B162C24649FC480DD3D294D39B6749();
	void OnCancel_A49F64E54C83DABE182D1CAE54A78543(const struct FGameplayAbilityTargetDataHandle& Data);
	void OnCancelled_92B162C24649FC480DD3D294D39B6749();
	void OnCompleted_92B162C24649FC480DD3D294D39B6749();
	void OnFailure_10860FD6401F18B77B6473B69A49140C();
	void OnFinish_40E7747C48A4151E65355F9106011C38();
	void OnFinish_EFB2472A43F42939B57E9CAC80F6F43C();
	void OnInterrupted_92B162C24649FC480DD3D294D39B6749();
	void OnSync_A49F64E54C83DABE182D1CAE54A78543(const struct FGameplayAbilityTargetDataHandle& Data);
	void OnSync_C505BB974C7CDC15BF23ED911C06A0DD();
	void OnSync_D71A81984C7BAE3E5DDF77B19816CCB4();
	void OnTimeOut_A49F64E54C83DABE182D1CAE54A78543(const struct FGameplayAbilityTargetDataHandle& Data);
	void PopRemoveShootAL();
	void Removed_9A92C1B549BDBA0D0679C5A58F5341AF();
	void StopFreeballMode();

	void GetInputInfosForWatchInputTask(class USCInputAction** InputAction, struct FInputGameplayAbilityTargetData* InputTargetData) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Sprint_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Sprint_C")
	}
	static class UGA_Sprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Sprint_C>();
	}
};
DUMPER7_ASSERTS_UGA_Sprint_C;

}

