#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Tap

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "GA_BaseShoot_classes.hpp"
#include "SCCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Tap.GA_Tap_C
// 0x0120 (0x0EE0 - 0x0DC0)
class UGA_Tap_C : public UGA_BaseShoot_C
{
public:
	uint8                                         Pad_DB1[0x7];                                      // 0x0DB1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Tap_C;                           // 0x0DB8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Min_Time_Before_Sync;                              // 0x0DC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC4[0x4];                                      // 0x0DC4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         Status;                                            // 0x0DC8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USCInputAction*                         IADirection;                                       // 0x0DD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UAnimSequencePicker>        BuildUpPicker;                                     // 0x0DE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UAnimSequencePicker>        ShootPicker;                                       // 0x0DE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FVector                                ShootLocation;                                     // 0x0DF0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TraceDuration;                                     // 0x0E08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDrawDebugTrace                               TraceDisplayType;                                  // 0x0E10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E11[0x7];                                      // 0x0E11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveVector*                           DistanceByTimeMinMaxCurve;                         // 0x0E18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CameraShake;                                       // 0x0E20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_SCPlayMontageAndWait*      BuildUpTask;                                       // 0x0E28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FSCNetworkSyncData                     SCNetworkSyncData;                                 // 0x0E30(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ABall*                                  Ball;                                              // 0x0E40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          IsNotMoving;                                       // 0x0E48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          IsInLockMove;                                      // 0x0E49(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_E4A[0x6];                                      // 0x0E4A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       TargetDatasToPickAnim;                             // 0x0E50(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, AdvancedDisplay)
	class UBasicMontagePlayerConfiguration*       Override_BuildUp_Configuration;                    // 0x0E78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UBasicMontagePlayerConfiguration*       Override_Final_Configuration;                      // 0x0E80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	double                                        AngleNoLook;                                       // 0x0E88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           NoLookTag;                                         // 0x0E90(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       OverrideComputation;                               // 0x0E98(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 Joystick_Emulation_Computation;                    // 0x0EC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Directional_Aiming_Computation;                    // 0x0EC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Crosshair_Only_Computation;                        // 0x0ED0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           TapLockCamTag;                                     // 0x0ED8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BPE_BuildPayload();
	void Debug_AimAssist();
	void Debug_CustomLineTrace(const struct FVector& EndDirection, const struct FLinearColor& TraceColor);
	void Debug_TraceAngleRangeByDotProduct(double DotProductMax, const struct FVector& StartLocation, const struct FLinearColor& TraceColor);
	void ExecuteUbergraph_GA_Tap(int32 EntryPoint);
	void InitTargetDatasAndConfiguration();
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void m_BuildClientPayload_A76C2BDB40C8FAF11D21FB83067CC730(const struct FGameplayAbilityTargetDataHandle& Data);
	void m_OnCanMoveInterrupt_87CE8DC94F37FCA1023BD19C173FE988();
	void m_OnCanMoveInterrupt_BDDFB9AF46BBD3CA61F8BA9273DAB744();
	void m_OnMoveInterrupt_87CE8DC94F37FCA1023BD19C173FE988();
	void m_OnMoveInterrupt_BDDFB9AF46BBD3CA61F8BA9273DAB744();
	void m_OnShoot_48742C4D456D5CFC83AAACA9AD75EF22();
	void m_OnShootCanceled_48742C4D456D5CFC83AAACA9AD75EF22();
	void m_OnValidNullMontageChosen_87CE8DC94F37FCA1023BD19C173FE988();
	void m_OnValidNullMontageChosen_BDDFB9AF46BBD3CA61F8BA9273DAB744();
	void OnBlendedIn_87CE8DC94F37FCA1023BD19C173FE988();
	void OnBlendedIn_BDDFB9AF46BBD3CA61F8BA9273DAB744();
	void OnBlendOut_87CE8DC94F37FCA1023BD19C173FE988();
	void OnBlendOut_BDDFB9AF46BBD3CA61F8BA9273DAB744();
	void OnCancel_A76C2BDB40C8FAF11D21FB83067CC730(const struct FGameplayAbilityTargetDataHandle& Data);
	void OnCancelled_87CE8DC94F37FCA1023BD19C173FE988();
	void OnCancelled_BDDFB9AF46BBD3CA61F8BA9273DAB744();
	void OnCompleted_87CE8DC94F37FCA1023BD19C173FE988();
	void OnCompleted_BDDFB9AF46BBD3CA61F8BA9273DAB744();
	void OnInterrupted_87CE8DC94F37FCA1023BD19C173FE988();
	void OnInterrupted_BDDFB9AF46BBD3CA61F8BA9273DAB744();
	void OnSync_A76C2BDB40C8FAF11D21FB83067CC730(const struct FGameplayAbilityTargetDataHandle& Data);
	void OnTimeOut_A76C2BDB40C8FAF11D21FB83067CC730(const struct FGameplayAbilityTargetDataHandle& Data);
	void OverrideAimingComputationForKeyBoard(int32 GameOption);
	void PreparePlayerContextFromNetworkSync(const struct FGameplayAbilityTargetDataHandle& Data, struct FGameplayAbilityTargetDataHandle* PlayerContext);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Tap_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Tap_C")
	}
	static class UGA_Tap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Tap_C>();
	}
};
DUMPER7_ASSERTS_UGA_Tap_C;

}

