#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_VolleyTap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Runtime_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GA_BaseShoot_classes.hpp"
#include "SCCore_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_VolleyTap.GA_VolleyTap_C
// 0x0230 (0x0FF0 - 0x0DC0)
class UGA_VolleyTap_C : public UGA_BaseShoot_C
{
public:
	uint8                                         Pad_DB1[0x7];                                      // 0x0DB1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_VolleyTap_C;                     // 0x0DB8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 ShootPicker;                                       // 0x0DC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         Status;                                            // 0x0DC8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USCInputAction*                         IADirection;                                       // 0x0DD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       TempDataFromSyncShoot;                             // 0x0DE0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, AdvancedDisplay)
	TSubclassOf<class UAnimSequencePicker>        BuildUpPicker;                                     // 0x0E08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FBallInterceptionPointTargetData       BallTargetData;                                    // 0x0E10(0x0120)(Edit, BlueprintVisible, DisableEditOnInstance, AdvancedDisplay)
	class UClass*                                 CameraShake;                                       // 0x0F30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         IndexShootData;                                    // 0x0F38(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_F3C[0x4];                                      // 0x0F3C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSCNetworkSyncData                     SCNetworkSyncData;                                 // 0x0F40(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          DebugVolleyStack;                                  // 0x0F50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          VolleyPaddingFinished;                             // 0x0F51(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F52[0x6];                                      // 0x0F52(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_NetworkSyncShootData*      NetworkSyncTask;                                   // 0x0F58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_SCPlayMontageAndWait*      BuildUpTask;                                       // 0x0F60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_BallInteractionRequest*    VolleyRequestTask;                                 // 0x0F68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        AngleNoLook;                                       // 0x0F70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           NoLookTag;                                         // 0x0F78(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  ShootRefusedPhaseTag;                              // 0x0F80(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 Joystick_Emulation_Computation;                    // 0x0FA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Directional_Aiming_Computation;                    // 0x0FA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Crosshair_Only_Computation;                        // 0x0FB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       OverrideComputation;                               // 0x0FB8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           TapLockCamTag;                                     // 0x0FE0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BPE_BuildPayload();
	void ExecuteUbergraph_GA_VolleyTap(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void m_BuildClientPayload_E7841AA048F400D304E4C2A9785D632C(const struct FGameplayAbilityTargetDataHandle& Data);
	void m_OnCanMoveInterrupt_4F56E58E4A2169B3A6AFD282302D5C8A();
	void m_OnCanMoveInterrupt_C2D943394DB77C659BA12C8B0A2BB9F9();
	void m_OnMoveInterrupt_4F56E58E4A2169B3A6AFD282302D5C8A();
	void m_OnMoveInterrupt_C2D943394DB77C659BA12C8B0A2BB9F9();
	void m_OnShoot_7B8259A547959C95EF5F4C92238A75C7();
	void m_OnShootCanceled_7B8259A547959C95EF5F4C92238A75C7();
	void m_OnValidNullMontageChosen_4F56E58E4A2169B3A6AFD282302D5C8A();
	void m_OnValidNullMontageChosen_C2D943394DB77C659BA12C8B0A2BB9F9();
	void m_OnVolleyRefused_7B8259A547959C95EF5F4C92238A75C7();
	void OnBlendedIn_4F56E58E4A2169B3A6AFD282302D5C8A();
	void OnBlendedIn_C2D943394DB77C659BA12C8B0A2BB9F9();
	void OnBlendOut_4F56E58E4A2169B3A6AFD282302D5C8A();
	void OnBlendOut_C2D943394DB77C659BA12C8B0A2BB9F9();
	void OnCancel_E7841AA048F400D304E4C2A9785D632C(const struct FGameplayAbilityTargetDataHandle& Data);
	void OnCancelled_4F56E58E4A2169B3A6AFD282302D5C8A();
	void OnCancelled_C2D943394DB77C659BA12C8B0A2BB9F9();
	void OnCompleted_4F56E58E4A2169B3A6AFD282302D5C8A();
	void OnCompleted_C2D943394DB77C659BA12C8B0A2BB9F9();
	void OnFinish_03E413BD47E1771A59D1688C0FC61209();
	void OnFinish_03E413BD47E1771A59D1688C46007AE1();
	void OnInterrupted_4F56E58E4A2169B3A6AFD282302D5C8A();
	void OnInterrupted_C2D943394DB77C659BA12C8B0A2BB9F9();
	void OnRejectedShoot();
	void OnRequestFail_883AF9E24D3BFDF27322A998ACE7C24B();
	void OnRequestSuccess_883AF9E24D3BFDF27322A998ACE7C24B();
	void OnStateEnded_61AB436342214D82C81BF4B35DABFA8F();
	void OnStateInterrupted_61AB436342214D82C81BF4B35DABFA8F();
	void OnSync_E7841AA048F400D304E4C2A9785D632C(const struct FGameplayAbilityTargetDataHandle& Data);
	void OnTimedOut_61CC6DF6450479D2E0FDBDA1860C86C1();
	void OnTimedOutAndDestinationReached_61CC6DF6450479D2E0FDBDA1860C86C1();
	void OnTimeOut_E7841AA048F400D304E4C2A9785D632C(const struct FGameplayAbilityTargetDataHandle& Data);
	void OverrideAimingComputationForKeyBoard(int32 GameOption);
	void StartStateTasks_61AB436342214D82C81BF4B35DABFA8F();

	void GetPlayerContext(const struct FGameplayAbilityTargetDataHandle& Data, struct FGameplayAbilityTargetDataHandle* PlayerContext) const;
	struct FShootPrepTargetData MakeShootPrep() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_VolleyTap_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_VolleyTap_C")
	}
	static class UGA_VolleyTap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_VolleyTap_C>();
	}
};
DUMPER7_ASSERTS_UGA_VolleyTap_C;

}

