#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_VolleyShoot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Runtime_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GA_BaseShoot_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_VolleyShoot.GA_VolleyShoot_C
// 0x0250 (0x1000 - 0x0DB0)
class UGA_VolleyShoot_C : public UGA_BaseShoot_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_VolleyShoot_C;                   // 0x0DB0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 Picker;                                            // 0x0DB8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CameraShootGameplayTag;                            // 0x0DC0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FBallInterceptionPointTargetData       InterceptionPointTargetData;                       // 0x0DE0(0x0120)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	TArray<class UClass*>                         Status;                                            // 0x0F00(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	class USCInputAction*                         IAMagnus;                                          // 0x0F10(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CameraShake;                                       // 0x0F18(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       ShootDirectionTargetData;                          // 0x0F20(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          DebugVolleyStack;                                  // 0x0F48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          VolleyPaddingFinished;                             // 0x0F49(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4A[0x6];                                      // 0x0F4A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_NetworkSyncShootData*      NetworkSyncTask;                                   // 0x0F50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        MediumShootThreashold;                             // 0x0F58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_BallInteractionRequest*    VolleyRequestTask;                                 // 0x0F60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTargetingResultMeta                   TargetingResultMeta;                               // 0x0F68(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  ShootRefusedPhaseTag;                              // 0x0FA0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 MKDirectionComputation;                            // 0x0FC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 MKRotationForceComputation;                        // 0x0FC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       OverrideComputation;                               // 0x0FD0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          LockCameraShoot;                                   // 0x0FF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPE_BuildPayload();
	void ExecuteUbergraph_GA_VolleyShoot(int32 EntryPoint);
	void GetCameraDirection(struct FGameplayAbilityTargetDataHandle* CameraDirection);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void m_BuildClientPayload_5DFB8AFA446967FB184509BC9E7DC572(const struct FGameplayAbilityTargetDataHandle& Data);
	void m_OnCanMoveInterrupt_2D077FD24611E96029A3F49773A9579A();
	void m_OnMoveInterrupt_2D077FD24611E96029A3F49773A9579A();
	void m_OnShoot_9BA2B9224328B08AD58E6CA5E286DD2B();
	void m_OnShootCanceled_9BA2B9224328B08AD58E6CA5E286DD2B();
	void m_OnValidNullMontageChosen_2D077FD24611E96029A3F49773A9579A();
	void m_OnVolleyRefused_9BA2B9224328B08AD58E6CA5E286DD2B();
	void OnBlendedIn_2D077FD24611E96029A3F49773A9579A();
	void OnBlendOut_2D077FD24611E96029A3F49773A9579A();
	void OnCancel_5DFB8AFA446967FB184509BC9E7DC572(const struct FGameplayAbilityTargetDataHandle& Data);
	void OnCancelled_2D077FD24611E96029A3F49773A9579A();
	void OnCompleted_2D077FD24611E96029A3F49773A9579A();
	void OnFinish_03E413BD47E1771A59D1688C8063D693();
	void OnFinish_03E413BD47E1771A59D1688C836E2CEE();
	void OnInterrupted_2D077FD24611E96029A3F49773A9579A();
	void OnRejectedShoot();
	void OnRequestFail_55680BEC47F59049927B9FB11924919F();
	void OnRequestSuccess_55680BEC47F59049927B9FB11924919F();
	void OnSync_5DFB8AFA446967FB184509BC9E7DC572(const struct FGameplayAbilityTargetDataHandle& Data);
	void OnTimedOut_61CC6DF6450479D2E0FDBDA156BE0705();
	void OnTimedOutAndDestinationReached_61CC6DF6450479D2E0FDBDA156BE0705();
	void OnTimeOut_5DFB8AFA446967FB184509BC9E7DC572(const struct FGameplayAbilityTargetDataHandle& Data);
	void OverrideComputationForKeyBoard(bool IsKeyBoardController);
	void OverrideLockShot(bool IsKeyboard, int32 GameOption);
	void UpdateShootParamsTags(const struct FShootParams& in_ShootParams, struct FShootParams* out_ShootParams);
	void UpdateShootPrep();

	void DefineShootType(const struct FShootParams& ShootParams_0, struct FGameplayTag* ShootType) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_VolleyShoot_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_VolleyShoot_C")
	}
	static class UGA_VolleyShoot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_VolleyShoot_C>();
	}
};
DUMPER7_ASSERTS_UGA_VolleyShoot_C;

}

