#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_VolleyAerialPushBall

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Runtime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_VolleyAerialPushBall.GA_VolleyAerialPushBall_C.BuildPayloadToPickBuildUpAnim
// 0x0610 (0x0610 - 0x0000)
struct GA_VolleyAerialPushBall_C_BuildPayloadToPickBuildUpAnim final
{
public:
	struct FGameplayAbilityTargetDataHandle       Return_Value;                                      // 0x0000(0x0028)(Parm, OutParm)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_GetProvidedTargetData__outData;           // 0x0038(0x0028)()
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0060(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBallInterceptionPointTargetData       CallFunc_GetTargetDataPure__outData;               // 0x00C0(0x0120)()
	bool                                          CallFunc_GetTargetDataPure_ReturnValue;            // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0xF];                                      // 0x01E1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetingLocationInfo  K2Node_MakeStruct_GameplayAbilityTargetingLocationInfo; // 0x01F0(0x00A0)(ContainsInstancedReference)
	struct FGameplayAbilityTargetingLocationInfo  K2Node_MakeStruct_GameplayAbilityTargetingLocationInfo_1; // 0x0290(0x00A0)(ContainsInstancedReference)
	struct FVector                                CallFunc_BPF_GetShootDirection_ReturnValue;        // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetData_LocationInfo K2Node_MakeStruct_GameplayAbilityTargetData_LocationInfo; // 0x0350(0x0150)(ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_AbilityTargetDataFromDirection_ReturnValue; // 0x04A0(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle;          // 0x04C8(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_GetProvidedTargetData__outData_1;         // 0x04F0(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle_1;        // 0x0518(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue; // 0x0540(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle_2;        // 0x0568(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue_1; // 0x0590(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue_2; // 0x05B8(0x0028)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDataCommutative_ReturnValue_3; // 0x05E0(0x0028)()
};
DUMPER7_ASSERTS_GA_VolleyAerialPushBall_C_BuildPayloadToPickBuildUpAnim;

// Function GA_VolleyAerialPushBall.GA_VolleyAerialPushBall_C.ExecuteUbergraph_GA_VolleyAerialPushBall
// 0x0018 (0x0018 - 0x0000)
struct GA_VolleyAerialPushBall_C_ExecuteUbergraph_GA_VolleyAerialPushBall final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_HandleLooseGameplayTags*   CallFunc_BPF_HandleLooseGameplayTags_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_VolleyAerialPushBall_C_ExecuteUbergraph_GA_VolleyAerialPushBall;

}

