#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_VolleyPushBall

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Runtime_structs.hpp"
#include "SCCore_structs.hpp"
#include "GA_BaseShoot_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_VolleyPushBall.GA_VolleyPushBall_C
// 0x01A0 (0x0F50 - 0x0DB0)
#pragma pack(push, 0x1)
class alignas(0x10) UGA_VolleyPushBall_C : public UGA_BaseShoot_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_VolleyPushBall_C;                // 0x0DB0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSubclassOf<class UAnimSequencePicker>        BuildUpPicker;                                     // 0x0DB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class USCInputAction*                         IADirection;                                       // 0x0DC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ShootPicker;                                       // 0x0DC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         Status;                                            // 0x0DD0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FBallInterceptionPointTargetData       BallTargetData;                                    // 0x0DE0(0x0120)(Edit, BlueprintVisible, DisableEditOnInstance, AdvancedDisplay)
	class UBasicMontagePlayerConfiguration*       BuildUp_Configuration;                             // 0x0F00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FSCNetworkSyncData                     SCNetworkSyncData;                                 // 0x0F08(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          DebugVolleyStack;                                  // 0x0F18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F19[0x3];                                      // 0x0F19(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ShootTypeTagForSync;                               // 0x0F1C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          VolleyPaddingFinished;                             // 0x0F24(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F25[0x3];                                      // 0x0F25(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_NetworkSyncShootData*      NetworkSyncTask;                                   // 0x0F28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_SCPlayMontageAndWait*      BuildUpTask;                                       // 0x0F30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            TackleCooldownAfterReleaseBall;                    // 0x0F38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAbilityTask_BallInteractionRequest*    VolleyRequestTask;                                 // 0x0F40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AdditionalBehavior();
	void BPE_BuildPayload();
	void BuildPayloadToPickBuildUpAnim(struct FGameplayAbilityTargetDataHandle* Return_Value);
	void BuildShootPrep(class ABall* Ball);
	void ExecuteUbergraph_GA_VolleyPushBall(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void m_BuildClientPayload_55748A8F4A446487D995B6AD2A5A3DFE(const struct FGameplayAbilityTargetDataHandle& Data);
	void m_BuildClientPayload_CD23290B48196971F8F172BD168AD7A7(const struct FGameplayAbilityTargetDataHandle& Data);
	void m_OnCancelled_55748A8F4A446487D995B6AD2A5A3DFE(const struct FGameplayAbilityTargetDataHandle& Data);
	void m_OnCanMoveInterrupt_28073C51414D83A5D86D268FDB1CFD9B();
	void m_OnCanMoveInterrupt_5CF297694BB114093451188A54076E1E();
	void m_OnEnded_55748A8F4A446487D995B6AD2A5A3DFE(const struct FGameplayAbilityTargetDataHandle& Data);
	void m_OnMoveInterrupt_28073C51414D83A5D86D268FDB1CFD9B();
	void m_OnMoveInterrupt_5CF297694BB114093451188A54076E1E();
	void m_OnShoot_ABF884424C4C817FE4D1B39FAB76B696();
	void m_OnShootCanceled_ABF884424C4C817FE4D1B39FAB76B696();
	void m_OnValidNullMontageChosen_28073C51414D83A5D86D268FDB1CFD9B();
	void m_OnValidNullMontageChosen_5CF297694BB114093451188A54076E1E();
	void m_OnVolleyRefused_ABF884424C4C817FE4D1B39FAB76B696();
	void OnBlendedIn_28073C51414D83A5D86D268FDB1CFD9B();
	void OnBlendedIn_5CF297694BB114093451188A54076E1E();
	void OnBlendOut_28073C51414D83A5D86D268FDB1CFD9B();
	void OnBlendOut_5CF297694BB114093451188A54076E1E();
	void OnCancel_CD23290B48196971F8F172BD168AD7A7(const struct FGameplayAbilityTargetDataHandle& Data);
	void OnCancelled_28073C51414D83A5D86D268FDB1CFD9B();
	void OnCancelled_5CF297694BB114093451188A54076E1E();
	void OnCompleted_28073C51414D83A5D86D268FDB1CFD9B();
	void OnCompleted_5CF297694BB114093451188A54076E1E();
	void OnFinish_03E413BD47E1771A59D1688C3EC4EBF4();
	void OnFinish_03E413BD47E1771A59D1688CC215707D();
	void OnInterrupted_28073C51414D83A5D86D268FDB1CFD9B();
	void OnInterrupted_5CF297694BB114093451188A54076E1E();
	void OnRejectedShoot();
	void OnRequestFail_6C2BEA97435D67D26C8CE6A5E575A62D();
	void OnRequestSuccess_6C2BEA97435D67D26C8CE6A5E575A62D();
	void OnSync_CD23290B48196971F8F172BD168AD7A7(const struct FGameplayAbilityTargetDataHandle& Data);
	void OnTimedOut_61CC6DF6450479D2E0FDBDA1CD869B76();
	void OnTimedOutAndDestinationReached_61CC6DF6450479D2E0FDBDA1CD869B76();
	void OnTimeOut_CD23290B48196971F8F172BD168AD7A7(const struct FGameplayAbilityTargetDataHandle& Data);

	struct FGameplayAbilityTargetDataHandle BuildPayloadToPickDashAnim(const struct FGameplayAbilityTargetDataHandle& Data) const;
	struct FGameplayAbilityTargetDataHandle BuildPayloadToPickFinalAnim(const struct FGameplayAbilityTargetDataHandle& Data) const;
	double GetBuildUpDuration(const struct FGameplayAbilityTargetDataHandle& Handle, const struct FAnimSequencePlayInfos& AnimSequence) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_VolleyPushBall_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_VolleyPushBall_C")
	}
	static class UGA_VolleyPushBall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_VolleyPushBall_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UGA_VolleyPushBall_C;

}

