#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_BallStealSuccess

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EnumPredictionMarkerType_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_BallStealSuccess.GC_BallStealSuccess_C
// 0x0048 (0x0368 - 0x0320)
class AGC_BallStealSuccess_C final : public AGameplayCueNotify_Actor
{
public:
	class UNiagaraComponent*                      NS_BallSuccess_Hit_Tackle_NoLocal;                 // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_BallSuccess_Tackle;                             // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_BallSuccess_Block;                              // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        FeedbackForceIntensity;                            // 0x0340(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FeedbackDuration;                                  // 0x0348(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ShootImpactOneFrameDelay;                          // 0x0350(0x0008)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ShootImpactFreezeFrameDelay;                       // 0x0358(0x0008)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PendingShootImpact;                                // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ClearPreviousShootImpact();
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void PausePendingShootImpact();
	void PlayHitFXs(class AActor* InOwningActor, class AActor* InTargetActor, const struct FHitRequest& InHitRequest, bool InIsLocalPlayerController, double InFreezeFrameDuration);
	void Setup_Frozen_Shoot_Impact(class UNiagaraComponent* InVFXComp, double InFreezeFrameDuration);
	void UnpausePendingShootImpact();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GC_BallStealSuccess_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GC_BallStealSuccess_C")
	}
	static class AGC_BallStealSuccess_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_BallStealSuccess_C>();
	}
};
DUMPER7_ASSERTS_AGC_BallStealSuccess_C;

}

