#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_BuffedAlly_Fireball

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_BuffedAlly_Fireball.GC_BuffedAlly_Fireball_C.ExecuteUbergraph_GC_BuffedAlly_Fireball
// 0x0008 (0x0008 - 0x0000)
struct GC_BuffedAlly_Fireball_C_ExecuteUbergraph_GC_BuffedAlly_Fireball final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_InvulnerabilityDuration;        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GC_BuffedAlly_Fireball_C_ExecuteUbergraph_GC_BuffedAlly_Fireball;

// Function GC_BuffedAlly_Fireball.GC_BuffedAlly_Fireball_C.InvulnerableAnim
// 0x0004 (0x0004 - 0x0000)
struct GC_BuffedAlly_Fireball_C_InvulnerableAnim final
{
public:
	float                                         InvulnerabilityDuration;                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GC_BuffedAlly_Fireball_C_InvulnerableAnim;

// Function GC_BuffedAlly_Fireball.GC_BuffedAlly_Fireball_C.OnActive
// 0x0280 (0x0280 - 0x0000)
struct GC_BuffedAlly_Fireball_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectQuery                   Query;                                             // 0x00E8(0x0198)(Edit, BlueprintVisible, ContainsInstancedReference)
};
DUMPER7_ASSERTS_GC_BuffedAlly_Fireball_C_OnActive;

// Function GC_BuffedAlly_Fireball.GC_BuffedAlly_Fireball_C.OnRemove
// 0x00E8 (0x00E8 - 0x0000)
struct GC_BuffedAlly_Fireball_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GC_BuffedAlly_Fireball_C_OnRemove;

// Function GC_BuffedAlly_Fireball.GC_BuffedAlly_Fireball_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct GC_BuffedAlly_Fireball_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GC_BuffedAlly_Fireball_C_UserConstructionScript;

}

