#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_BuffedAlly_Fireball

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_BuffedAlly_Fireball.GC_BuffedAlly_Fireball_C
// 0x0040 (0x0360 - 0x0320)
class AGC_BuffedAlly_Fireball_C final : public AGameplayCueNotify_Actor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDecalComponent*                        Invincibility;                                     // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         InvincibleCircleTime_Time_92CEACC442E704E05636BEABDD30569C; // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            InvincibleCircleTime__Direction_92CEACC442E704E05636BEABDD30569C; // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     InvincibleCircleTime;                              // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               materialDynamique;                                 // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Out_Row_Value;                                     // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Goal_C*                             BPGoal;                                            // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_BuffedAlly_Fireball(int32 EntryPoint);
	void InvincibleCircleTime__FinishedFunc();
	void InvincibleCircleTime__UpdateFunc();
	void InvulnerableAnim(float InvulnerabilityDuration);
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GC_BuffedAlly_Fireball_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GC_BuffedAlly_Fireball_C")
	}
	static class AGC_BuffedAlly_Fireball_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_BuffedAlly_Fireball_C>();
	}
};
DUMPER7_ASSERTS_AGC_BuffedAlly_Fireball_C;

}

