#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Deflect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "EnumPredictionMarkerType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Deflect.GC_Deflect_C
// 0x0090 (0x03B0 - 0x0320)
class AGC_Deflect_C final : public AGameplayCueNotify_Actor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_Deflect_Goalkeeper;                             // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_DefenseMod;                                     // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Hit_Color;                                         // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Perfect_Hit_Color;                                 // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARuntimeCharacter*                      As_Runtime_Character;                              // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCharacterCustomizationComponent*       Character_Custo_Component;                         // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        ForceFeedbackIntensity;                            // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ForceFeedbackDuration;                             // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FreezeFrame;                                       // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ShootImpactFreezeFrameDelay;                       // 0x0388(0x0008)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ShootImpactOneFrameDelay;                          // 0x0390(0x0008)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PendingShootImpact;                                // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Hit_Color_0;                                       // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void bLock(class AActor* Ball);
	void ClearPreviousShootImpact();
	void ExecuteUbergraph_GC_Deflect(int32 EntryPoint);
	void InitFromActor(class AActor* InActor);
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void PausePendingShootImpact();
	void Setup_Frozen_Shoot_Impact(class UNiagaraComponent* InVFXComp, double InFreezeFrameDuration);
	void StartLogic(class AActor* Actor, const struct FGameplayCueParameters& Parameters);
	void UnpausePendingShootImpact();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GC_Deflect_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GC_Deflect_C")
	}
	static class AGC_Deflect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Deflect_C>();
	}
};
DUMPER7_ASSERTS_AGC_Deflect_C;

}

