#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_DiveHit

#include "Basic.hpp"

#include "ECustoExtraAssetTypes_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ECustoVFXType_structs.hpp"
#include "SCCore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_DiveHit.GC_DiveHit_C
// 0x0048 (0x0370 - 0x0328)
class AGC_DiveHit_C final : public ASCGameplayCueNotify_Actor
{
public:
	class UNiagaraComponent*                      NS_DefenseMod;                                     // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Hit_Color;                                         // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Perfect_Hit_Color;                                 // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARuntimeCharacter*                      As_Runtime_Character;                              // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCharacterCustomizationComponent*       Character_Custo_Component;                         // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ECustoExtraAssetTypes                         Defense_Block;                                     // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECustoVFXType                                 DefenseBlock;                                      // 0x0369(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GC_DiveHit_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GC_DiveHit_C")
	}
	static class AGC_DiveHit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_DiveHit_C>();
	}
};
DUMPER7_ASSERTS_AGC_DiveHit_C;

}

