#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_GoalKeeper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCCore_structs.hpp"
#include "SCCore_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_GoalKeeper.GC_GoalKeeper_C
// 0x0080 (0x03A8 - 0x0328)
class AGC_GoalKeeper_C final : public ASCGameplayCueNotify_Actor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_GoalKeeper_Loop_Pelvis_ElectricFX;              // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_GoalKeeper_Loop_Hand_Right_ElectricFX;          // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_GoalKeeper_Glove_Despawn_R;                     // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_GoalKeeper_Glove_Despawn_L;                     // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_GoalKeeper_Spawn_Flash;                         // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_GoalKeeper_Loop_Hand_Left_ElectricFX;           // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPoseableMeshComponent*                 GlovesMesh;                                        // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ARuntimeCharacter*                      GCOwnerCharacter;                                  // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Glove_Material_Dynamic;                            // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           LocalPlayerState;                                  // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   Gloves_Despawn_MKey;                               // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSCBlendMaterialSubsystemParamInstance GloveDissolutionCurves;                            // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, ContainsInstancedReference)
	bool                                          Is_Locally_Controlled;                             // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Attach_Gloves_to_Owner_Skeletal_Mesh();
	void ExecuteUbergraph_GC_GoalKeeper(int32 EntryPoint);
	void GoalKeeperToSweeper(bool Instantaneous);
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void OnActiveGC(const class AActor* Target);
	void OnFinishedGlovesDissolution();
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void Reset_Gameplay_Cue();
	void SwapColor();
	void ToggleVisibilityFX(bool bNewHidden);
	void Try_Attach_to_Mesh_and_Activate();
	bool WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

	void Is_GCOwner_A_Local_Player_Team_Mate(bool* IsTeamMate) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GC_GoalKeeper_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GC_GoalKeeper_C")
	}
	static class AGC_GoalKeeper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_GoalKeeper_C>();
	}
};
DUMPER7_ASSERTS_AGC_GoalKeeper_C;

}

