#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Hurt

#include "Basic.hpp"

#include "EnumPredictionMarkerType_structs.hpp"
#include "SCCore_structs.hpp"
#include "SCCore_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Hurt.GC_Hurt_C
// 0x01C0 (0x04E8 - 0x0328)
class AGC_Hurt_C : public ASCGameplayCueNotify_Actor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        BlockFeedbackForceDuration;                        // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BlockFeedbackForceIntensity;                       // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TackleFeedbackForceIntensity;                      // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TackleFeedbackForceDuration;                       // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldLookAtBall;                                  // 0x0350(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x3];                                      // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DelayBeforeLookat;                                 // 0x0354(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSCCameraLookAtServiceBehavior         LookAtParameters;                                  // 0x0358(0x0188)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ARuntimeCharacter*                      OwnerAsRuntimeCharacter;                           // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void TriggerLookAtBall();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GC_Hurt_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GC_Hurt_C")
	}
	static class AGC_Hurt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Hurt_C>();
	}
};
DUMPER7_ASSERTS_AGC_Hurt_C;

}

