#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Ping

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SCCore_structs.hpp"
#include "EnumPredictionMarkerType_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Ping.GC_Ping_C
// 0x00A0 (0x03C0 - 0x0320)
class AGC_Ping_C final : public AGameplayCueNotify_Actor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_BallCall_Line;                                  // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NiagaraGlobal;                                     // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ASCGameState*                           MatchGameState;                                    // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_PingZone_C*>                 Zones;                                             // 0x0348(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	TArray<class ABP_PingMarker_C*>               Markers;                                           // 0x0358(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	TArray<class ABP_PingMarker_C*>               AvailableMarkers;                                  // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	TArray<class AActor*>                         Targets;                                           // 0x0378(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FGuid                                  PingID;                                            // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARuntimeCharacter*                      As_Runtime_Character;                              // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FBaseActorTargetConditionInstance      ShowBallCallLineCondition;                         // 0x03A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, ContainsInstancedReference)
	struct FBaseActorTargetConditionInstance      HideBallCallLineCondition;                         // 0x03B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, ContainsInstancedReference)

public:
	void ExecuteUbergraph_GC_Ping(int32 EntryPoint);
	void HideAllMarkers();
	void HideOurPingZones(class AActor* InRequester);
	void InternalOnRemove(class AActor* InRequester);
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void OnMatchStateChanged(class FName _newMatchState);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void PlayGlobalBallCall();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void ShowMarker(class UClass* InMarkerClass, const struct FPingDataContainer& InPingData, const struct FTransform& InTransform, class AActor* inTarget, class AActor* InRequester);
	void TryToHideBallCallLine();
	void UpdateBallCallLine();

	const class UObject* GetSourceObject(const struct FGameplayCueParameters& Parameters) const;
	void GetZoneActorsWithTags(class UPingDataAsset* InPingAsset, class AActor* InRequester, TArray<class ABP_PingZone_C*>* OutArray) const;
	bool IsPingVisibleToLocalPlayer(bool bInFilterPingByTeam, class AActor* MyTarget) const;
	bool ShouldHideMarker(const struct FHitResult& PrevHitResult, const struct FHitResult& NewHitResult, const struct FPingDataContainer& InPingData) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GC_Ping_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GC_Ping_C")
	}
	static class AGC_Ping_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Ping_C>();
	}
};
DUMPER7_ASSERTS_AGC_Ping_C;

}

