#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Sprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "SCCore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Sprint.GC_Sprint_C
// 0x0290 (0x05B8 - 0x0328)
class AGC_Sprint_C final : public ASCGameplayCueNotify_Actor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_Sprint_Custo_R;                                 // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Sprint_Custo_L;                                 // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Sprint_Local;                                   // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Sprint;                                         // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  PP_Sprint;                                         // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Shoes_Emissive_Fade_90A47CE04107FB347B00359A62667E4B; // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Opacity_90A47CE04107FB347B00359A62667E4B; // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_90A47CE04107FB347B00359A62667E4B; // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Desactive_PP_Lerp_Distortion_DD68551F4531EC8692E182B67B90AB81; // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Desactive_PP_Radius_Distortion_DD68551F4531EC8692E182B67B90AB81; // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Desactive_PP_Texture_Speed_DD68551F4531EC8692E182B67B90AB81; // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Desactive_PP_Line_Delete_Artefact_DD68551F4531EC8692E182B67B90AB81; // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Desactive_PP_Line_Delete_Blue_DD68551F4531EC8692E182B67B90AB81; // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Desactive_PP_Density_Max_DD68551F4531EC8692E182B67B90AB81; // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Desactive_PP_Radius_DD68551F4531EC8692E182B67B90AB81; // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Desactive_PP__Direction_DD68551F4531EC8692E182B67B90AB81; // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_395[0x3];                                      // 0x0395(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Desactive_PP;                                      // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Active_PP_Lerp_Distortion_72AD31E9451BF5D752F9E9A7FD9C00E1; // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Active_PP_Radius_Distortion_72AD31E9451BF5D752F9E9A7FD9C00E1; // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Active_PP_Texture_Speed_72AD31E9451BF5D752F9E9A7FD9C00E1; // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Active_PP_Line_Delete_Artefact_72AD31E9451BF5D752F9E9A7FD9C00E1; // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Active_PP_Line_Delete_Blue_72AD31E9451BF5D752F9E9A7FD9C00E1; // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Active_PP_Density_Max_72AD31E9451BF5D752F9E9A7FD9C00E1; // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Active_PP_Radius_72AD31E9451BF5D752F9E9A7FD9C00E1; // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Active_PP__Direction_72AD31E9451BF5D752F9E9A7FD9C00E1; // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BD[0x3];                                      // 0x03BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Active_PP;                                         // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectQuery                   SprintBonus;                                       // 0x03C8(0x0198)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UCharacterMovementComponent*            As_Character_Movement_Component;                   // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ARuntimeCharacter*                      AsRuntimeCharacter;                                // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               M_PP_Sprint;                                       // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               M_PP_StartDribble;                                 // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UPoseableMeshComponent*                 PoseableMesh;                                      // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            NS_Curve_Sprint;                                   // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      PlayerController;                                  // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CameraShake;                                       // 0x0598(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Cam_Shake_Tag_Identifier;                          // 0x05A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash)
	class UCharacterCustomizationComponent*       Char_Custo_Comp;                                   // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterMaterialData_C*            MaterialData;                                      // 0x05B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void Activate_PP_Effects();
	void Activation_Sprint_Local();
	void Active_PP__FinishedFunc();
	void Active_PP__UpdateFunc();
	void Desactive_PP_Effect();
	void Desactive_PP__FinishedFunc();
	void Desactive_PP__UpdateFunc();
	void ExecuteUbergraph_GC_Sprint(int32 EntryPoint);
	void Fade_Out_VFX_();
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void OnCharacterGenerated(class UCharacterCustomizationComponent* _characterCustomizationComponent, bool _bWasCharacterGenerated);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void PP_Initialisation();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void Sprint_Activation_Global();
	void StopTimeline();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();
	void VFXInitialization();

	int32 GetSprintBonusLevel(class AActor* Actor) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GC_Sprint_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GC_Sprint_C")
	}
	static class AGC_Sprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Sprint_C>();
	}
};
DUMPER7_ASSERTS_AGC_Sprint_C;

}

