#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Sweeper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCCore_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Sweeper.GC_Sweeper_C
// 0x0078 (0x03A0 - 0x0328)
class AGC_Sweeper_C final : public ASCGameplayCueNotify_Actor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_Sweeper_Foot_Right;                             // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Sweeper_Foot_Left;                              // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_ActivateGoalkeeperFX_Gradiant_Foot_4537F30848C65DBB436C5AA58134C109; // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_ActivateGoalkeeperFX_Gradiant_Head_4537F30848C65DBB436C5AA58134C109; // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_ActivateGoalkeeperFX_WPO_Global_4537F30848C65DBB436C5AA58134C109; // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_ActivateGoalkeeperFX_ArmAlpha_4537F30848C65DBB436C5AA58134C109; // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_ActivateGoalkeeperFX_InverseGradiantColor_4537F30848C65DBB436C5AA58134C109; // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_ActivateGoalkeeperFX_GlitchWPO_4537F30848C65DBB436C5AA58134C109; // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_ActivateGoalkeeperFX_EmissiveColor_4537F30848C65DBB436C5AA58134C109; // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_ActivateGoalkeeperFX__Direction_4537F30848C65DBB436C5AA58134C109; // 0x0364(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_365[0x3];                                      // 0x0365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_ActivateGoalkeeperFX;                     // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ARuntimeCharacter*                      GCOwnerCharacter;                                  // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           GCOwnerPlayerState;                                // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class APlayerState*                           LocalPlayerState;                                  // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   MaterialInterface_NGKey;                           // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   IsNotLocal_NGKey;                                  // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Locally_Controlled;                             // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_Sweeper(int32 EntryPoint);
	void InitFX();
	void OnActivateFX();
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void OnActiveGC(const class AActor* Target);
	void OnExtraEffortStateChanged(const class USCAbilitySystemComponent* _abilitySystem, const struct FGameplayTag& _gameplayTag, int32 _iCount);
	void OnGoalkeeperStateChanged(const class USCAbilitySystemComponent* _abilitySystem, const struct FGameplayTag& _gameplayTag, int32 _iCount);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void PlayTimerBeforeToggleFeetFX();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void Reset_Gameplay_Cue();
	void StopTimer();
	void Timeline_ActivateGoalkeeperFX__FinishedFunc();
	void Timeline_ActivateGoalkeeperFX__UpdateFunc();
	void ToggleSweeperFeetFX(bool bNewActive);
	bool WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

	bool CanMoving() const;
	bool IsInExtraEffort() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GC_Sweeper_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GC_Sweeper_C")
	}
	static class AGC_Sweeper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Sweeper_C>();
	}
};
DUMPER7_ASSERTS_AGC_Sweeper_C;

}

