#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Shoot

#include "Basic.hpp"

#include "GC_ShootAbility_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Shoot.GC_Shoot_C
// 0x0028 (0x0518 - 0x04F0)
class AGC_Shoot_C : public AGC_ShootAbility_Base_C
{
public:
	double                                        FeedbackLowForceIntensity;                         // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FeedbackHighForceIntensity;                        // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FeedbackLowForceDuration;                          // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FeedbackHighForceDuration;                         // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FeedbackDataAppliedForceIntensity;                 // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ControllerDynamicForceFeedback(bool OnImpactShootForceFeedback);
	void DataAppliedTagAdded();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GC_Shoot_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GC_Shoot_C")
	}
	static class AGC_Shoot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Shoot_C>();
	}
};
DUMPER7_ASSERTS_AGC_Shoot_C;

}

