#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_ShootAbility_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Runtime_structs.hpp"
#include "SCCore_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_ShootAbility_Base.GC_ShootAbility_Base_C
// 0x01C8 (0x04F0 - 0x0328)
class AGC_ShootAbility_Base_C : public ASCGameplayCueNotify_Actor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ARuntimeCharacter*                      As_Runtime_Character;                              // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGA_BaseShoot_C*                        Ability;                                           // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  BeforeShootTagContainer;                           // 0x0348(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  AfterShootTagContainer;                            // 0x0368(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class URuntimeAbilitySystemComponent*         RuntimeASC;                                        // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        MinRatioShakeCamBySpeed;                           // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxRatioShakeCamBySpeed;                           // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ShootForceUpdateHandle;                            // 0x03A0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  DataAppliedTagContainer;                           // 0x03A8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ABall*                                  ShootBall;                                         // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FShootPrepTargetData                   ShootPrep;                                         // 0x03D0(0x00E0)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FGameplayTagContainer                  ShootTagContainer;                                 // 0x04B0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ShowOnlyForAllies;                                 // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShootDirectionOrientationShakeCam;                 // 0x04D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D2[0x6];                                      // 0x04D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ShootDirectionForceMultiplierShakeCam;             // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FeedbackForceIntensity;                            // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FeedbackForceDuration;                             // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AfterImpactEvent(const class USCAbilitySystemComponent* _abilitySystem, const struct FGameplayTag& _gameplayTag, int32 _iCount);
	void AfterImpactTagAdded();
	void AfterImpactTagRemoved();
	void BeforeImpactAdded();
	void BeforeImpactEvent(const class USCAbilitySystemComponent* _abilitySystem, const struct FGameplayTag& _gameplayTag, int32 _iCount);
	void BeforeImpactTagAdded();
	void BeforeImpactTagRemoved();
	void ControllerDynamicForceFeedback(bool OnImpactShootForceFeedback);
	void Data_Applied_Event(const class USCAbilitySystemComponent* _abilitySystem, const struct FGameplayTag& _gameplayTag, int32 _iCount);
	void DataAppliedTagAdded();
	void DataAppliedTagRemoved();
	void ExecuteUbergraph_GC_ShootAbility_Base(int32 EntryPoint);
	void On_Look_at_Shake_Cam();
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void OnGameplayCueRemove();
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void ResetValues();
	void ShakeCam();
	void UpdateDataFromGCPayload(const struct FGameplayCueParameters& Parameters);
	void UpdateShootForce();

	void GetShootBall(class ABall** ShootBall_0) const;
	void GetShootParams(struct FShootParams* ShootParams, bool* Success) const;
	void GetShootPrep(struct FShootPrepTargetData* ShootPrep_0) const;
	void IsInstigator(bool* Success) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GC_ShootAbility_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GC_ShootAbility_Base_C")
	}
	static class AGC_ShootAbility_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_ShootAbility_Base_C>();
	}
};
DUMPER7_ASSERTS_AGC_ShootAbility_Base_C;

}

