#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_VolleyTap

#include "Basic.hpp"

#include "GC_Tap_classes.hpp"
#include "Engine_structs.hpp"
#include "Runtime_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_VolleyTap.GC_VolleyTap_C
// 0x0158 (0x06C0 - 0x0568)
class AGC_VolleyTap_C final : public AGC_Tap_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GC_VolleyTap_C;                     // 0x0568(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_Tap_VolleyMarker;                               // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_VolleyPredict_Validation;                       // 0x0578(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_FadeOut_2FB3023D4E2B7CE2D5C05894566ECD44; // 0x0580(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_2FB3023D4E2B7CE2D5C05894566ECD44; // 0x0584(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_585[0x3];                                      // 0x0585(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0588(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FBallInterceptionPointTargetData       BallInterception;                                  // 0x0590(0x0120)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        FadeOutCancel;                                     // 0x06B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AfterImpactTagAdded();
	void BeforeImpactTagAdded();
	void ExecuteUbergraph_GC_VolleyTap(int32 EntryPoint);
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void OnVolleyRefused(const class USCAbilitySystemComponent* _abilitySystem, const struct FGameplayTag& _gameplayTag, int32 _iCount);
	void ReceiveTick(float DeltaSeconds);
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

	void ComputeNSTapWorldPosition(struct FVector* Position) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GC_VolleyTap_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GC_VolleyTap_C")
	}
	static class AGC_VolleyTap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_VolleyTap_C>();
	}
};
DUMPER7_ASSERTS_AGC_VolleyTap_C;

}

