#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting

#include "Basic.hpp"


namespace SDK::Params
{

// Function MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting.MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C.ChangingRoom_MultiFog_OFF
// 0x0008 (0x0008 - 0x0000)
struct MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_ChangingRoom_MultiFog_OFF final
{
public:
	class AMultiFog*                              ChangingRoom_MultiFog;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_ChangingRoom_MultiFog_OFF;

// Function MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting.MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C.ChangingRoom_MultiFog_ON
// 0x0008 (0x0008 - 0x0000)
struct MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_ChangingRoom_MultiFog_ON final
{
public:
	class AMultiFog*                              ChangingRoom_MultiFog;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_ChangingRoom_MultiFog_ON;

// Function MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting.MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C.Coliseum_MultiFog_OFF
// 0x0008 (0x0008 - 0x0000)
struct MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_Coliseum_MultiFog_OFF final
{
public:
	class AMultiFog*                              MultiFog;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_Coliseum_MultiFog_OFF;

// Function MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting.MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C.Coliseum_MultiFog_ON
// 0x0008 (0x0008 - 0x0000)
struct MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_Coliseum_MultiFog_ON final
{
public:
	class AMultiFog*                              MultiFog;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_Coliseum_MultiFog_ON;

// Function MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting.MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C.ExecuteUbergraph_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP
// 0x0068 (0x0068 - 0x0000)
struct MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_ExecuteUbergraph_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADirectionalLight*                      K2Node_CustomEvent_LGT_TrainingCenter_Sun_01;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASkyLight*                              K2Node_CustomEvent_LGT_Sky_01_1;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASkyLight*                              K2Node_CustomEvent_LGT_Sky_ChangingRoom_01_1;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASkyLight*                              K2Node_CustomEvent_LGT_Sky_01;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASkyLight*                              K2Node_CustomEvent_LGT_Sky_ChangingRoom_01;        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADirectionalLight*                      K2Node_CustomEvent_LGT_Field_Sun_01_1;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADirectionalLight*                      K2Node_CustomEvent_LGT_Field_Sun_01;               // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMultiFog*                              K2Node_CustomEvent_MultiFog_1;                     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMultiFog*                              K2Node_CustomEvent_MultiFog;                       // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMultiFog*                              K2Node_CustomEvent_ChangingRoom_MultiFog_1;        // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMultiFog*                              K2Node_CustomEvent_ChangingRoom_MultiFog;          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADirectionalLight*                      K2Node_CustomEvent_LGT_TrainingCenter_Sun_01_1;    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_ExecuteUbergraph_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP;

// Function MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting.MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C.LGT_Field_Sun_01_OFF
// 0x0008 (0x0008 - 0x0000)
struct MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_LGT_Field_Sun_01_OFF final
{
public:
	class ADirectionalLight*                      LGT_Field_Sun_01;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_LGT_Field_Sun_01_OFF;

// Function MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting.MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C.LGT_Field_Sun_01_ON
// 0x0008 (0x0008 - 0x0000)
struct MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_LGT_Field_Sun_01_ON final
{
public:
	class ADirectionalLight*                      LGT_Field_Sun_01;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_LGT_Field_Sun_01_ON;

// Function MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting.MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C.LGT_Sky_01_OFF
// 0x0008 (0x0008 - 0x0000)
struct MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_LGT_Sky_01_OFF final
{
public:
	class ASkyLight*                              LGT_Sky_01;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_LGT_Sky_01_OFF;

// Function MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting.MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C.LGT_Sky_01_ON
// 0x0008 (0x0008 - 0x0000)
struct MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_LGT_Sky_01_ON final
{
public:
	class ASkyLight*                              LGT_Sky_01;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_LGT_Sky_01_ON;

// Function MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting.MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C.LGT_Sky_ChangingRoom_01_OFF
// 0x0008 (0x0008 - 0x0000)
struct MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_LGT_Sky_ChangingRoom_01_OFF final
{
public:
	class ASkyLight*                              LGT_Sky_ChangingRoom_01;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_LGT_Sky_ChangingRoom_01_OFF;

// Function MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting.MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C.LGT_Sky_ChangingRoom_01_ON
// 0x0008 (0x0008 - 0x0000)
struct MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_LGT_Sky_ChangingRoom_01_ON final
{
public:
	class ASkyLight*                              LGT_Sky_ChangingRoom_01;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_LGT_Sky_ChangingRoom_01_ON;

// Function MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting.MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C.LGT_TrainingCenter_Sun_01_OFF
// 0x0008 (0x0008 - 0x0000)
struct MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_LGT_TrainingCenter_Sun_01_OFF final
{
public:
	class ADirectionalLight*                      LGT_TrainingCenter_Sun_01;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_LGT_TrainingCenter_Sun_01_OFF;

// Function MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting.MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C.LGT_TrainingCenter_Sun_01_ON
// 0x0008 (0x0008 - 0x0000)
struct MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_LGT_TrainingCenter_Sun_01_ON final
{
public:
	class ADirectionalLight*                      LGT_TrainingCenter_Sun_01;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_LGT_TrainingCenter_Sun_01_ON;

// Function MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting.MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C.SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP
// 0x0008 (0x0008 - 0x0000)
struct MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP final
{
public:
	class ASkyLight*                              LGT_Sky_01;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP;

// Function MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting.MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C.SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_0
// 0x0008 (0x0008 - 0x0000)
struct MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_0 final
{
public:
	class ASkyLight*                              LGT_Sky_01;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_0;

// Function MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting.MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C.SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_1
// 0x0008 (0x0008 - 0x0000)
struct MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_1 final
{
public:
	class ASkyLight*                              LGT_Sky_01;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_1;

// Function MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting.MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C.SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_10
// 0x0008 (0x0008 - 0x0000)
struct MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_10 final
{
public:
	class AMultiFog*                              MultiFog;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_10;

// Function MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting.MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C.SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_11
// 0x0008 (0x0008 - 0x0000)
struct MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_11 final
{
public:
	class AMultiFog*                              ChangingRoom_MultiFog;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_11;

// Function MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting.MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C.SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_12
// 0x0008 (0x0008 - 0x0000)
struct MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_12 final
{
public:
	class AMultiFog*                              ChangingRoom_MultiFog;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_12;

// Function MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting.MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C.SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_13
// 0x0008 (0x0008 - 0x0000)
struct MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_13 final
{
public:
	class AMultiFog*                              ChangingRoom_MultiFog;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_13;

// Function MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting.MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C.SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_14
// 0x0008 (0x0008 - 0x0000)
struct MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_14 final
{
public:
	class ADirectionalLight*                      LGT_TrainingCenter_Sun_01;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_14;

// Function MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting.MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C.SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_15
// 0x0008 (0x0008 - 0x0000)
struct MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_15 final
{
public:
	class ADirectionalLight*                      LGT_TrainingCenter_Sun_01;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_15;

// Function MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting.MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C.SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_16
// 0x0008 (0x0008 - 0x0000)
struct MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_16 final
{
public:
	class ADirectionalLight*                      LGT_TrainingCenter_Sun_01;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_16;

// Function MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting.MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C.SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_2
// 0x0008 (0x0008 - 0x0000)
struct MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_2 final
{
public:
	class ASkyLight*                              LGT_Sky_ChangingRoom_01;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_2;

// Function MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting.MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C.SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_3
// 0x0008 (0x0008 - 0x0000)
struct MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_3 final
{
public:
	class ASkyLight*                              LGT_Sky_ChangingRoom_01;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_3;

// Function MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting.MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C.SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_4
// 0x0008 (0x0008 - 0x0000)
struct MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_4 final
{
public:
	class ASkyLight*                              LGT_Sky_ChangingRoom_01;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_4;

// Function MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting.MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C.SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_5
// 0x0008 (0x0008 - 0x0000)
struct MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_5 final
{
public:
	class ADirectionalLight*                      LGT_Field_Sun_01;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_5;

// Function MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting.MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C.SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_6
// 0x0008 (0x0008 - 0x0000)
struct MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_6 final
{
public:
	class ADirectionalLight*                      LGT_Field_Sun_01;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_6;

// Function MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting.MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C.SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_7
// 0x0008 (0x0008 - 0x0000)
struct MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_7 final
{
public:
	class ADirectionalLight*                      LGT_Field_Sun_01;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_7;

// Function MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting.MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C.SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_8
// 0x0008 (0x0008 - 0x0000)
struct MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_8 final
{
public:
	class AMultiFog*                              MultiFog;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_8;

// Function MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting.MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C.SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_9
// 0x0008 (0x0008 - 0x0000)
struct MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_9 final
{
public:
	class AMultiFog*                              MultiFog;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_C_SequenceEvent__ENTRYPOINTMenuFlow_Transition_MainMenu_To_LockerRoom_Lighting_DirectorBP_9;

}

