#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModelViewViewModel

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "ModelViewViewModel_structs.hpp"


namespace SDK
{

// Class ModelViewViewModel.MVVMConversionLibrary
// 0x0000 (0x0028 - 0x0028)
class UMVVMConversionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static ESlateVisibility Conv_BoolToSlateVisibility(bool bIsVisible, ESlateVisibility TrueVisibility, ESlateVisibility FalseVisibility);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MVVMConversionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MVVMConversionLibrary")
	}
	static class UMVVMConversionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMConversionLibrary>();
	}
};
DUMPER7_ASSERTS_UMVVMConversionLibrary;

// Class ModelViewViewModel.MVVMModelInterface
// 0x0000 (0x0000 - 0x0000)
class IMVVMModelInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MVVMModelInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MVVMModelInterface")
	}
	static class IMVVMModelInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMVVMModelInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMVVMModelInterface;

// Class ModelViewViewModel.MVVMViewModelContextResolver
// 0x0000 (0x0028 - 0x0028)
class UMVVMViewModelContextResolver final : public UObject
{
public:
	TScriptInterface<class INotifyFieldValueChanged> K2_CreateInstance(const class UClass* ExpectedType, const class UUserWidget* UserWidget) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MVVMViewModelContextResolver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MVVMViewModelContextResolver")
	}
	static class UMVVMViewModelContextResolver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMViewModelContextResolver>();
	}
};
DUMPER7_ASSERTS_UMVVMViewModelContextResolver;

// Class ModelViewViewModel.MVVMGameSubsystem
// 0x0008 (0x0038 - 0x0030)
class UMVVMGameSubsystem final : public UGameInstanceSubsystem
{
public:
	class UMVVMViewModelCollectionObject*         ViewModelCollection;                               // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UMVVMViewModelCollectionObject* GetViewModelCollection() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MVVMGameSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MVVMGameSubsystem")
	}
	static class UMVVMGameSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMGameSubsystem>();
	}
};
DUMPER7_ASSERTS_UMVVMGameSubsystem;

// Class ModelViewViewModel.MVVMSubsystem
// 0x0000 (0x0030 - 0x0030)
class UMVVMSubsystem final : public UEngineSubsystem
{
public:
	bool DoesWidgetTreeContainedWidget(const class UWidgetTree* WidgetTree, const class UWidget* ViewWidget) const;
	class UMVVMViewModelCollectionObject* GetGlobalViewModelCollection() const;
	struct FMVVMAvailableBinding K2_GetAvailableBinding(const class UClass* Class_0, const struct FMVVMBindingName& BindingName, const class UClass* Accessor) const;
	TArray<struct FMVVMAvailableBinding> K2_GetAvailableBindings(const class UClass* Class_0, const class UClass* Accessor) const;
	class UMVVMView* K2_GetViewFromUserWidget(const class UUserWidget* UserWidget) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MVVMSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MVVMSubsystem")
	}
	static class UMVVMSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMSubsystem>();
	}
};
DUMPER7_ASSERTS_UMVVMSubsystem;

// Class ModelViewViewModel.MVVMViewModelBase
// 0x0040 (0x0068 - 0x0028)
class UMVVMViewModelBase : public UObject
{
public:
	uint8                                         Pad_28[0x40];                                      // 0x0028(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void K2_AddFieldValueChangedDelegate(const struct FFieldNotificationId& FieldId, TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> Delegate);
	void K2_BroadcastFieldValueChanged(const struct FFieldNotificationId& FieldId);
	void K2_RemoveFieldValueChangedDelegate(const struct FFieldNotificationId& FieldId, TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> Delegate);
	bool K2_SetPropertyValue(const int32& OldValue, const int32& NewValue);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MVVMViewModelBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MVVMViewModelBase")
	}
	static class UMVVMViewModelBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMViewModelBase>();
	}
};
DUMPER7_ASSERTS_UMVVMViewModelBase;

// Class ModelViewViewModel.MVVMViewModelCollectionObject
// 0x0038 (0x0060 - 0x0028)
class UMVVMViewModelCollectionObject final : public UObject
{
public:
	struct FMVVMViewModelCollection               ViewModelCollection;                               // 0x0028(0x0038)(Transient, NativeAccessSpecifierPrivate)

public:
	bool AddModelInstance(const struct FMVVMModelContext& Context, class UObject* Model);
	bool AddViewModelInstance(const struct FMVVMViewModelContext& Context, class UMVVMViewModelBase* viewModel);
	int32 RemoveAllViewModelInstance(class UMVVMViewModelBase* viewModel);
	bool RemoveModel(const struct FMVVMModelContext& Context);
	bool RemoveViewModel(const struct FMVVMViewModelContext& Context);

	class UMVVMViewModelBase* FindFirstViewModelInstanceOfType(const TSubclassOf<class UMVVMViewModelBase>& ViewModelClass) const;
	class UObject* FindModelInstance(const struct FMVVMModelContext& Context) const;
	class UMVVMViewModelBase* FindViewModelInstance(const struct FMVVMViewModelContext& Context) const;
	class UMVVMViewModelBase* FindViewModelInstanceByName(class FName Name_0) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MVVMViewModelCollectionObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MVVMViewModelCollectionObject")
	}
	static class UMVVMViewModelCollectionObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMViewModelCollectionObject>();
	}
};
DUMPER7_ASSERTS_UMVVMViewModelCollectionObject;

// Class ModelViewViewModel.MVVMViewModelBlueprintGeneratedClass
// 0x0000 (0x03C0 - 0x03C0)
class UMVVMViewModelBlueprintGeneratedClass final : public UBlueprintGeneratedClass
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MVVMViewModelBlueprintGeneratedClass")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MVVMViewModelBlueprintGeneratedClass")
	}
	static class UMVVMViewModelBlueprintGeneratedClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMViewModelBlueprintGeneratedClass>();
	}
};
DUMPER7_ASSERTS_UMVVMViewModelBlueprintGeneratedClass;

// Class ModelViewViewModel.MVVMBindingSubsystem
// 0x0060 (0x0090 - 0x0030)
class UMVVMBindingSubsystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_30[0x60];                                      // 0x0030(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MVVMBindingSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MVVMBindingSubsystem")
	}
	static class UMVVMBindingSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMBindingSubsystem>();
	}
};
DUMPER7_ASSERTS_UMVVMBindingSubsystem;

// Class ModelViewViewModel.MVVMEventListener
// 0x0010 (0x0038 - 0x0028)
class UMVVMEventListener final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnEventFired();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MVVMEventListener")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MVVMEventListener")
	}
	static class UMVVMEventListener* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMEventListener>();
	}
};
DUMPER7_ASSERTS_UMVVMEventListener;

// Class ModelViewViewModel.MVVMView
// 0x0098 (0x00C0 - 0x0028)
class UMVVMView final : public UUserWidgetExtension
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UMVVMViewClass*                         ClassExtension;                                    // 0x0040(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FMVVMViewSource>                Sources;                                           // 0x0048(0x0010)(Edit, ZeroConstructor, Transient, EditConst, NativeAccessSpecifierPrivate)
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bLogBinding;                                       // 0x0068(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bConstructed;                                      // 0x0069(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bSourcesInitialized;                               // 0x006A(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bBindingsInitialized;                              // 0x006B(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHasEveryTickBinding;                              // 0x006C(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, struct FMVVMEventListeners>       BindingEventListeners;                             // 0x0070(0x0050)(Transient, NativeAccessSpecifierPrivate)

public:
	void InitializeBindings();
	void InitializeSources();
	bool SetViewModel(class FName ViewModelName, TScriptInterface<class INotifyFieldValueChanged> viewModel);
	bool SetViewModelByClass(TScriptInterface<class INotifyFieldValueChanged> NewValue);
	void UninitializeBindings();
	void UninitializeSources();

	bool AreBindingsInitialized() const;
	bool AreSourcesInitialized() const;
	TScriptInterface<class INotifyFieldValueChanged> GetViewModel(class FName ViewModelName) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MVVMView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MVVMView")
	}
	static class UMVVMView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMView>();
	}
};
DUMPER7_ASSERTS_UMVVMView;

// Class ModelViewViewModel.MVVMViewClass
// 0x0088 (0x00B0 - 0x0028)
class UMVVMViewClass final : public UWidgetBlueprintGeneratedClassExtension
{
public:
	TArray<struct FMVVMViewClass_SourceCreator>   SourceCreators;                                    // 0x0028(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<struct FMVVMViewClass_CompiledBinding> CompiledBindings;                                  // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FMVVMCompiledBindingLibrary            BindingLibrary;                                    // 0x0048(0x0060)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_A8[0x4];                                       // 0x00A8(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bInitializeSourcesOnConstruct;                     // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bInitializeBindingsOnConstruct;                    // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AE[0x2];                                       // 0x00AE(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MVVMViewClass")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MVVMViewClass")
	}
	static class UMVVMViewClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMVVMViewClass>();
	}
};
DUMPER7_ASSERTS_UMVVMViewClass;

}

