#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PingDataContainer

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct PingDataContainer.PingDataContainer
// 0x0110 (0x0110 - 0x0000)
struct FPingDataContainer final
{
public:
	class UAnimMontage*                           Montage_2_76E3137D426510B8AAD83A971527A790;        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   ChatMessage_5_F0F4D78D4F0BF9C6DB3159BD8FD939DB;    // 0x0008(0x0010)(Edit, BlueprintVisible)
	class UAkAudioEvent*                          AkEvent_8_BE97E8C64FE41D55C5C1FE9F6FA4FD7F;        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            Icon_11_B51CB5D94FDFF053CB117196E03C0453;          // 0x0020(0x00D0)(Edit, BlueprintVisible)
	class UClass*                                 ActorClass_17_9E6F55254D7886656A55FA813A44081F;    // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MarkerColor_20_6F8382EE47952CE98C97CB93297418E6;   // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FPingDataContainer;

}

