#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayFabCommon

#include "Basic.hpp"


namespace SDK::Params
{

// Function PlayFabCommon.PlayFabAuthenticationContext.GetClientSessionTicket
// 0x0010 (0x0010 - 0x0000)
struct PlayFabAuthenticationContext_GetClientSessionTicket final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayFabAuthenticationContext_GetClientSessionTicket;

// Function PlayFabCommon.PlayFabAuthenticationContext.GetDeveloperSecretKey
// 0x0010 (0x0010 - 0x0000)
struct PlayFabAuthenticationContext_GetDeveloperSecretKey final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayFabAuthenticationContext_GetDeveloperSecretKey;

// Function PlayFabCommon.PlayFabAuthenticationContext.GetEntityToken
// 0x0010 (0x0010 - 0x0000)
struct PlayFabAuthenticationContext_GetEntityToken final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayFabAuthenticationContext_GetEntityToken;

// Function PlayFabCommon.PlayFabAuthenticationContext.GetPlayFabId
// 0x0010 (0x0010 - 0x0000)
struct PlayFabAuthenticationContext_GetPlayFabId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayFabAuthenticationContext_GetPlayFabId;

// Function PlayFabCommon.PlayFabAuthenticationContext.SetClientSessionTicket
// 0x0010 (0x0010 - 0x0000)
struct PlayFabAuthenticationContext_SetClientSessionTicket final
{
public:
	class FString                                 InTicket;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayFabAuthenticationContext_SetClientSessionTicket;

// Function PlayFabCommon.PlayFabAuthenticationContext.SetDeveloperSecretKey
// 0x0010 (0x0010 - 0x0000)
struct PlayFabAuthenticationContext_SetDeveloperSecretKey final
{
public:
	class FString                                 InKey;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayFabAuthenticationContext_SetDeveloperSecretKey;

// Function PlayFabCommon.PlayFabAuthenticationContext.SetEntityToken
// 0x0010 (0x0010 - 0x0000)
struct PlayFabAuthenticationContext_SetEntityToken final
{
public:
	class FString                                 InToken;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayFabAuthenticationContext_SetEntityToken;

// Function PlayFabCommon.PlayFabAuthenticationContext.SetPlayFabId
// 0x0010 (0x0010 - 0x0000)
struct PlayFabAuthenticationContext_SetPlayFabId final
{
public:
	class FString                                 InKey;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayFabAuthenticationContext_SetPlayFabId;

}

