#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerBase_Skeleton_AnimBP

#include "Basic.hpp"

#include "BlendStack_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Runtime_classes.hpp"
#include "AnimationWarpingRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "PlayerBase_Skeleton_AnimBP_structs.hpp"
#include "ControlRig_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SCCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "TurnInPlaceSettings_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass PlayerBase_Skeleton_AnimBP.PlayerBase_Skeleton_AnimBP_C
// 0xB0F0 (0xC5B0 - 0x14C0)
class UPlayerBase_Skeleton_AnimBP_C final : public URuntimeAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x14C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct PlayerBase_Skeleton_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;   // 0x14C8(0x00F0)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Tag;                        // 0x15B8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x15C0(0x0008)()
	struct FAnimSubsystemInstance_NodeRelevancy   AnimBlueprintExtension_NodeRelevancy;              // 0x15C8(0x00A8)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x1670(0x0008)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_12;                             // 0x1678(0x0148)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_11;                             // 0x17C0(0x0148)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_23;                      // 0x1908(0x01B8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_10;                             // 0x1AC0(0x0148)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x1C08(0x00D0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9;                              // 0x1CD8(0x0148)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8;                              // 0x1E20(0x0148)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_6;                        // 0x1F68(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_5;                        // 0x2438(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_22;                      // 0x2908(0x01B8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x2AC0(0x0048)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_21;                      // 0x2B08(0x01B8)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_4;                        // 0x2CC0(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x3190(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x3210(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x3238(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x3260(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x32A8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3;                  // 0x32D0(0x0190)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x3460(0x0058)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_20;                      // 0x34B8(0x01B8)()
	struct FAnimNode_CopyBones                    AnimGraphNode_CopyBones;                           // 0x3670(0x00F0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7;             // 0x3760(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7;             // 0x3780(0x0020)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_2;                   // 0x37A0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x37E8(0x0058)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x3840(0x0058)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x3898(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x38C0(0x0058)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x3918(0x0080)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_3;                        // 0x3998(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7;                              // 0x3E68(0x0148)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_2;          // 0x3FB0(0x0140)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x40F0(0x0080)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6;             // 0x4170(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6;             // 0x4190(0x0020)()
	struct FSCAnimNode_SaveBoneTransform          SCAnimGraphNode_SaveBoneTransform_2;               // 0x41B0(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x4298(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x42E0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x4308(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x4330(0x0028)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_1;          // 0x4358(0x0140)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x4498(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x4518(0x0028)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x4540(0x0048)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x4588(0x0140)()
	struct FSCAnimNode_SaveBoneTransform          SCAnimGraphNode_SaveBoneTransform_1;               // 0x46C8(0x00E8)()
	struct FSCAnimNode_SaveBoneTransform          SCAnimGraphNode_SaveBoneTransform;                 // 0x47B0(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x4898(0x0028)()
	struct FAnimNode_RotateRootBone               AnimGraphNode_RotateRootBone_7;                    // 0x48C0(0x00B0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x4970(0x0098)()
	struct FAnimNode_Mirror                       AnimGraphNode_Mirror_11;                           // 0x4A08(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x4A50(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0x4A98(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x4AE0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x4B08(0x0148)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5;             // 0x4C50(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5;             // 0x4C70(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x4C90(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x4CB8(0x0148)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_38;                 // 0x4E00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37;                 // 0x4E28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36;                 // 0x4E50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_35;                 // 0x4E78(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_34;                 // 0x4EA0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_33;                 // 0x4EC8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_32;                 // 0x4EF0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31;                 // 0x4F18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30;                 // 0x4F40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29;                 // 0x4F68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28;                 // 0x4F90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x4FB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26;                 // 0x4FE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x5008(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x5030(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x5058(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x5080(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x50A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x50D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x50F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x5120(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x5148(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x5170(0x0028)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_19;                      // 0x5198(0x01B8)()
	struct FAnimNode_SetSlotBlendMask             AnimGraphNode_SetSlotBlendMask_5;                  // 0x5350(0x0080)()
	struct FAnimNode_RotateRootBone               AnimGraphNode_RotateRootBone_6;                    // 0x53D0(0x00B0)()
	struct FAnimNode_Mirror                       AnimGraphNode_Mirror_10;                           // 0x5480(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_6;                 // 0x54C8(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_14;                      // 0x5518(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_18;                      // 0x5538(0x01B8)()
	struct FAnimNode_SetSlotBlendMask             AnimGraphNode_SetSlotBlendMask_4;                  // 0x56F0(0x0080)()
	struct FAnimNode_RotateRootBone               AnimGraphNode_RotateRootBone_5;                    // 0x5770(0x00B0)()
	struct FAnimNode_Mirror                       AnimGraphNode_Mirror_9;                            // 0x5820(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_5;                 // 0x5868(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13;                      // 0x58B8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x58D8(0x0028)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_17;                      // 0x5900(0x01B8)()
	struct FAnimNode_Mirror                       AnimGraphNode_Mirror_8;                            // 0x5AB8(0x0048)()
	struct FAnimNode_RotateRootBone               AnimGraphNode_RotateRootBone_4;                    // 0x5B00(0x00B0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;             // 0x5BB0(0x0020)()
	struct FAnimNode_StrideWarping                AnimGraphNode_StrideWarping_4;                     // 0x5BD0(0x0248)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;             // 0x5E18(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_4;                 // 0x5E38(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12;                      // 0x5E88(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_16;                      // 0x5EA8(0x01B8)()
	struct FAnimNode_Mirror                       AnimGraphNode_Mirror_7;                            // 0x6060(0x0048)()
	struct FAnimNode_RotateRootBone               AnimGraphNode_RotateRootBone_3;                    // 0x60A8(0x00B0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x6158(0x0020)()
	struct FAnimNode_StrideWarping                AnimGraphNode_StrideWarping_3;                     // 0x6178(0x0248)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x63C0(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_3;                 // 0x63E0(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x6430(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x6450(0x0028)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_15;                      // 0x6478(0x01B8)()
	struct FAnimNode_SetSlotBlendMask             AnimGraphNode_SetSlotBlendMask_3;                  // 0x6630(0x0080)()
	struct FAnimNode_Mirror                       AnimGraphNode_Mirror_6;                            // 0x66B0(0x0048)()
	struct FAnimNode_RotateRootBone               AnimGraphNode_RotateRootBone_2;                    // 0x66F8(0x00B0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x67A8(0x0020)()
	struct FAnimNode_StrideWarping                AnimGraphNode_StrideWarping_2;                     // 0x67C8(0x0248)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x6A10(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_2;                 // 0x6A30(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x6A80(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_14;                      // 0x6AA0(0x01B8)()
	struct FAnimNode_SetSlotBlendMask             AnimGraphNode_SetSlotBlendMask_2;                  // 0x6C58(0x0080)()
	struct FAnimNode_Mirror                       AnimGraphNode_Mirror_5;                            // 0x6CD8(0x0048)()
	struct FAnimNode_RotateRootBone               AnimGraphNode_RotateRootBone_1;                    // 0x6D20(0x00B0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x6DD0(0x0020)()
	struct FAnimNode_StrideWarping                AnimGraphNode_StrideWarping_1;                     // 0x6DF0(0x0248)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x7038(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x7058(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x70A8(0x0020)()
	struct FAnimNode_Mirror                       AnimGraphNode_Mirror_4;                            // 0x70C8(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x7110(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x7160(0x0020)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_2;                        // 0x7180(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_13;                      // 0x7650(0x01B8)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_12;                      // 0x7808(0x01B8)()
	struct FAnimNode_RotateRootBone               AnimGraphNode_RotateRootBone;                      // 0x79C0(0x00B0)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_11;                      // 0x7A70(0x01B8)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x7C28(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_10;                      // 0x7C48(0x01B8)()
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_1;               // 0x7E00(0x00A0)()
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator;                 // 0x7EA0(0x00A0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x7F40(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x8008(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x80D0(0x0148)()
	struct FAnimNode_BlendStack                   AnimGraphNode_BlendStack_5;                        // 0x8218(0x0130)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x8348(0x0190)()
	struct FAnimNode_BlendStack                   AnimGraphNode_BlendStack_4;                        // 0x84D8(0x0130)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x8608(0x0190)()
	struct FAnimNode_BlendStack                   AnimGraphNode_BlendStack_3;                        // 0x8798(0x0130)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_9;                       // 0x88C8(0x01B8)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_8;                       // 0x8A80(0x01B8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x8C38(0x0148)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x8D80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x8DA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x8DD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x8DF8(0x0028)()
	struct FAnimNode_BlendStack                   AnimGraphNode_BlendStack_2;                        // 0x8E20(0x0130)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x8F50(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x8F70(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x8F98(0x0148)()
	struct FAnimNode_BlendStack                   AnimGraphNode_BlendStack_1;                        // 0x90E0(0x0130)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_7;                       // 0x9210(0x01B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x93C8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x93E8(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x94B0(0x0148)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x95F8(0x0190)()
	struct FAnimNode_SetSlotBlendMask             AnimGraphNode_SetSlotBlendMask_1;                  // 0x9788(0x0080)()
	struct FAnimNode_SetSlotBlendMask             AnimGraphNode_SetSlotBlendMask;                    // 0x9808(0x0080)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_6;                       // 0x9888(0x01B8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x9A40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x9A68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x9A90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x9AB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x9AE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x9B08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x9B30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x9B58(0x0028)()
	struct FAnimNode_Mirror                       AnimGraphNode_Mirror_3;                            // 0x9B80(0x0048)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_5;                       // 0x9BC8(0x01B8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x9D80(0x0058)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x9DD8(0x0020)()
	struct FAnimNode_Mirror                       AnimGraphNode_Mirror_2;                            // 0x9DF8(0x0048)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_4;                       // 0x9E40(0x01B8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x9FF8(0x0058)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0xA050(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0xA070(0x0028)()
	struct FAnimNode_Mirror                       AnimGraphNode_Mirror_1;                            // 0xA098(0x0048)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_3;                       // 0xA0E0(0x01B8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0xA298(0x0058)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0xA2F0(0x0020)()
	struct FAnimNode_Mirror                       AnimGraphNode_Mirror;                              // 0xA310(0x0048)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_2;                       // 0xA358(0x01B8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0xA510(0x0058)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0xA568(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_1;                       // 0xA588(0x01B8)()
	struct FAnimNode_BlendStack                   AnimGraphNode_BlendStack;                          // 0xA740(0x0130)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0xA870(0x0148)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve;                         // 0xA9B8(0x01B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0xAB70(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0xAB90(0x00C8)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0xAC58(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0xACA0(0x0020)()
	struct FAnimNode_StrideWarping                AnimGraphNode_StrideWarping;                       // 0xACC0(0x0248)()
	uint8                                         Pad_AF08[0x8];                                     // 0xAF08(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_OrientationWarping           AnimGraphNode_OrientationWarping;                  // 0xAF10(0x0220)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0xB130(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0xB150(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0xB218(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0xB260(0x0020)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_1;                        // 0xB280(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0xB750(0x04D0)(ContainsInstancedReference)
	struct FVector                                K2Node_PropertyAccess_16;                          // 0xBC20(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_PropertyAccess_15;                          // 0xBC38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC3C[0x4];                                     // 0xBC3C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               K2Node_PropertyAccess_14;                          // 0xBC40(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_PropertyAccess_13;                          // 0xBC58(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_12;                          // 0xBC70(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_11;                          // 0xBC71(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_10;                          // 0xBC72(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_9;                           // 0xBC73(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_8;                           // 0xBC74(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_7;                           // 0xBC75(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_6;                           // 0xBC76(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_5;                           // 0xBC77(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_4;                           // 0xBC78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_3;                           // 0xBC79(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESCCharacterSpeedState                        K2Node_PropertyAccess_2;                           // 0xBC7A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bActivateDeflect_807791AA4B9E95B18AA14EA265FEB48A; // 0xBC7B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC7C[0x4];                                     // 0xBC7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                __CustomProperty_vWorldDirection_807791AA4B9E95B18AA14EA265FEB48A; // 0xBC80(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_IsHead_3D5337E9418BCCC74726C3A070CCDD91; // 0xBC98(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_IsLockMove_3D5337E9418BCCC74726C3A070CCDD91; // 0xBC99(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC9A[0x6];                                     // 0xBC9A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               __CustomProperty_Rotator_3D5337E9418BCCC74726C3A070CCDD91; // 0xBCA0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          __CustomProperty_IsLockMove_11D210E746323DC158FBC4AF42B7FB23; // 0xBCB8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BCB9[0x7];                                     // 0xBCB9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               __CustomProperty_Rotator_11D210E746323DC158FBC4AF42B7FB23; // 0xBCC0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          __CustomProperty_IsLockMove_6848AA8641F0638E17A7609A605E2EF8; // 0xBCD8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BCD9[0x7];                                     // 0xBCD9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               __CustomProperty_Rotator_6848AA8641F0638E17A7609A605E2EF8; // 0xBCE0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESCCharacterSpeedState                        K2Node_PropertyAccess_1;                           // 0xBCF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BCF9[0x7];                                     // 0xBCF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                __CustomProperty_TargetOffset_28E5CDD2475B0A0D6F1B6389B7B49B76; // 0xBD00(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_PropertyAccess;                             // 0xBD18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARuntimeCharacter*                      RuntimeCharacterReference;                         // 0xBD20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          bIsRuntimeCharacterValid;                          // 0xBD28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GPT_IsLocking;                                     // 0xBD29(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD2A[0x6];                                     // 0xBD2A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CurrentVelocity;                                   // 0xBD30(0x0018)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PreviousVelocity;                                  // 0xBD48(0x0018)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Acceleration;                                      // 0xBD60(0x0018)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            SprintCurve;                                       // 0xBD78(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          GPT_IsSprinting;                                   // 0xBD80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD81[0x7];                                     // 0xBD81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SprintTimeElapsed;                                 // 0xBD88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SprintLeanAmount;                                  // 0xBD90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SprintStrideFrequency;                             // 0xBD94(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            SprintStrideCurve;                                 // 0xBD98(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Relative_Acceleration_Delta;                       // 0xBDA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GPT_IsWallRunning;                                 // 0xBDA8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsWallLeftSide;                                   // 0xBDA9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GPT_IsInLockMove;                                  // 0xBDAA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BDAB[0x5];                                     // 0xBDAB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentSpeed;                                      // 0xBDB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentOrientationToVelocityAngle;                 // 0xBDB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 FallbackSpeedDescriptionDB;                        // 0xBDC0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          GPT_HasBall;                                       // 0xBDC8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFalling;                                        // 0xBDC9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BDCA[0x6];                                     // 0xBDCA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSequencePlayInfos                 FallAnimPlayInfos;                                 // 0xBDD0(0x0130)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	class FName                                   GroundDistanceCurveName;                           // 0xBF00(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 DefaultFallLoopTargetDatasource;                   // 0xBF08(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bProceduralAnimationEnabled;                       // 0xBF10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BF11[0x7];                                     // 0xBF11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 DefaultLandingTargetDatasource;                    // 0xBF18(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CurrentLandingTargetDatasource;                    // 0xBF20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             FloorHitResultAtFallingStart;                      // 0xBF28(0x00F8)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          bIsFallMirrored;                                   // 0xC020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C021[0x7];                                     // 0xC021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DisableProceduralAnimAlpha;                        // 0xC028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseStopAState;                                    // 0xC030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseStartAState;                                   // 0xC031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseTurnAState;                                    // 0xC032(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C033[0x5];                                     // 0xC033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 FreeToLockTransitionDB;                            // 0xC038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 LockToFreeTransitionDB;                            // 0xC040(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   ProceduralAnimAlphaCurveName;                      // 0xC048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HinderingRollLeanBlendSpace;                       // 0xC050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LeanDirection;                                     // 0xC058(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PrevLeanDirection;                                 // 0xC070(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GPT_IsOutOfStamina;                                // 0xC088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bForceLookAtDisabled;                              // 0xC089(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C08A[0x6];                                     // 0xC08A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PreviousRelativeAcceleration;                      // 0xC090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSCLookAtTargetEnumHandler             LastOwnedBallLookAtTargetType;                     // 0xC098(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         SpeedChangeStateIndex;                             // 0xC0E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GPT_IsGoalKeeper;                                  // 0xC0EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GPT_IsInvulnerable;                                // 0xC0ED(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GPT_IsGoalScorer;                                  // 0xC0EE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C0EF[0x1];                                     // 0xC0EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HinderingRotation;                                 // 0xC0F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HinderingNormalizedProximity;                      // 0xC0F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HinderingActive;                                   // 0xC0F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C0F9[0x7];                                     // 0xC0F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CurrentLocomotionDatasource;                       // 0xC100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bLocomotionDatasourceDirty;                        // 0xC108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GPT_IsTeamScorer;                                  // 0xC109(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C10A[0x6];                                     // 0xC10A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSequencePlayInfos                 CountdownAnimInfos;                                // 0xC110(0x0130)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	TArray<class UAnimSequence*>                  CountdownAnimArray;                                // 0xC240(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	double                                        CountdownAnimPlayRate;                             // 0xC250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CountdownStartPosition;                            // 0xC258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            HinderingBlendSpace;                               // 0xC260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         SpeedChangeStartTimeHack;                          // 0xC268(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          bUseSpeedChange0State;                             // 0xC26C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseSpeedChange1State;                             // 0xC26D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseSpeedChange2State;                             // 0xC26E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseSpeedChange3State;                             // 0xC26F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CountdownMontagePlaying;                           // 0xC270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        HinderingPitchLeanBlendSpace;                      // 0xC278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsDedicatedServer;                                // 0xC280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C281[0x7];                                     // 0xC281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LocoRollLeanBlendSpace;                            // 0xC288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LocoPitchLeanBlendSpace;                           // 0xC290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldPlayPostActionLean;                         // 0xC298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C299[0x7];                                     // 0xC299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentStamina;                                    // 0xC2A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxStamina;                                        // 0xC2A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSCAlphaBlendArgs                      InvStaminaRatioToLean;                             // 0xC2B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor)
	bool                                          bDisablePlayPostActionOnNextTick;                  // 0xC2C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2C1[0x7];                                     // 0xC2C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARuntimeMatchGameState*                 As_Game_State;                                     // 0xC2C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          GPT_HasBallInHand;                                 // 0xC2D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2D1[0x7];                                     // 0xC2D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LocoPlayRate;                                      // 0xC2D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BreathingAlpha;                                    // 0xC2E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BreathingPlayRate;                                 // 0xC2E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRuntimeFloatCurve                     StaminaRatioToBreathingPlayRateCurve;              // 0xC2F0(0x0088)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FGameplayTagContainer                  SeedChangingTagContainer;                          // 0xC378(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                          GPT_IsInVolleyPadding;                             // 0xC398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsHinderingUpperBodyActive;                       // 0xC399(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsHinderingLeftUpperBodyActive;                   // 0xC39A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsHinderingRightUpperBodyActive;                  // 0xC39B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TurnInPlaceSlotName;                               // 0xC39C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FreezeRotationCurveName;                           // 0xC3A4(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TurnInYawCurveName;                                // 0xC3AC(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TurnInWeightCurveName;                             // 0xC3B4(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3BC[0x4];                                     // 0xC3BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FallbackMaxYawRootOffset;                          // 0xC3C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxYawRootOffset;                                  // 0xC3C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TargetWorldYawInIdle;                              // 0xC3D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BlendInStartWorldYawInIdle;                        // 0xC3D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TargetYawRootOffsetInIdle;                         // 0xC3E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        YawRootOffsetInIdle;                               // 0xC3E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSequencePlayInfos                 CurrentTurnInPlacePlayInfos;                       // 0xC3F0(0x0130)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	double                                        OutOfStaminaPlayRateMin;                           // 0xC520(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OutOfStaminaLeanMultiplier;                        // 0xC528(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      CachedIdleAtCurrentTurnInPlaceSettings;            // 0xC530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTurnInPlaceSettings                   CurrentTurnInPlaceSettings;                        // 0xC538(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, HasGetValueTypeHash)
	double                                        TriggerTurnInPlaceAtMinYawOffset;                  // 0xC548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTurnInPlaceDataAsset_C*                TurnInPlaceDataAsset;                              // 0xC550(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnterIdleAnimValid;                             // 0xC558(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C559[0x7];                                     // 0xC559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          EnterIdleAnimSequence;                             // 0xC560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterruptIdleByEnterIdle;                         // 0xC568(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C569[0x7];                                     // 0xC569(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          IdleDuringEnterIdle;                               // 0xC570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
