#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerBase_IK_CtrlRig

#include "Basic.hpp"

#include "ControlRig_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "PBIK_structs.hpp"


namespace SDK
{

// RigVMBlueprintGeneratedClass PlayerBase_IK_CtrlRig.PlayerBase_IK_CtrlRig_C
// 0x01F8 (0x0CA0 - 0x0AA8)
class UPlayerBase_IK_CtrlRig_C final : public UControlRig
{
public:
	double                                        hand_L_blend;                                      // 0x0AA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        hand_R_blend;                                      // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        head_blend;                                        // 0x0AB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_L_blend;                                      // 0x0AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_R_blend;                                      // 0x0AC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        pelvis_blend;                                      // 0x0AD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ball_blend;                                        // 0x0AD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetOffset;                                      // 0x0AE0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKEffector>                  Effectors;                                         // 0x0AF8(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	TArray<struct FPBIKEffector>                  HandsEffectors;                                    // 0x0B08(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	bool                                          bNeedsFullbodyIK;                                  // 0x0B18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNeedsHandsCCDIk;                                  // 0x0B19(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1A[0x2];                                      // 0x0B1A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CurrentBone;                                       // 0x0B1C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentIkClampingRefBone;                          // 0x0B24(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2C[0x4];                                      // 0x0B2C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentBlend;                                      // 0x0B30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentPin;                                        // 0x0B38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CurrentTransform;                                  // 0x0B40(0x0060)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           Bones;                                             // 0x0BA0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           IkClampingRefBones;                                // 0x0BB0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        hand_L_pin;                                        // 0x0BC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        hand_R_pin;                                        // 0x0BC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        head_pin;                                          // 0x0BD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_L_pin;                                        // 0x0BD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        foot_R_pin;                                        // 0x0BE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        pelvis_pin;                                        // 0x0BE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                pre_ik_legs;                                       // 0x0BF0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        spine_compensator;                                 // 0x0C08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTransform>                     extremity_position;                                // 0x0C10(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	TArray<struct FTransform>                     extremity_up;                                      // 0x0C20(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	TArray<struct FTransform>                     pre_ik_local_foots;                                // 0x0C30(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	float                                         Weight;                                            // 0x0C40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C44[0xC];                                      // 0x0C44(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  pre_spine_rot;                                     // 0x0C50(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigSpaceTargetOffset;                              // 0x0C70(0x0018)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTransform>                     PreIkLocalHands;                                   // 0x0C88(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PlayerBase_IK_CtrlRig_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlayerBase_IK_CtrlRig_C")
	}
	static class UPlayerBase_IK_CtrlRig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerBase_IK_CtrlRig_C>();
	}
};
DUMPER7_ASSERTS_UPlayerBase_IK_CtrlRig_C;

}

