#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayFabCommon

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class PlayFabCommon.PlayFabAuthenticationContext
// 0x0040 (0x0068 - 0x0028)
class UPlayFabAuthenticationContext final : public UObject
{
public:
	class FString                                 ClientSessionTicket;                               // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 EntityToken;                                       // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 DeveloperSecretKey;                                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 PlayFabId;                                         // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ForgetAllCredentials();
	class FString GetClientSessionTicket();
	class FString GetDeveloperSecretKey();
	class FString GetEntityToken();
	class FString GetPlayFabId();
	void SetClientSessionTicket(const class FString& InTicket);
	void SetDeveloperSecretKey(const class FString& InKey);
	void SetEntityToken(const class FString& InToken);
	void SetPlayFabId(const class FString& InKey);

	void ClientAdminSecurityCheck() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlayFabAuthenticationContext")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlayFabAuthenticationContext")
	}
	static class UPlayFabAuthenticationContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayFabAuthenticationContext>();
	}
};
DUMPER7_ASSERTS_UPlayFabAuthenticationContext;

// Class PlayFabCommon.PlayFabRuntimeSettings
// 0x0030 (0x0058 - 0x0028)
class UPlayFabRuntimeSettings final : public UObject
{
public:
	class FString                                 ProductionEnvironmentURL;                          // 0x0028(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TitleId;                                           // 0x0038(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DeveloperSecretKey;                                // 0x0048(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlayFabRuntimeSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlayFabRuntimeSettings")
	}
	static class UPlayFabRuntimeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayFabRuntimeSettings>();
	}
};
DUMPER7_ASSERTS_UPlayFabRuntimeSettings;

}

