#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PredictionMarkerData

#include "Basic.hpp"

#include "EnumPredictionMarkerType_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct PredictionMarkerData.PredictionMarkerData
// 0x0048 (0x0048 - 0x0000)
struct FPredictionMarkerData final
{
public:
	EnumPredictionMarkerType                      Type_9_07ADC00F48E4BB277571B0882279C0A2;           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Pos_10_4CE7A2AF4797FA587084A7AC66EA0932;           // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Normal_11_9FA2B5C04035CAB57AA326BEF6C8AF03;        // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Time_14_D1E015B040EDCE5D3EEF089187F5328D;          // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FXid_17_7A6FBB044CCDEE964D6B3A9AB6580F90;          // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FPredictionMarkerData;

}

