#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Runtime

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "SCCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "NetCore_structs.hpp"
#include "SlateCore_structs.hpp"
#include "SCCharacterCustomization_structs.hpp"
#include "StructUtils_structs.hpp"
#include "MovieScene_structs.hpp"
#include "SOS_structs.hpp"


namespace SDK
{

// Enum Runtime.ESimulationStep
// NumValues: 0x0007
enum class ESimulationStep : uint8
{
	Unknown                                  = 0,
	Flying                                   = 1,
	Rolling                                  = 2,
	NotMoving                                = 3,
	Freezing                                 = 4,
	Custom                                   = 5,
	ESimulationStep_MAX                      = 6,
};

// Enum Runtime.EBallInteractionType
// NumValues: 0x0004
enum class EBallInteractionType : uint8
{
	Possess                                  = 0,
	Volley                                   = 1,
	NoOwnership                              = 2,
	EBallInteractionType_MAX                 = 3,
};

// Enum Runtime.EClutchTimeState
// NumValues: 0x0007
enum class EClutchTimeState : uint8
{
	None                                     = 0,
	WaitingOwnership                         = 1,
	LastShot                                 = 2,
	LastAction                               = 3,
	Finished                                 = 4,
	Count                                    = 5,
	EClutchTimeState_MAX                     = 6,
};

// Enum Runtime.EBounceHit
// NumValues: 0x0008
enum class EBounceHit : uint8
{
	Ground                                   = 0,
	Wall                                     = 1,
	Ceiling                                  = 2,
	Post                                     = 3,
	Net                                      = 4,
	Count                                    = 5,
	None                                     = 6,
	EBounceHit_MAX                           = 7,
};

// Enum Runtime.EBallCaptureSource
// NumValues: 0x0005
enum class EBallCaptureSource : uint8
{
	AutoCaptureCapsule                       = 0,
	TackleHitBox                             = 1,
	Count                                    = 2,
	None                                     = 3,
	EBallCaptureSource_MAX                   = 4,
};

// Enum Runtime.EBallInteractionRequestResultType
// NumValues: 0x0005
enum class EBallInteractionRequestResultType : uint8
{
	None                                     = 0,
	Granted                                  = 1,
	Refused                                  = 2,
	Count                                    = 3,
	EBallInteractionRequestResultType_MAX    = 4,
};

// Enum Runtime.ESyncState
// NumValues: 0x0005
enum class ESyncState : uint8
{
	Sleep                                    = 0,
	Listen                                   = 1,
	Sync                                     = 2,
	Waiting                                  = 3,
	ESyncState_MAX                           = 4,
};

// Enum Runtime.EAbilityTaskNetWaitType
// NumValues: 0x0003
enum class EAbilityTaskNetWaitType : uint8
{
	ServerWait                               = 0,
	ClientWait                               = 1,
	EAbilityTaskNetWaitType_MAX              = 2,
};

// Enum Runtime.EBallInteractionPlayerInvolvedType
// NumValues: 0x0004
enum class EBallInteractionPlayerInvolvedType : uint8
{
	OnlyIfPlayerIsNewOrPreviousOwner         = 0,
	OnlyIfPlayerIsNewOwner                   = 1,
	Always                                   = 2,
	EBallInteractionPlayerInvolvedType_MAX   = 3,
};

// Enum Runtime.EBallInteractionRequestType
// NumValues: 0x0007
enum class EBallInteractionRequestType : uint8
{
	Unspecified                              = 0,
	VolleyPushBall                           = 1,
	VolleyShoot                              = 2,
	VolleyTap                                = 3,
	Hit                                      = 4,
	Count                                    = 5,
	EBallInteractionRequestType_MAX          = 6,
};

// Enum Runtime.EBallInteractionOwnerRole
// NumValues: 0x0005
enum class EBallInteractionOwnerRole : uint8
{
	Unspecified                              = 0,
	GoalKeeper                               = 1,
	Sweeper                                  = 2,
	Count                                    = 3,
	EBallInteractionOwnerRole_MAX            = 4,
};

// Enum Runtime.EValueSignType
// NumValues: 0x0003
enum class EValueSignType : uint8
{
	Absolute                                 = 0,
	Raw                                      = 1,
	EValueSignType_MAX                       = 2,
};

// Enum Runtime.EBallReceptionArea
// NumValues: 0x0007
enum class EBallReceptionArea : uint8
{
	Feet                                     = 0,
	Thigh                                    = 1,
	Chest                                    = 2,
	ChestJump                                = 3,
	HeadJump                                 = 4,
	Count                                    = 5,
	EBallReceptionArea_MAX                   = 6,
};

// Enum Runtime.EPaletteType
// NumValues: 0x0004
enum class EPaletteType : uint8
{
	Home                                     = 0,
	Away                                     = 1,
	Both                                     = 2,
	EPaletteType_MAX                         = 3,
};

// Enum Runtime.ECrowdSoundState
// NumValues: 0x0006
enum class ECrowdSoundState : uint8
{
	Default                                  = 0,
	Stagnation                               = 1,
	PostReaction                             = 2,
	Prematch                                 = 3,
	Count                                    = 4,
	ECrowdSoundState_MAX                     = 5,
};

// Enum Runtime.EShopItemFilterActivationType
// NumValues: 0x0003
enum class EShopItemFilterActivationType : uint8
{
	Manual                                   = 0,
	Automatic                                = 1,
	EShopItemFilterActivationType_MAX        = 2,
};

// Enum Runtime.EDiveDetectionCase
// NumValues: 0x0006
enum class EDiveDetectionCase : uint8
{
	Invalid                                  = 0,
	Generic                                  = 1,
	Up                                       = 2,
	OwnedBall                                = 3,
	Fallback                                 = 4,
	EDiveDetectionCase_MAX                   = 5,
};

// Enum Runtime.EExperienceElementType
// NumValues: 0x0003
enum class EExperienceElementType : uint8
{
	Amount                                   = 0,
	Multiplier                               = 1,
	EExperienceElementType_MAX               = 2,
};

// Enum Runtime.ETriggerConditionGoalScoredBinder
// NumValues: 0x0005
enum class ETriggerConditionGoalScoredBinder : uint8
{
	None                                     = 0,
	LocalPlayer                              = 1,
	Ally                                     = 2,
	Enemy                                    = 3,
	ETriggerConditionGoalScoredBinder_MAX    = 4,
};

// Enum Runtime.EInterceptionTargetType
// NumValues: 0x0006
enum class EInterceptionTargetType : uint8
{
	Locked                                   = 0,
	Unlocked                                 = 1,
	AlliedFuture                             = 2,
	Count                                    = 3,
	None                                     = 4,
	EInterceptionTargetType_MAX              = 5,
};

// Enum Runtime.ELevelSequenceFlowStateType
// NumValues: 0x0004
enum class ELevelSequenceFlowStateType : uint8
{
	Dynamic                                  = 0,
	Defined                                  = 1,
	GameplayTag                              = 2,
	ELevelSequenceFlowStateType_MAX          = 3,
};

// Enum Runtime.EEmitterSelectionType
// NumValues: 0x0004
enum class EEmitterSelectionType : uint8
{
	None                                     = 0,
	All                                      = 1,
	Pick                                     = 2,
	EEmitterSelectionType_MAX                = 3,
};

// Enum Runtime.ECrowdIntensityActionType
// NumValues: 0x0004
enum class ECrowdIntensityActionType : uint8
{
	Override                                 = 0,
	Add                                      = 1,
	ResetToDefault                           = 2,
	ECrowdIntensityActionType_MAX            = 3,
};

// Enum Runtime.EEvaluationStartTimeOption
// NumValues: 0x0006
enum class EEvaluationStartTimeOption : uint8
{
	Undefined                                = 0,
	DefaultAnimRatio                         = 1,
	NotifyStateSection                       = 2,
	FloatTargetData_CurrentMontageTime       = 3,
	ActorLocationTargetTime                  = 4,
	EEvaluationStartTimeOption_MAX           = 5,
};

// Enum Runtime.EEvaluationDurationOption
// NumValues: 0x0006
enum class EEvaluationDurationOption : uint8
{
	Undefined                                = 0,
	DefaultDuration                          = 1,
	NotifyStateSection                       = 2,
	TillAbilityMontageEnd                    = 3,
	TillActorLocationTargetTime              = 4,
	EEvaluationDurationOption_MAX            = 5,
};

// Enum Runtime.ETimingEvaluationMethod
// NumValues: 0x0006
enum class ETimingEvaluationMethod : uint32
{
	Undefined                                = 0,
	TargetTime                               = 1,
	Section                                  = 2,
	FromCurrentMontage                       = 3,
	DefaultRatio                             = 4,
	ETimingEvaluationMethod_MAX              = 5,
};

// Enum Runtime.ETimeConversionUnit
// NumValues: 0x0003
enum class ETimeConversionUnit : uint8
{
	Seconds                                  = 0,
	Minutes                                  = 1,
	ETimeConversionUnit_MAX                  = 2,
};

// Enum Runtime.EVoiceChatOptions
// NumValues: 0x0004
enum class EVoiceChatOptions : uint8
{
	Disabled                                 = 0,
	MutedOnly                                = 1,
	Enabled                                  = 2,
	EVoiceChatOptions_MAX                    = 3,
};

// Enum Runtime.EPlayerProfileUserDefinedEnums
// NumValues: 0x0003
enum class EPlayerProfileUserDefinedEnums : uint8
{
	Category                                 = 0,
	Count                                    = 1,
	EPlayerProfileUserDefinedEnums_MAX       = 2,
};

// Enum Runtime.EPlayerProfileCategory
// NumValues: 0x0007
enum class EPlayerProfileCategory : uint8
{
	Pose                                     = 0,
	Background                               = 1,
	Avatar                                   = 2,
	Banner                                   = 3,
	Title                                    = 4,
	Count                                    = 5,
	EPlayerProfileCategory_MAX               = 6,
};

// Enum Runtime.EPlayerProfileCategoryType
// NumValues: 0x0006
enum class EPlayerProfileCategoryType : uint8
{
	None                                     = 0,
	Text                                     = 1,
	Texture                                  = 2,
	Pose                                     = 3,
	Count                                    = 4,
	EPlayerProfileCategoryType_MAX           = 5,
};

// Enum Runtime.ERelationshipType
// NumValues: 0x0004
enum class ERelationshipType : uint8
{
	Any                                      = 0,
	Ally                                     = 1,
	Opponent                                 = 2,
	ERelationshipType_MAX                    = 3,
};

// Enum Runtime.ERematchWelcomeFlowContentType
// NumValues: 0x0007
enum class ERematchWelcomeFlowContentType : uint8
{
	None                                     = 0,
	News                                     = 1,
	SeasonStart                              = 2,
	SeasonEnd                                = 3,
	SeasonEndWarning                         = 4,
	Count                                    = 5,
	ERematchWelcomeFlowContentType_MAX       = 6,
};

// Enum Runtime.EExpectedApiTestResult
// NumValues: 0x0003
enum class EExpectedApiTestResult : uint8
{
	Failure                                  = 0,
	Success                                  = 1,
	EExpectedApiTestResult_MAX               = 2,
};

// Enum Runtime.ETargetInvolvedOptions
// NumValues: 0x0004
enum class ETargetInvolvedOptions : uint8
{
	Scorer                                   = 0,
	ScoredBall                               = 1,
	GoalConceded                             = 2,
	ETargetInvolvedOptions_MAX               = 3,
};

// Enum Runtime.ESCTransitionState
// NumValues: 0x0005
enum class ESCTransitionState : uint8
{
	Hidden                                   = 0,
	Translucent                              = 1,
	Masked                                   = 2,
	Opaque                                   = 3,
	ESCTransitionState_MAX                   = 4,
};

// Enum Runtime.EAITeamOnSpawn
// NumValues: 0x0004
enum class EAITeamOnSpawn : uint8
{
	AsTeammate                               = 0,
	AsOpponent                               = 1,
	Fair                                     = 2,
	EAITeamOnSpawn_MAX                       = 3,
};

// Enum Runtime.EForceType
// NumValues: 0x0004
enum class EForceType : uint8
{
	Force                                    = 0,
	UpRotationForce                          = 1,
	RightRotationForce                       = 2,
	EForceType_MAX                           = 3,
};

// Enum Runtime.EExecSuccessEnum
// NumValues: 0x0003
enum class EExecSuccessEnum : uint8
{
	Success                                  = 0,
	OperationFailed                          = 1,
	EExecSuccessEnum_MAX                     = 2,
};

// Enum Runtime.ERuntimeGameFlowTravelTeamComposition
// NumValues: 0x0006
enum class ERuntimeGameFlowTravelTeamComposition : uint8
{
	Solo                                     = 0,
	Team                                     = 1,
	All                                      = 2,
	AllClients                               = 3,
	None                                     = 4,
	ERuntimeGameFlowTravelTeamComposition_MAX = 5,
};

// Enum Runtime.EUserDefinedEnums
// NumValues: 0x0004
enum class EUserDefinedEnums : uint8
{
	Dummy                                    = 0,
	GameModeParams                           = 1,
	Count                                    = 2,
	EUserDefinedEnums_MAX                    = 3,
};

// Enum Runtime.ESpawnerType
// NumValues: 0x0004
enum class ESpawnerType : uint8
{
	Cycling                                  = 0,
	Prematch                                 = 1,
	Unused                                   = 2,
	ESpawnerType_MAX                         = 3,
};

// Enum Runtime.ECageType
// NumValues: 0x0003
enum class ECageType : uint8
{
	Default                                  = 0,
	FireBall                                 = 1,
	ECageType_MAX                            = 2,
};

// Enum Runtime.EMatchPartKickOffType
// NumValues: 0x0004
enum class EMatchPartKickOffType : uint8
{
	Cycle                                    = 0,
	LosingTeam                               = 1,
	LastConcedingTeam                        = 2,
	EMatchPartKickOffType_MAX                = 3,
};

// Enum Runtime.ERuntimeMatchParameterTypes
// NumValues: 0x001A
enum class ERuntimeMatchParameterTypes : uint8
{
	AllowAI                                  = 0,
	TeamSize                                 = 1,
	MatchDuration                            = 2,
	OvertimeMaxDuration                      = 3,
	CountdownDuration                        = 4,
	ScoreToReach                             = 5,
	TieBreakPoints                           = 6,
	NoInterrupt                              = 7,
	SpawnerReroll                            = 8,
	Momentum                                 = 9,
	GoalKeeper                               = 10,
	Sweeper                                  = 11,
	UserBitmask                              = 12,
	MapIndex                                 = 13,
	ForceTeamColor                           = 14,
	KickAfkPlayers                           = 15,
	ClutchTime                               = 16,
	MaxSpectatorCount                        = 17,
	EnablePerfSession                        = 18,
	PerfSessionExternalProfiler              = 19,
	GlobalVoiceChat                          = 20,
	BallCount                                = 21,
	GameMode                                 = 22,
	AllowNegativeScore                       = 23,
	Count                                    = 24,
	ERuntimeMatchParameterTypes_MAX          = 25,
};

// Enum Runtime.ERuntimeMatchState
// NumValues: 0x000A
enum class ERuntimeMatchState : uint8
{
	EnteringMap                              = 0,
	WaitingToStart                           = 1,
	InProgress                               = 2,
	WaitingPostMatch                         = 3,
	LeavingMap                               = 4,
	Aborted                                  = 5,
	PostGoal                                 = 6,
	Replay                                   = 7,
	Count                                    = 8,
	ERuntimeMatchState_MAX                   = 9,
};

// Enum Runtime.ERuntimeTransitionCameraType
// NumValues: 0x0004
enum class ERuntimeTransitionCameraType : uint8
{
	ToMenuCamera                             = 0,
	ToGameplayCamera                         = 1,
	None                                     = 2,
	ERuntimeTransitionCameraType_MAX         = 3,
};

// Enum Runtime.EMenuSequenceTransformType
// NumValues: 0x0005
enum class EMenuSequenceTransformType : uint8
{
	None                                     = 0,
	LocalCharacter                           = 1,
	Custom                                   = 2,
	StayTheSame                              = 3,
	EMenuSequenceTransformType_MAX           = 4,
};

// Enum Runtime.ERuntimeStatDataRangeActorType
// NumValues: 0x0004
enum class ERuntimeStatDataRangeActorType : uint8
{
	Custom                                   = 0,
	Ball                                     = 1,
	NearestOpponent                          = 2,
	ERuntimeStatDataRangeActorType_MAX       = 3,
};

// Enum Runtime.ERuntimeRequestedTargetType
// NumValues: 0x0006
enum class ERuntimeRequestedTargetType : uint8
{
	Trace                                    = 0,
	Player                                   = 1,
	Ball                                     = 2,
	Goal                                     = 3,
	CustomActorArray                         = 4,
	ERuntimeRequestedTargetType_MAX          = 5,
};

// Enum Runtime.ERuntimeRequestedTargetFilterType
// NumValues: 0x0005
enum class ERuntimeRequestedTargetFilterType : uint8
{
	All                                      = 0,
	AllVisible                               = 1,
	NearestFromViewportCenter                = 2,
	NearestFromCharacter                     = 3,
	ERuntimeRequestedTargetFilterType_MAX    = 4,
};

// Enum Runtime.EWelcomeFlowStep
// NumValues: 0x0009
enum class EWelcomeFlowStep : uint8
{
	None                                     = 0,
	EULA                                     = 1,
	SeasonEndWarning                         = 2,
	SeasonStart                              = 3,
	SeasonEnd                                = 4,
	News                                     = 5,
	RemappingReset                           = 6,
	Count                                    = 7,
	EWelcomeFlowStep_MAX                     = 8,
};

// Enum Runtime.EShootAnimState
// NumValues: 0x0006
enum class EShootAnimState : uint8
{
	BeginPriorityStretch                     = 0,
	EndPriorityStretch                       = 1,
	FreezeFrame                              = 2,
	MotionWarping                            = 3,
	Shoot                                    = 4,
	EShootAnimState_MAX                      = 5,
};

// Enum Runtime.EShootResult
// NumValues: 0x0003
enum class EShootResult : uint8
{
	NoResult                                 = 0,
	Aimed                                    = 1,
	EShootResult_MAX                         = 2,
};

// Enum Runtime.ELockDirectionOption
// NumValues: 0x0006
enum class ELockDirectionOption : uint8
{
	StartAbility                             = 0,
	ReleaseInput                             = 1,
	SyncClientServer                         = 2,
	FireTime                                 = 3,
	None                                     = 4,
	ELockDirectionOption_MAX                 = 5,
};

// Enum Runtime.EShootOrigin
// NumValues: 0x0004
enum class EShootOrigin : uint8
{
	Invalid                                  = 0,
	FromInput                                = 1,
	FromGameplayEvent                        = 2,
	EShootOrigin_MAX                         = 3,
};

// Enum Runtime.EForceComputation
// NumValues: 0x0004
enum class EForceComputation : uint8
{
	Current                                  = 0,
	Ratio                                    = 1,
	InputValue                               = 2,
	EForceComputation_MAX                    = 3,
};

// Enum Runtime.EShootControllerType
// NumValues: 0x0003
enum class EShootControllerType : uint8
{
	Keyboard                                 = 0,
	Gamepad                                  = 1,
	EShootControllerType_MAX                 = 2,
};

// Enum Runtime.EJoystickOrientation
// NumValues: 0x0006
enum class EJoystickOrientation : uint8
{
	Top                                      = 0,
	Down                                     = 1,
	Right                                    = 2,
	Left                                     = 3,
	Neutral                                  = 4,
	EJoystickOrientation_MAX                 = 5,
};

// Enum Runtime.EShootDirectionSpace
// NumValues: 0x0003
enum class EShootDirectionSpace : uint8
{
	PlayerSpace                              = 0,
	CameraSpace                              = 1,
	EShootDirectionSpace_MAX                 = 2,
};

// Enum Runtime.EVerticalComputationType
// NumValues: 0x0003
enum class EVerticalComputationType : uint8
{
	StaticValue                              = 0,
	Apex                                     = 1,
	EVerticalComputationType_MAX             = 2,
};

// Enum Runtime.ETargetForceType
// NumValues: 0x0005
enum class ETargetForceType : uint8
{
	Force                                    = 0,
	RotationForce                            = 1,
	ForceAndRotationForce                    = 2,
	Count                                    = 3,
	ETargetForceType_MAX                     = 4,
};

// Enum Runtime.ECardinalPointsType
// NumValues: 0x0005
enum class ECardinalPointsType : uint8
{
	CustomCardinalPoints                     = 0,
	CardinalPoints                           = 1,
	AdvancedCardinalPoints                   = 2,
	Count                                    = 3,
	ECardinalPointsType_MAX                  = 4,
};

// Enum Runtime.EAxisRotation
// NumValues: 0x0007
enum class EAxisRotation : uint8
{
	Pitch                                    = 0,
	Yaw                                      = 1,
	Roll                                     = 2,
	AllAxis                                  = 3,
	Count                                    = 4,
	None                                     = 5,
	EAxisRotation_MAX                        = 6,
};

// Enum Runtime.EMagnusType
// NumValues: 0x0005
enum class EMagnusType : uint8
{
	Horizontal                               = 0,
	Vertical                                 = 1,
	Both                                     = 2,
	Count                                    = 3,
	EMagnusType_MAX                          = 4,
};

// Enum Runtime.EApplyMode
// NumValues: 0x0005
enum class EApplyMode : uint8
{
	Add                                      = 0,
	Override                                 = 1,
	Count                                    = 2,
	None                                     = 3,
	EApplyMode_MAX                           = 4,
};

// Enum Runtime.ESourceModifierType
// NumValues: 0x000A
enum class ESourceModifierType : uint8
{
	Force                                    = 0,
	BallHeight                               = 1,
	CameraPitch                              = 2,
	ShootPitch                               = 3,
	BallSpeed                                = 4,
	Time                                     = 5,
	MaxTimeFromShootForceCurve               = 6,
	Count                                    = 7,
	None                                     = 8,
	ESourceModifierType_MAX                  = 9,
};

// Enum Runtime.ESortResult
// NumValues: 0x0004
enum class ESortResult : uint32
{
	Equal                                    = 0,
	Lesser                                   = 1,
	Greater                                  = 2,
	ESortResult_MAX                          = 3,
};

// Enum Runtime.ETeamFilterType
// NumValues: 0x0004
enum class ETeamFilterType : uint8
{
	LocalTeamOnly                            = 0,
	OpponentTeamOnly                         = 1,
	AllTeams                                 = 2,
	ETeamFilterType_MAX                      = 3,
};

// Enum Runtime.ETouchBallMontageHandling
// NumValues: 0x0004
enum class ETouchBallMontageHandling : uint8
{
	None                                     = 0,
	Prediction                               = 1,
	Read                                     = 2,
	ETouchBallMontageHandling_MAX            = 3,
};

// Enum Runtime.ETrajectoryStep
// NumValues: 0x0003
enum class ETrajectoryStep : uint8
{
	Flying                                   = 0,
	Rolling                                  = 1,
	ETrajectoryStep_MAX                      = 2,
};

// Enum Runtime.ELocationFollowerStretchType
// NumValues: 0x0004
enum class ELocationFollowerStretchType : uint8
{
	None                                     = 0,
	Time                                     = 1,
	Location                                 = 2,
	ELocationFollowerStretchType_MAX         = 3,
};

// Enum Runtime.ETutorialState
// NumValues: 0x0005
enum class ETutorialState : uint8
{
	NotStarted                               = 0,
	WaitPlayerToStart                        = 1,
	InProgress                               = 2,
	Finished                                 = 3,
	ETutorialState_MAX                       = 4,
};

// Enum Runtime.EUtilityAITargetType
// NumValues: 0x0005
enum class EUtilityAITargetType : uint8
{
	Teammate                                 = 0,
	Opponent                                 = 1,
	Ball                                     = 2,
	OpponentGoal                             = 3,
	EUtilityAITargetType_MAX                 = 4,
};

// Enum Runtime.EVictoryMoodRole
// NumValues: 0x0006
enum class EVictoryMoodRole : uint8
{
	MVP                                      = 0,
	Right                                    = 1,
	Left                                     = 2,
	BackLeft                                 = 3,
	BackRight                                = 4,
	MAX                                      = 5,
};

// Enum Runtime.EWorkshopStartType
// NumValues: 0x0004
enum class EWorkshopStartType : uint8
{
	None                                     = 0,
	ByInput                                  = 1,
	ByCountDown                              = 2,
	EWorkshopStartType_MAX                   = 3,
};

// Enum Runtime.EWorkshopState
// NumValues: 0x0006
enum class EWorkshopState : uint8
{
	NotStarted                               = 0,
	WaitPlayerToStart                        = 1,
	InProgress                               = 2,
	Paused                                   = 3,
	Finished                                 = 4,
	EWorkshopState_MAX                       = 5,
};

// Enum Runtime.EWorkshopWinReason
// NumValues: 0x0004
enum class EWorkshopWinReason : uint8
{
	ByScore                                  = 0,
	ByTimeSprint                             = 1,
	ByTimeEndurance                          = 2,
	EWorkshopWinReason_MAX                   = 3,
};

// Enum Runtime.EWorkshopMedal
// NumValues: 0x0005
enum class EWorkshopMedal : uint8
{
	None                                     = 0,
	Bronze                                   = 1,
	Silver                                   = 2,
	Gold                                     = 3,
	EWorkshopMedal_MAX                       = 4,
};

// Enum Runtime.ETeamColorKitType
// NumValues: 0x0006
enum class ETeamColorKitType : uint8
{
	None                                     = 0,
	Home                                     = 1,
	Away                                     = 2,
	Captain                                  = 3,
	Squad                                    = 4,
	ETeamColorKitType_MAX                    = 5,
};

// Enum Runtime.ESubworldStreamingState
// NumValues: 0x0004
enum class ESubworldStreamingState : uint8
{
	NotLoading                               = 0,
	Loading                                  = 1,
	Loaded                                   = 2,
	ESubworldStreamingState_MAX              = 3,
};

// ScriptStruct Runtime.TutorialObjectiveDatasourceInstance
// 0x0010 (0x0010 - 0x0000)
struct FTutorialObjectiveDatasourceInstance final
{
public:
	TSubclassOf<class UTutorialObjective>         m_DefaultClassObject;                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTutorialObjective*                     m_Instance;                                        // 0x0008(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTutorialObjectiveDatasourceInstance;

// ScriptStruct Runtime.TrajectoryModifierWeightParams
// 0x0030 (0x0030 - 0x0000)
struct FTrajectoryModifierWeightParams final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          m_bInFirstBounceSpace;                             // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         m_iUntilHit;                                       // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInt32Range                            m_iBounceRange;                                    // 0x000C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         m_fGlobalWeight;                                   // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         m_fDuration;                                       // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            m_WeightByInitialBounceSpeed;                      // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FTrajectoryModifierWeightParams;

// ScriptStruct Runtime.WeightedTrajectoryModifier
// 0x0040 (0x0040 - 0x0000)
struct FWeightedTrajectoryModifier final
{
public:
	TSubclassOf<class UTrajectoryModifier>        m_TrajectoryModifier;                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 m_ExternalSource;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTrajectoryModifierWeightParams        m_WeightParams;                                    // 0x0010(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWeightedTrajectoryModifier;

// ScriptStruct Runtime.TrajectoryModifierOverride
// 0x0050 (0x0050 - 0x0000)
struct FTrajectoryModifierOverride final
{
public:
	TSubclassOf<class UTrajectoryModifier>        m_ClassToOverride;                                 // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeChildrenClasses;                           // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeightedTrajectoryModifier            m_Override;                                        // 0x0010(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTrajectoryModifierOverride;

// ScriptStruct Runtime.MergeableTrajectoryModifiers
// 0x0030 (0x0030 - 0x0000)
struct FMergeableTrajectoryModifiers final
{
public:
	TArray<struct FWeightedTrajectoryModifier>    m_BeginnerModifiers;                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FWeightedTrajectoryModifier>    m_EnderModifiers;                                  // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FTrajectoryModifierOverride>    m_OverriderModifiers;                              // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMergeableTrajectoryModifiers;

// ScriptStruct Runtime.ShootParams
// 0x0108 (0x0108 - 0x0000)
struct FShootParams final
{
public:
	TWeakObjectPtr<class AActor>                  m_Shooter;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPredictProjectilePathPointData        m_Point;                                           // 0x0008(0x0038)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FMergeableTrajectoryModifiers          m_TrajectoryModifiers;                             // 0x0040(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FVector                                m_vRotationVelocity;                               // 0x0070(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_fForceRatio;                                     // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_fTimeFreezingOrCustomPartAtStart;                // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFloatRange                            m_ForceRange;                                      // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  m_ShootTypeTagContainer;                           // 0x00A0(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UTrajectoryStatus>>  m_TrajectoryStatus;                                // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_D0[0x30];                                      // 0x00D0(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          m_bTriggerBlueprintShootEvent;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FShootParams;

// ScriptStruct Runtime.TrajectoryOffsetContext
// 0x000C (0x000C - 0x0000)
struct FTrajectoryOffsetContext final
{
public:
	float                                         m_fDistance;                                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         m_iBounceOffset;                                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         m_iSurface;                                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTrajectoryOffsetContext;

// ScriptStruct Runtime.ShootStartPoint
// 0x0138 (0x0138 - 0x0000)
struct FShootStartPoint final
{
public:
	bool                                          m_bAttachedToShooter;                              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FShootParams                           m_ShootParams;                                     // 0x0008(0x0108)(NativeAccessSpecifierPublic)
	ESimulationStep                               m_eSimulationStep;                                 // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTrajectoryOffsetContext               m_TrajectoryOffsetContext;                         // 0x0114(0x000C)(RepSkip, NoDestructor, NativeAccessSpecifierPublic)
	struct FPredictionKey                         m_PredictionKey;                                   // 0x0120(0x0010)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRevisionID                            m_RevisionID;                                      // 0x0130(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FShootStartPoint;

// ScriptStruct Runtime.ShopItemData
// 0x0028 (0x0028 - 0x0000)
struct FShopItemData final
{
public:
	TWeakObjectPtr<class USOSBindingsStoreItemViewModel> m_SOSItemViewModel;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class USOSBindingsStoreBundleViewModel> m_OwningBundleViewModel;                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 m_DefaultID;                                       // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_bIsOwnedByDefault;                               // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_bIsNone;                                         // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FShopItemData;

// ScriptStruct Runtime.ShopItem
// 0x0060 (0x0060 - 0x0000)
struct FShopItem final
{
public:
	TSoftObjectPtr<class UObject>                 m_Item;                                            // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FShopItemData                          m_Data;                                            // 0x0028(0x0028)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FInstancedStruct                       m_GenericItem;                                     // 0x0050(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FShopItem;

// ScriptStruct Runtime.BallStealAttackTableRow
// 0x0020 (0x0028 - 0x0008)
struct FBallStealAttackTableRow final : public FTableRowBase
{
public:
	int32                                         m_iStartupFrameCount;                              // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           m_AttackTag;                                       // 0x000C(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_fTimeScaleOnMiss;                                // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UShootAbilityData>          m_ShootData;                                       // 0x0018(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UHitboxData>                m_DefaultHitbox;                                   // 0x0020(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBallStealAttackTableRow;

// ScriptStruct Runtime.ColorPalette
// 0x0018 (0x0018 - 0x0000)
struct FColorPalette final
{
public:
	TArray<int32>                                 m_Colors;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, Protected, NativeAccessSpecifierProtected)
	EPaletteType                                  m_eType;                                           // 0x0010(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FColorPalette;

// ScriptStruct Runtime.ReboundData
// 0x0068 (0x0068 - 0x0000)
struct FReboundData final
{
public:
	struct FVector                                m_vLocation;                                       // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                m_vNormal;                                         // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                m_vImpactNormal;                                   // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_bStartPenetrating;                               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_fPenetrationDepth;                               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_fTraceTime;                                      // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         m_bBlockingHit;                                    // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UPhysicalMaterial>       m_PhysMaterial;                                    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        m_iReboundId;                                      // 0x0060(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FReboundData;

// ScriptStruct Runtime.RTOptionalInputToSyncEarlier
// 0x0010 (0x0010 - 0x0000)
struct FRTOptionalInputToSyncEarlier final
{
public:
	float                                         m_fMinTimeBeforeSync;                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USCInputAction*                         m_Input;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRTOptionalInputToSyncEarlier;

// ScriptStruct Runtime.BallInterceptionPointTargetData
// 0x0010 (0x0120 - 0x0110)
struct FBallInterceptionPointTargetData final : public FActorLocationTargetData
{
public:
	uint8                                         Pad_108[0x4];                                      // 0x0108(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m_iPart;                                           // 0x010C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         m_iPoint;                                          // 0x0110(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_fRatio;                                          // 0x0114(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRevisionID                            m_RevisionID;                                      // 0x0118(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FBallInterceptionPointTargetData;

// ScriptStruct Runtime.RTNetworkSyncShootTimeArg
// 0x0028 (0x0028 - 0x0000)
struct FRTNetworkSyncShootTimeArg final
{
public:
	float                                         m_fCompensationTime;                               // 0x0000(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_fMinTimeBeforeSync;                              // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_bOverrideShootTimeAtReleaseTime;                 // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_bSyncWhenShootInputIsReleased;                   // 0x0009(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_fCatchupShootTime;                               // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_fCatchupTimeAnim;                                // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRTOptionalInputToSyncEarlier>  m_OptionalInputToSyncEarlier;                      // 0x0018(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRTNetworkSyncShootTimeArg;

// ScriptStruct Runtime.SCPredictProjectilePathParams
// 0x0068 (0x00E0 - 0x0078)
struct alignas(0x10) FSCPredictProjectilePathParams final : public FPredictProjectilePathParams
{
public:
	float                                         m_fSpeedStopMoving;                                // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_bReturnPhysicalMaterial;                         // 0x007C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_fIgnoreTraceBeforeTime;                          // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FWeightedTrajectoryModifier>    m_TrajectoryModifiers;                             // 0x0088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x48];                                      // 0x0098(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSCPredictProjectilePathParams;

// ScriptStruct Runtime.ActionCommandDatasourceInstance
// 0x0010 (0x0010 - 0x0000)
struct FActionCommandDatasourceInstance final
{
public:
	TSubclassOf<class UActionCommand>             m_DefaultClassObject;                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActionCommand*                         m_Instance;                                        // 0x0008(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FActionCommandDatasourceInstance;

// ScriptStruct Runtime.BallInteractionRequestData
// 0x0048 (0x0058 - 0x0010)
struct FBallInteractionRequestData final : public FSCGameplayAbilityTargetData
{
public:
	EBallInteractionRequestType                   m_eType;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x1F];                                      // 0x0011(0x001F)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 m_InteractionRequestActor;                         // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_fRequestTime;                                    // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_fTargetTime;                                     // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBallInteractionOwnerRole                     m_eOwnerRole;                                      // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_fOwnerSpeed;                                     // 0x0044(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_fOwnerDistanceToTarget;                          // 0x0048(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_fOwnerAngleToTarget;                             // 0x004C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_fOwnerAndTargetVelocityAlignmentFactor;          // 0x0050(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FBallInteractionRequestData;

// ScriptStruct Runtime.WallRunTargetData
// 0x0058 (0x0068 - 0x0010)
struct FWallRunTargetData final : public FSCGameplayAbilityTargetData
{
public:
	bool                                          m_bIsMirrored;                                     // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector_NetQuantizeNormal              m_vWallRunDirection;                               // 0x0018(0x0018)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                m_vSnapLocation;                                   // 0x0030(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector_NetQuantizeNormal              m_vWallNormal;                                     // 0x0048(0x0018)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_fWallRunStartTime;                               // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWallRunTargetData;

// ScriptStruct Runtime.RuntimeARTransition
// 0x000C (0x000C - 0x0000)
struct FRuntimeARTransition final
{
public:
	bool                                          m_bToPortal;                                       // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_bTransitionStadiumUseGoalA;                      // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           m_TagTransitionEffect;                             // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRuntimeARTransition;

// ScriptStruct Runtime.OverrideForceComputationTargetData
// 0x0008 (0x0018 - 0x0010)
struct FOverrideForceComputationTargetData final : public FSCGameplayAbilityTargetData
{
public:
	TSubclassOf<class UBaseShootForceComputation> m_Computation;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOverrideForceComputationTargetData;

// ScriptStruct Runtime.ThumbnailMaterial
// 0x0010 (0x0010 - 0x0000)
struct FThumbnailMaterial final
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AtlasProperty;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FThumbnailMaterial;

// ScriptStruct Runtime.TrajectoryModifierParams
// 0x0120 (0x0120 - 0x0000)
struct FTrajectoryModifierParams final
{
public:
	TWeakObjectPtr<class UObject>                 m_WorldContextObject;                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
