#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Runtime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Runtime_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SCCore_structs.hpp"
#include "SCCombatSystem_structs.hpp"
#include "SCCharacterCustomization_structs.hpp"
#include "StateTreeModule_structs.hpp"
#include "SOS_structs.hpp"
#include "SkeletalMerging_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK::Params
{

// Function Runtime.ExperienceComponentBase.BPE_ComputeComponentData
// 0x0028 (0x0028 - 0x0000)
struct ExperienceComponentBase_BPE_ComputeComponentData final
{
public:
	const class UObject*                          _worldContext;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         _iOldTotalExperience;                              // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   _playerId;                                         // 0x000C(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FExperienceComponentData>       _outComponentsData;                                // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ExperienceComponentBase_BPE_ComputeComponentData;

// Function Runtime.AbilityOwnerSelector.OnOverlapBegin
// 0x0118 (0x0118 - 0x0000)
struct AbilityOwnerSelector_OnOverlapBegin final
{
public:
	class UPrimitiveComponent*                    _overlappedComp;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 _otherActor;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    _otherComp;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         _otherBodyIndex;                                   // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bFromSweep;                                       // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             _sweepResult;                                      // 0x0020(0x00F8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityOwnerSelector_OnOverlapBegin;

// Function Runtime.AbilityOwnerSelector.OnOverlapEnd
// 0x0020 (0x0020 - 0x0000)
struct AbilityOwnerSelector_OnOverlapEnd final
{
public:
	class UPrimitiveComponent*                    _overlappedComp;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 _otherActor;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    _otherComp;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         _otherBodyIndex;                                   // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbilityOwnerSelector_OnOverlapEnd;

// Function Runtime.AbilityTask_ApplyAbilityCostOverTime.BPF_ApplyAbilityCostOverTime
// 0x0020 (0x0020 - 0x0000)
struct AbilityTask_ApplyAbilityCostOverTime_BPF_ApplyAbilityCostOverTime final
{
public:
	class USCGameplayAbility*                     _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameplayEffect>            _effect;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fPeriodInSeconds;                                 // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_ApplyAbilityCostOverTime*  ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_ApplyAbilityCostOverTime_BPF_ApplyAbilityCostOverTime;

// Function Runtime.AbilityTask_ApplyAbilityCostOverTime.BPF_SetCheckCommitAbilityCostConditionDelegate
// 0x0010 (0x0010 - 0x0000)
struct AbilityTask_ApplyAbilityCostOverTime_BPF_SetCheckCommitAbilityCostConditionDelegate final
{
public:
	TDelegate<void()>                             _delegate;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_ApplyAbilityCostOverTime_BPF_SetCheckCommitAbilityCostConditionDelegate;

// Function Runtime.Goal.BPE_GetCollision
// 0x0008 (0x0008 - 0x0000)
struct Goal_BPE_GetCollision final
{
public:
	class USceneComponent*                        _outCollision;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Goal_BPE_GetCollision;

// Function Runtime.Goal.BPF_IsPointInGoal
// 0x0020 (0x0020 - 0x0000)
struct Goal_BPF_IsPointInGoal final
{
public:
	struct FVector                                _vPoint;                                           // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bUseGoalExtraSize;                                // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Goal_BPF_IsPointInGoal;

// Function Runtime.AbilityTask_ApplyShoot.BPF_ApplyShootTask
// 0x0128 (0x0128 - 0x0000)
struct AbilityTask_ApplyShoot_BPF_ApplyShootTask final
{
public:
	struct FShootParams                           _shootParams;                                      // 0x0000(0x0108)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UGameplayAbility*                       _instigatorAbility;                                // 0x0108(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ABall*                                  _ball;                                             // 0x0110(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bAttachedToPlayer;                                // 0x0118(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_ApplyShoot*                ReturnValue;                                       // 0x0120(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_ApplyShoot_BPF_ApplyShootTask;

// Function Runtime.AbilityTask_ApplyShoot.OnShoot
// 0x0110 (0x0110 - 0x0000)
struct AbilityTask_ApplyShoot_OnShoot final
{
public:
	const class ABall*                            _ball;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FShootParams                           _shootParams;                                      // 0x0008(0x0108)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_ApplyShoot_OnShoot;

// Function Runtime.AbilityTask_ApplyShoot.OnTrajectoryUpdated
// 0x0110 (0x0110 - 0x0000)
struct AbilityTask_ApplyShoot_OnTrajectoryUpdated final
{
public:
	const class ABall*                            _ball;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FShootParams                           _shootParams;                                      // 0x0008(0x0108)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_ApplyShoot_OnTrajectoryUpdated;

// Function Runtime.AbilityTask_ApplyVolleyShoot.BPF_ApplyVolleyShootTask
// 0x0130 (0x0130 - 0x0000)
struct AbilityTask_ApplyVolleyShoot_BPF_ApplyVolleyShootTask final
{
public:
	struct FShootParams                           _shootParams;                                      // 0x0000(0x0108)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UGameplayAbility*                       _instigatorAbility;                                // 0x0108(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ABall*                                  _ball;                                             // 0x0110(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_BallInteractionRequest*    _ballInteractionRequestTask;                       // 0x0118(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bAttachedToPlayer;                                // 0x0120(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_ApplyVolleyShoot*          ReturnValue;                                       // 0x0128(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_ApplyVolleyShoot_BPF_ApplyVolleyShootTask;

// Function Runtime.BallStealBinder.OnBallStolen
// 0x0010 (0x0010 - 0x0000)
struct BallStealBinder_OnBallStolen final
{
public:
	class ARuntimePlayerState*                    _playerStateThief;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARuntimePlayerState*                    _playerStateStolen;                                // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BallStealBinder_OnBallStolen;

// Function Runtime.AbilityTask_BallInteractionRequest.BPF_BallInteractionRequest
// 0x0048 (0x0048 - 0x0000)
struct AbilityTask_BallInteractionRequest_BPF_BallInteractionRequest final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBallInteractionRequestType                   _eType;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       _context;                                          // 0x0010(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTag                           _gameplayTag;                                      // 0x0038(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_BallInteractionRequest*    ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_BallInteractionRequest_BPF_BallInteractionRequest;

// Function Runtime.AbilityTask_BallInteractionRequest.ServerReceiveRequest
// 0x0030 (0x0030 - 0x0000)
struct AbilityTask_BallInteractionRequest_ServerReceiveRequest final
{
public:
	struct FGameplayAbilityTargetDataHandle       _data;                                             // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTag                           _activationTag;                                    // 0x0028(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_BallInteractionRequest_ServerReceiveRequest;

// Function Runtime.AbilityTask_BallInteractionRequest.HasRequestBeenGranted
// 0x0001 (0x0001 - 0x0000)
struct AbilityTask_BallInteractionRequest_HasRequestBeenGranted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_BallInteractionRequest_HasRequestBeenGranted;

// Function Runtime.AbilityTask_BallInteractionRequest.HasRequestBeenProcessed
// 0x0001 (0x0001 - 0x0000)
struct AbilityTask_BallInteractionRequest_HasRequestBeenProcessed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_BallInteractionRequest_HasRequestBeenProcessed;

// Function Runtime.AbilityTask_HandleHindering.BPF_HandleHindering
// 0x0048 (0x0048 - 0x0000)
struct AbilityTask_HandleHindering_BPF_HandleHindering final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AActor*                           _instigator;                                       // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UCharacterHinderingConfig*        _config;                                           // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERootMotionFinishVelocityMode                 _eVelocityOnFinishMode;                            // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                _vSetVelocityOnFinish;                             // 0x0020(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fClampVelocityOnFinish;                           // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_HandleHindering*           ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_HandleHindering_BPF_HandleHindering;

// Function Runtime.AbilityTask_HandleSteeringLocomotion.BPF_HandleSteeringLocomotion
// 0x0048 (0x0048 - 0x0000)
struct AbilityTask_HandleSteeringLocomotion_BPF_HandleSteeringLocomotion final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   _taskInstanceName;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USCInputAction*                         _action;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fSpeed;                                           // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            _speedCurve;                                       // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fTrackingSpeed;                                   // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            _trackingCurve;                                    // 0x0030(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fInputDelay;                                      // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fUpdateInputFrequency;                            // 0x003C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_HandleSteeringLocomotion*  ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_HandleSteeringLocomotion_BPF_HandleSteeringLocomotion;

// Function Runtime.AbilityTask_MoveToCollision.BPF_MoveToCollision
// 0x0020 (0x0020 - 0x0000)
struct AbilityTask_MoveToCollision_BPF_MoveToCollision final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fMaxDuration;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fMinDistanceToRun;                                // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             _eCollisionChannel;                                // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_MoveToCollision*           ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_MoveToCollision_BPF_MoveToCollision;

// Function Runtime.AbilityTask_NetworkFindBallTarget.BPF_NetworkFindBallTarget
// 0x00D0 (0x00D0 - 0x0000)
struct AbilityTask_NetworkFindBallTarget_BPF_NetworkFindBallTarget final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOnDemandTargetProvider                _targetProvider;                                   // 0x0008(0x0058)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FOnDemandTargetProvider                _targetValidationProvider;                         // 0x0060(0x0058)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FGameplayTag                           _gameplayTag;                                      // 0x00B8(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bDoOnce;                                          // 0x00C0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_NetworkFindBallTarget*     ReturnValue;                                       // 0x00C8(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_NetworkFindBallTarget_BPF_NetworkFindBallTarget;

// Function Runtime.AbilityTask_NetworkFindBallTarget.BPF_NetworkFindBallTargetWithCancelInput
// 0x00D8 (0x00D8 - 0x0000)
struct AbilityTask_NetworkFindBallTarget_BPF_NetworkFindBallTargetWithCancelInput final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOnDemandTargetProvider                _targetProvider;                                   // 0x0008(0x0058)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FOnDemandTargetProvider                _targetValidationProvider;                         // 0x0060(0x0058)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FGameplayTag                           _gameplayTag;                                      // 0x00B8(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USCInputAction*                         _inAction;                                         // 0x00C0(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputWatchTrigger                            _eWatchTrigger;                                    // 0x00C8(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bDoOnce;                                          // 0x00C9(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_NetworkFindBallTarget*     ReturnValue;                                       // 0x00D0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_NetworkFindBallTarget_BPF_NetworkFindBallTargetWithCancelInput;

// Function Runtime.AbilityTask_NetworkFindBallTarget.InitCancel
// 0x0010 (0x0010 - 0x0000)
struct AbilityTask_NetworkFindBallTarget_InitCancel final
{
public:
	class USCInputAction*                         _inAction;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputWatchTrigger                            _eWatchTrigger;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbilityTask_NetworkFindBallTarget_InitCancel;

// Function Runtime.AbilityTask_NetworkFindBallTarget.OnCancelInput
// 0x00A0 (0x00A0 - 0x0000)
struct AbilityTask_NetworkFindBallTarget_OnCancelInput final
{
public:
	const class USCInputAction*                   _action;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputActionState                      _listenerState;                                    // 0x0008(0x0098)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_NetworkFindBallTarget_OnCancelInput;

// Function Runtime.AbilityTask_NetworkFindBallTarget.ServerReceiveTargetData
// 0x0030 (0x0030 - 0x0000)
struct AbilityTask_NetworkFindBallTarget_ServerReceiveTargetData final
{
public:
	struct FGameplayAbilityTargetDataHandle       _data;                                             // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTag                           _activationTag;                                    // 0x0028(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_NetworkFindBallTarget_ServerReceiveTargetData;

// Function Runtime.AbilityTask_NetworkHitProjection.BPF_NetworkHitProjection
// 0x0058 (0x0058 - 0x0000)
struct AbilityTask_NetworkHitProjection_BPF_NetworkHitProjection final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAbilityTargetDataHandle       _context;                                          // 0x0008(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TSubclassOf<class UTargetDatasource>          _datasource;                                       // 0x0030(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UTargetPicker>              _picker;                                           // 0x0038(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           _gameplayTag;                                      // 0x0040(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_HandleHitboxBase*          _handleHitboxTaskPtr;                              // 0x0048(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_NetworkHitProjection*      ReturnValue;                                       // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_NetworkHitProjection_BPF_NetworkHitProjection;

// Function Runtime.AbilityTask_NetworkHitProjection.ServerReceiveTargetData
// 0x0030 (0x0030 - 0x0000)
struct AbilityTask_NetworkHitProjection_ServerReceiveTargetData final
{
public:
	struct FGameplayAbilityTargetDataHandle       _data;                                             // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTag                           _activationTag;                                    // 0x0028(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_NetworkHitProjection_ServerReceiveTargetData;

// Function Runtime.AbilityTask_NetworkHitValidation.BPF_NetworkHitValidation
// 0x0058 (0x0058 - 0x0000)
struct AbilityTask_NetworkHitValidation_BPF_NetworkHitValidation final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAbilityTargetDataHandle       _context;                                          // 0x0008(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TSubclassOf<class UTargetDatasource>          _datasource;                                       // 0x0030(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UTargetPicker>              _picker;                                           // 0x0038(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           _gameplayTag;                                      // 0x0040(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_HandleHitboxBase*          _handleHitboxTaskPtr;                              // 0x0048(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_NetworkHitValidation*      ReturnValue;                                       // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_NetworkHitValidation_BPF_NetworkHitValidation;

// Function Runtime.AbilityTask_NetworkHitValidation.ServerReceiveTargetData
// 0x0030 (0x0030 - 0x0000)
struct AbilityTask_NetworkHitValidation_ServerReceiveTargetData final
{
public:
	struct FGameplayAbilityTargetDataHandle       _data;                                             // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTag                           _activationTag;                                    // 0x0028(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_NetworkHitValidation_ServerReceiveTargetData;

// Function Runtime.AbilityTask_NetworkSyncShootData.BPF_NetworkSyncShootDataWithInputs
// 0x0198 (0x0198 - 0x0000)
struct AbilityTask_NetworkSyncShootData_BPF_NetworkSyncShootDataWithInputs final
{
public:
	class USCGameplayAbility*                     _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRTInputActionsForNetworkSyncShoot     _inputAction;                                      // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FShootPrepTargetData                   _inOutShootPrep;                                   // 0x0020(0x00E0)(Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FGameplayAbilityTargetDataHandle       _context;                                          // 0x0100(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UTrajectoryStatus>>  _trajectoryStatus;                                 // 0x0128(0x0010)(ConstParm, Parm, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FSCConditionsToSyncEarly               _conditionsToSyncEarly;                            // 0x0138(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRTNetworkSyncShootTimeArg             _networkSyncTimeArg;                               // 0x0150(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FSCNetworkSyncData                     _syncData;                                         // 0x0178(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTag                           _shootTypeTag;                                     // 0x0188(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_NetworkSyncShootData*      ReturnValue;                                       // 0x0190(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_NetworkSyncShootData_BPF_NetworkSyncShootDataWithInputs;

// Function Runtime.AbilityTask_NetworkSyncShootData.BPF_GetShootParams
// 0x0108 (0x0108 - 0x0000)
struct AbilityTask_NetworkSyncShootData_BPF_GetShootParams final
{
public:
	struct FShootParams                           _outShootParams;                                   // 0x0000(0x0108)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_NetworkSyncShootData_BPF_GetShootParams;

// Function Runtime.GoalScopedBinder.OnGoalRegistered
// 0x0008 (0x0008 - 0x0000)
struct GoalScopedBinder_OnGoalRegistered final
{
public:
	class AGoal*                                  _goal;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GoalScopedBinder_OnGoalRegistered;

// Function Runtime.GoalCrossbarHitBinder.OnGoalCrossbarHit
// 0x0010 (0x0010 - 0x0000)
struct GoalCrossbarHitBinder_OnGoalCrossbarHit final
{
public:
	class AGoal*                                  _goal;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         _uiTeam;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GoalCrossbarHitBinder_OnGoalCrossbarHit;

// Function Runtime.AbilityTask_NetworkSyncTargetData.BPF_NetworkSyncTargetData
// 0x0048 (0x0048 - 0x0000)
struct AbilityTask_NetworkSyncTargetData_BPF_NetworkSyncTargetData final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAbilityTargetDataHandle       _targetData;                                       // 0x0008(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         _fSleepDuration;                                   // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fListenDuration;                                  // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fLagCompensation;                                 // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_NetworkSyncTargetData*     ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_NetworkSyncTargetData_BPF_NetworkSyncTargetData;

// Function Runtime.AbilityTask_NetworkSyncTargetData.OnReplicatedCallback
// 0x0030 (0x0030 - 0x0000)
struct AbilityTask_NetworkSyncTargetData_OnReplicatedCallback final
{
public:
	struct FGameplayAbilityTargetDataHandle       _data;                                             // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTag                           _activationTag;                                    // 0x0028(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_NetworkSyncTargetData_OnReplicatedCallback;

// Function Runtime.AbilityTask_NetworkWaitTargetData.BPF_NetworkWaitTargetData
// 0x0048 (0x0048 - 0x0000)
struct AbilityTask_NetworkWaitTargetData_BPF_NetworkWaitTargetData final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAbilityTaskNetWaitType                       _eType;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       _targetData;                                       // 0x0010(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         _fSleepDuration;                                   // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fListenDuration;                                  // 0x003C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_NetworkWaitTargetData*     ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_NetworkWaitTargetData_BPF_NetworkWaitTargetData;

// Function Runtime.AbilityTask_NetworkWaitTargetData.OnReplicatedCallback
// 0x0030 (0x0030 - 0x0000)
struct AbilityTask_NetworkWaitTargetData_OnReplicatedCallback final
{
public:
	struct FGameplayAbilityTargetDataHandle       _data;                                             // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTag                           _activationTag;                                    // 0x0028(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_NetworkWaitTargetData_OnReplicatedCallback;

// Function Runtime.RuntimeGameFlowState.GetMatchStateArray
// 0x0010 (0x0010 - 0x0000)
struct RuntimeGameFlowState_GetMatchStateArray final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeGameFlowState_GetMatchStateArray;

// Function Runtime.AbilityTask_PlayMontageFromAestheticMontage.BPF_PlayMontageFromAestheticMontage
// 0x0078 (0x0078 - 0x0000)
struct AbilityTask_PlayMontageFromAestheticMontage_BPF_PlayMontageFromAestheticMontage final
{
public:
	class USCGameplayAbility*                     _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_PlaySimulatedAestheticMontage* _aestheticMontageTask;                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAbilityExecOrigin                            _eIn;                                              // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAbilityExecOutputWithValidation              _eOut;                                             // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   _taskInstanceName;                                 // 0x0014(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fFallbackStartTime;                               // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UAnimSequencePicker>        _fallbackPicker;                                   // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   _fallbackSlotName;                                 // 0x0028(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBasicMontagePlayerConfiguration*       _overrideConfiguration;                            // 0x0030(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bLog;                                             // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bStopWhenAbilityEnds;                             // 0x0039(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       _playerContext;                                    // 0x0040(0x0028)(Parm, NativeAccessSpecifierPublic)
	class FName                                   _StartSection;                                     // 0x0068(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_PlayMontageFromAestheticMontage* ReturnValue;                                 // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_PlayMontageFromAestheticMontage_BPF_PlayMontageFromAestheticMontage;

// Function Runtime.AbilityTask_PlaySimulatedAestheticMontage.BPF_PlaySimulatedAstheticMontage
// 0x0030 (0x0030 - 0x0000)
struct AbilityTask_PlaySimulatedAestheticMontage_BPF_PlaySimulatedAstheticMontage final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           _montage;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bMirror;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   _newSlotTrack;                                     // 0x0014(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fPlayRate;                                        // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fBlendOutAnimTime;                                // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlaySimulatedAestheticMontage* ReturnValue;                                   // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_PlaySimulatedAestheticMontage_BPF_PlaySimulatedAstheticMontage;

// Function Runtime.AbilityTask_PlaySimulatedAestheticMontage.BPF_PlaySimulatedTimedAstheticMontage
// 0x0030 (0x0030 - 0x0000)
struct AbilityTask_PlaySimulatedAestheticMontage_BPF_PlaySimulatedTimedAstheticMontage final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           _montage;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bMirror;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   _newSlotTrack;                                     // 0x0014(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fWorldSyncTime;                                   // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fAnimSyncTime;                                    // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fBlendOutAnimTime;                                // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_PlaySimulatedAestheticMontage* ReturnValue;                                   // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_PlaySimulatedAestheticMontage_BPF_PlaySimulatedTimedAstheticMontage;

// Function Runtime.AbilityTask_PlaySimulatedAestheticMontage.OnAnyMontageBlendingOut
// 0x0010 (0x0010 - 0x0000)
struct AbilityTask_PlaySimulatedAestheticMontage_OnAnyMontageBlendingOut final
{
public:
	class UAnimMontage*                           _montage;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbilityTask_PlaySimulatedAestheticMontage_OnAnyMontageBlendingOut;

// Function Runtime.AbilityTask_PlaySimulatedAestheticMontage.OnAnyMontageEnded
// 0x0010 (0x0010 - 0x0000)
struct AbilityTask_PlaySimulatedAestheticMontage_OnAnyMontageEnded final
{
public:
	class UAnimMontage*                           _montage;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bInterrupted;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbilityTask_PlaySimulatedAestheticMontage_OnAnyMontageEnded;

// Function Runtime.AbilityTask_PlaySimulatedAestheticMontage.GetMontageInstancePosition
// 0x0004 (0x0004 - 0x0000)
struct AbilityTask_PlaySimulatedAestheticMontage_GetMontageInstancePosition final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_PlaySimulatedAestheticMontage_GetMontageInstancePosition;

// Function Runtime.AbilityTask_PlaySyncMontageBase.OnAnyMontageBlendingOut
// 0x0010 (0x0010 - 0x0000)
struct AbilityTask_PlaySyncMontageBase_OnAnyMontageBlendingOut final
{
public:
	class UAnimMontage*                           _montage;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbilityTask_PlaySyncMontageBase_OnAnyMontageBlendingOut;

// Function Runtime.AbilityTask_PlaySyncMontageBase.OnAnyMontageStarting
// 0x0008 (0x0008 - 0x0000)
struct AbilityTask_PlaySyncMontageBase_OnAnyMontageStarting final
{
public:
	class UAnimMontage*                           _montage;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_PlaySyncMontageBase_OnAnyMontageStarting;

// Function Runtime.AbilityTask_PlaySyncAestheticMontage.BPF_PlayAbilitySyncAestheticMontage
// 0x0038 (0x0038 - 0x0000)
struct AbilityTask_PlaySyncAestheticMontage_BPF_PlayAbilitySyncAestheticMontage final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           _followerMontage;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bFollowerMirror;                                  // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _fPlayMontageAtWorldTime;                          // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fEndMontageAtWorldTime;                           // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   _newSlotTrack;                                     // 0x001C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fBlendInDuration;                                 // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fLongBlendOutDuration;                            // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlaySyncAestheticMontage*  ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_PlaySyncAestheticMontage_BPF_PlayAbilitySyncAestheticMontage;

// Function Runtime.AbilityTask_PlaySyncAestheticMontage.BPF_PlaySyncAestheticMontage
// 0x0048 (0x0048 - 0x0000)
struct AbilityTask_PlaySyncAestheticMontage_BPF_PlaySyncAestheticMontage final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           _masterMontage;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bMasterMirror;                                    // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           _followerMontage;                                  // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bFollowerMirror;                                  // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _fPlayMontageAtWorldTime;                          // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fEndMontageAtWorldTime;                           // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   _newSlotTrack;                                     // 0x002C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fBlendInDuration;                                 // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fLongBlendOutDuration;                            // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlaySyncAestheticMontage*  ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_PlaySyncAestheticMontage_BPF_PlaySyncAestheticMontage;

// Function Runtime.ShopItemSorter.BPE_Compare
// 0x00C8 (0x00C8 - 0x0000)
struct ShopItemSorter_BPE_Compare final
{
public:
	struct FShopItem                              _first;                                            // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FShopItem                              _second;                                           // 0x0060(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	ESortResult                                   ReturnValue;                                       // 0x00C0(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ShopItemSorter_BPE_Compare;

