#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Runtime

#include "Basic.hpp"

#include "Runtime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "SCCore_structs.hpp"
#include "SCCore_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MotionWarping_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "SCCombatSystem_structs.hpp"
#include "SCCombatSystem_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "UMG_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "SCCharacterCustomization_structs.hpp"
#include "SCCharacterCustomization_classes.hpp"
#include "StructUtils_structs.hpp"
#include "SOS_structs.hpp"
#include "SOS_classes.hpp"
#include "AkAudio_structs.hpp"
#include "AkAudio_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Gauntlet_classes.hpp"
#include "GameplayCameras_classes.hpp"
#include "SOSBindings_classes.hpp"
#include "LevelSequence_classes.hpp"
#include "MovieScene_classes.hpp"
#include "MovieSceneTracks_classes.hpp"


namespace SDK
{

// Class Runtime.ForceTouchBallNotifyState
// 0x0008 (0x0040 - 0x0038)
class UForceTouchBallNotifyState final : public USCAbilityMontageNotifyState
{
public:
	float                                         m_fBlendInDuration;                                // 0x0038(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ForceTouchBallNotifyState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ForceTouchBallNotifyState")
	}
	static class UForceTouchBallNotifyState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UForceTouchBallNotifyState>();
	}
};
DUMPER7_ASSERTS_UForceTouchBallNotifyState;

// Class Runtime.AbilityOwnerSelector
// 0x0050 (0x0290 - 0x0240)
class UAbilityOwnerSelector final : public USceneComponent
{
public:
	class UBoxComponent*                          m_AreaEnter;                                       // 0x0240(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBoxComponent*                          m_AreaExit;                                        // 0x0248(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        m_SelectionPoint;                                  // 0x0250(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class URuntimeGameplayEffect>     m_AbilityGameplayEffect;                           // 0x0258(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         m_iTeam;                                           // 0x0260(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_264[0x2C];                                     // 0x0264(0x002C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnOverlapBegin(class UPrimitiveComponent* _overlappedComp, class AActor* _otherActor, class UPrimitiveComponent* _otherComp, int32 _otherBodyIndex, bool _bFromSweep, const struct FHitResult& _sweepResult);
	void OnOverlapEnd(class UPrimitiveComponent* _overlappedComp, class AActor* _otherActor, class UPrimitiveComponent* _otherComp, int32 _otherBodyIndex);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityOwnerSelector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityOwnerSelector")
	}
	static class UAbilityOwnerSelector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityOwnerSelector>();
	}
};
DUMPER7_ASSERTS_UAbilityOwnerSelector;

// Class Runtime.AbilityTask_ApplyAbilityCostOverTime
// 0x0048 (0x00E0 - 0x0098)
class UAbilityTask_ApplyAbilityCostOverTime final : public UAbilityTask
{
public:
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              onFailure;                                         // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_B0[0x28];                                      // 0x00B0(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            m_CostEffect;                                      // 0x00D8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UAbilityTask_ApplyAbilityCostOverTime* BPF_ApplyAbilityCostOverTime(class USCGameplayAbility* _owningAbility, TSubclassOf<class UGameplayEffect> _effect, float _fPeriodInSeconds);

	void BPF_SetCheckCommitAbilityCostConditionDelegate(TDelegate<void()> _delegate);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_ApplyAbilityCostOverTime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_ApplyAbilityCostOverTime")
	}
	static class UAbilityTask_ApplyAbilityCostOverTime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_ApplyAbilityCostOverTime>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_ApplyAbilityCostOverTime;

// Class Runtime.BallStateActorCondition
// 0x0008 (0x0030 - 0x0028)
class UBallStateActorCondition final : public UBaseActorCondition
{
public:
	ESimulationStep                               m_eBallState;                                      // 0x0028(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BallStateActorCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BallStateActorCondition")
	}
	static class UBallStateActorCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBallStateActorCondition>();
	}
};
DUMPER7_ASSERTS_UBallStateActorCondition;

// Class Runtime.ExtraEffortRegenCalculation
// 0x0000 (0x0040 - 0x0040)
class UExtraEffortRegenCalculation final : public UGameplayEffectExecutionCalculation
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExtraEffortRegenCalculation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExtraEffortRegenCalculation")
	}
	static class UExtraEffortRegenCalculation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExtraEffortRegenCalculation>();
	}
};
DUMPER7_ASSERTS_UExtraEffortRegenCalculation;

// Class Runtime.AbilityTask_ApplyShoot
// 0x0028 (0x00C0 - 0x0098)
class UAbilityTask_ApplyShoot : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void()>              m_OnShoot;                                         // 0x0098(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              m_OnShootCanceled;                                 // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	class ABall*                                  M_Ball;                                            // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UAbilityTask_ApplyShoot* BPF_ApplyShootTask(const struct FShootParams& _shootParams, class UGameplayAbility* _instigatorAbility, class ABall* _ball, bool _bAttachedToPlayer);

	void OnShoot(const class ABall* _ball, const struct FShootParams& _shootParams);
	void OnTrajectoryCleared();
	void OnTrajectoryUpdated(const class ABall* _ball, const struct FShootParams& _shootParams);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_ApplyShoot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_ApplyShoot")
	}
	static class UAbilityTask_ApplyShoot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_ApplyShoot>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_ApplyShoot;

// Class Runtime.AbilityTask_ApplyVolleyShoot
// 0x0028 (0x00E8 - 0x00C0)
class UAbilityTask_ApplyVolleyShoot final : public UAbilityTask_ApplyShoot
{
public:
	TMulticastInlineDelegate<void()>              m_OnVolleyRefused;                                 // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D0[0x18];                                      // 0x00D0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_ApplyVolleyShoot* BPF_ApplyVolleyShootTask(const struct FShootParams& _shootParams, class UGameplayAbility* _instigatorAbility, class ABall* _ball, class UAbilityTask_BallInteractionRequest* _ballInteractionRequestTask, bool _bAttachedToPlayer);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_ApplyVolleyShoot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_ApplyVolleyShoot")
	}
	static class UAbilityTask_ApplyVolleyShoot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_ApplyVolleyShoot>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_ApplyVolleyShoot;

// Class Runtime.BallPhysicSettings
// 0x0028 (0x0060 - 0x0038)
class UBallPhysicSettings final : public UDeveloperSettings
{
public:
	float                                         m_fSpeedStopMoving;                                // 0x0038(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_fPredictionDuration;                             // 0x003C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_fPredictionSimFrequency;                         // 0x0040(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 m_fAimPointAngleInDegreesSteps;                    // 0x0048(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	int32                                         m_iMaxAimPointComputationCount;                    // 0x0058(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_bHasNoBounceCollisionChannel;                    // 0x005C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECollisionChannel                             m_eNoBounceCollisionChannel;                       // 0x005D(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BallPhysicSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BallPhysicSettings")
	}
	static class UBallPhysicSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBallPhysicSettings>();
	}
};
DUMPER7_ASSERTS_UBallPhysicSettings;

// Class Runtime.ExperienceComponentBase
// 0x0018 (0x0040 - 0x0028)
class UExperienceComponentBase : public UObject
{
public:
	class FText                                   m_Title;                                           // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	EExperienceElementType                        m_eType;                                           // 0x0038(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BPE_ComputeComponentData(const class UObject* _worldContext, int32 _iOldTotalExperience, const class FName& _playerId, TArray<struct FExperienceComponentData>& _outComponentsData) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExperienceComponentBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExperienceComponentBase")
	}
	static class UExperienceComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExperienceComponentBase>();
	}
};
DUMPER7_ASSERTS_UExperienceComponentBase;

// Class Runtime.GroupExperienceComponent
// 0x0018 (0x0058 - 0x0040)
class UGroupExperienceComponent final : public UExperienceComponentBase
{
public:
	TArray<struct FExperienceComponentInstance>   m_Components;                                      // 0x0040(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	bool                                          m_bShouldBeConsideredAsOneComponent;               // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroupExperienceComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroupExperienceComponent")
	}
	static class UGroupExperienceComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroupExperienceComponent>();
	}
};
DUMPER7_ASSERTS_UGroupExperienceComponent;

// Class Runtime.AbilityTask_BallInteractionRequest
// 0x0060 (0x00F8 - 0x0098)
class UAbilityTask_BallInteractionRequest final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void()>              OnRequestSuccess;                                  // 0x0098(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void()>              OnRequestFail;                                     // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B8[0x40];                                      // 0x00B8(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_BallInteractionRequest* BPF_BallInteractionRequest(class UGameplayAbility* _owningAbility, EBallInteractionRequestType _eType, const struct FGameplayAbilityTargetDataHandle& _context, const struct FGameplayTag& _gameplayTag);

	void ServerReceiveRequest(const struct FGameplayAbilityTargetDataHandle& _data, const struct FGameplayTag& _activationTag);

	void ClearRequest() const;
	bool HasRequestBeenGranted() const;
	bool HasRequestBeenProcessed() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_BallInteractionRequest")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_BallInteractionRequest")
	}
	static class UAbilityTask_BallInteractionRequest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_BallInteractionRequest>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_BallInteractionRequest;

// Class Runtime.AbilityTask_HandleHindering
// 0x0058 (0x0140 - 0x00E8)
class UAbilityTask_HandleHindering final : public UAbilityTask_ApplyRootMotion_Base
{
public:
	uint8                                         Pad_E8[0x3C];                                      // 0x00E8(0x003C)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class ASCCharacter>            m_Instigator;                                      // 0x0124(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_12C[0xC];                                      // 0x012C(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterHinderingConfig*              m_CharacterConfig;                                 // 0x0138(0x0008)(Net, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UAbilityTask_HandleHindering* BPF_HandleHindering(class UGameplayAbility* _owningAbility, const class AActor* _instigator, const class UCharacterHinderingConfig* _config, ERootMotionFinishVelocityMode _eVelocityOnFinishMode, const struct FVector& _vSetVelocityOnFinish, float _fClampVelocityOnFinish);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_HandleHindering")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_HandleHindering")
	}
	static class UAbilityTask_HandleHindering* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_HandleHindering>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_HandleHindering;

// Class Runtime.CharacterCustomizationParser
// 0x0000 (0x0028 - 0x0028)
class UCharacterCustomizationParser : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CharacterCustomizationParser")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CharacterCustomizationParser")
	}
	static class UCharacterCustomizationParser* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterCustomizationParser>();
	}
};
DUMPER7_ASSERTS_UCharacterCustomizationParser;

// Class Runtime.RuntimeGameFlowState
// 0x00D0 (0x0590 - 0x04C0)
class URuntimeGameFlowState : public USCGameFlowState
{
public:
	bool                                          m_bHideBalls;                                      // 0x04C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, class FName>        m_MatchTypeToTransition;                           // 0x04C8(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)
	ERuntimeGameFlowTravelTeamComposition         m_eTeamComposition;                                // 0x0518(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bNotifyServicesPostMatchEnd;                     // 0x0519(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bResetCharacters;                                // 0x051A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bResetBalls;                                     // 0x051B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_51C[0x4];                                      // 0x051C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAkStateValue*>                  m_AkStates;                                        // 0x0520(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UAkAudioEvent*                          m_AkEvent;                                         // 0x0530(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bUsePrematchStartSpot;                           // 0x0538(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FMenuTransitionData> m_TransitionSequences;                             // 0x0540(0x0050)(Edit, NativeAccessSpecifierPrivate)

public:
	static TArray<class FName> GetMatchStateArray();

	void BPF_ResetBallsAndCharacters();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RuntimeGameFlowState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RuntimeGameFlowState")
	}
	static class URuntimeGameFlowState* GetDefaultObj()
	{
		return GetDefaultObjImpl<URuntimeGameFlowState>();
	}
};
DUMPER7_ASSERTS_URuntimeGameFlowState;

// Class Runtime.LevelSequenceFlowState
// 0x0098 (0x0628 - 0x0590)
class ULevelSequenceFlowState : public URuntimeGameFlowState
{
public:
	bool                                          m_bUseLevelSequenceDurationAsSynchroTime;          // 0x0590(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_591[0x3];                                      // 0x0591(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_fLevelSequenceDurationTolerance;                 // 0x0594(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARuntimeLevelSequenceActor*             m_CurrentLevelSequenceActor;                       // 0x0598(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5A0[0x1];                                      // 0x05A0(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	ELevelSequenceFlowStateType                   m_LevelSequenceType;                               // 0x05A1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5A2[0x6];                                      // 0x05A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         m_LevelSequenceToPlay;                             // 0x05A8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   m_LevelSequenceActorClass;                         // 0x05B0(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class ARuntimeLevelSequenceActor> m_LoadedLevelSequenceActorClass;                   // 0x05D8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           m_LevelSequenceActorTag;                           // 0x05E0(0x0008)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bMakeGoalScorerTeamMainTeam;                     // 0x05E8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5E9[0x7];                                      // 0x05E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           m_TeamsTags;                                       // 0x05F0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FBindingTagRequest                     m_CaptainBindingTag;                               // 0x0600(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FBindingTagRequest                     m_GoalScorerBindingTag;                            // 0x060C(0x000C)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          m_bHidePlayerNotBinds;                             // 0x0618(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_619[0x7];                                      // 0x0619(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class APawn>                      m_FakePawnToSpawnClass;                            // 0x0620(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnLevelSequenceFinished();
	void OnLevelSequencePlay();
	void PlayLevelSequenceOnClient();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LevelSequenceFlowState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LevelSequenceFlowState")
	}
	static class ULevelSequenceFlowState* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelSequenceFlowState>();
	}
};
DUMPER7_ASSERTS_ULevelSequenceFlowState;

// Class Runtime.FinisherHandlerFlowState
// 0x0000 (0x0628 - 0x0628)
class UFinisherHandlerFlowState : public ULevelSequenceFlowState
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FinisherHandlerFlowState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FinisherHandlerFlowState")
	}
	static class UFinisherHandlerFlowState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFinisherHandlerFlowState>();
	}
};
DUMPER7_ASSERTS_UFinisherHandlerFlowState;

// Class Runtime.AbilityTask_HandleSteeringLocomotion
// 0x0058 (0x0140 - 0x00E8)
class UAbilityTask_HandleSteeringLocomotion final : public UAbilityTask_ApplyRootMotion_Base
{
public:
	class UCurveFloat*                            m_SpeedCurve;                                      // 0x00E8(0x0008)(Net, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         m_fSpeed;                                          // 0x00F0(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            m_TrackingCurve;                                   // 0x00F8(0x0008)(Net, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         m_fTrackingSpeed;                                  // 0x0100(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USCInputAction*                         m_action;                                          // 0x0108(0x0008)(Net, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int16                                         m_iActivationPredictionKey;                        // 0x0110(0x0002)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_fServerStartTime;                                // 0x0114(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_118[0x28];                                     // 0x0118(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_HandleSteeringLocomotion* BPF_HandleSteeringLocomotion(class UGameplayAbility* _owningAbility, class FName _taskInstanceName, class USCInputAction* _action, float _fSpeed, class UCurveFloat* _speedCurve, float _fTrackingSpeed, class UCurveFloat* _trackingCurve, float _fInputDelay, float _fUpdateInputFrequency);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_HandleSteeringLocomotion")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_HandleSteeringLocomotion")
	}
	static class UAbilityTask_HandleSteeringLocomotion* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_HandleSteeringLocomotion>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_HandleSteeringLocomotion;

// Class Runtime.AbilityTask_MoveToCollision
// 0x0038 (0x00D0 - 0x0098)
class UAbilityTask_MoveToCollision final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void()>              OnTimedOut;                                        // 0x0098(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnTimedOutAndDestinationReached;                   // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x18];                                      // 0x00B8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_MoveToCollision* BPF_MoveToCollision(class UGameplayAbility* _owningAbility, float _fMaxDuration, float _fMinDistanceToRun, ECollisionChannel _eCollisionChannel);

	void OnTimedOutAndDestinationReachedCallBack();
	void OnTimedOutCallBack();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_MoveToCollision")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_MoveToCollision")
	}
	static class UAbilityTask_MoveToCollision* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_MoveToCollision>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_MoveToCollision;

// Class Runtime.BaseShootRotationForceComputation
// 0x0000 (0x0028 - 0x0028)
class UBaseShootRotationForceComputation : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseShootRotationForceComputation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseShootRotationForceComputation")
	}
	static class UBaseShootRotationForceComputation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseShootRotationForceComputation>();
	}
};
DUMPER7_ASSERTS_UBaseShootRotationForceComputation;

// Class Runtime.ModifierShootRotationForceComputation
// 0x0000 (0x0028 - 0x0028)
class UModifierShootRotationForceComputation : public UBaseShootRotationForceComputation
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ModifierShootRotationForceComputation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ModifierShootRotationForceComputation")
	}
	static class UModifierShootRotationForceComputation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModifierShootRotationForceComputation>();
	}
};
DUMPER7_ASSERTS_UModifierShootRotationForceComputation;

// Class Runtime.InputShootRotationForceComputation
// 0x0040 (0x0068 - 0x0028)
class UInputShootRotationForceComputation : public UModifierShootRotationForceComputation
{
public:
	bool                                          m_bSwapAxis;                                       // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            m_XSpinningRotationCurve;                          // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            m_YSpinningRotationCurve;                          // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bWaitInputChange;                                // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_fToleranceAngleToActivate;                       // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         m_fDeadZoneToActivate;                             // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bBlockIfForceInputHeld;                          // 0x004C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bUseAccumulatorSystemCalculation;                // 0x004D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_fAccumulatorSensibility;                         // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameOption>                m_MagnusSensitivityOption;                         // 0x0058(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bInverseXRotation;                               // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bInverseYRotation;                               // 0x0061(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InputShootRotationForceComputation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InputShootRotationForceComputation")
	}
	static class UInputShootRotationForceComputation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputShootRotationForceComputation>();
	}
};
DUMPER7_ASSERTS_UInputShootRotationForceComputation;

// Class Runtime.GoalInvolvedTargetDataHelpers
// 0x0000 (0x0028 - 0x0028)
class UGoalInvolvedTargetDataHelpers final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GoalInvolvedTargetDataHelpers")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GoalInvolvedTargetDataHelpers")
	}
	static class UGoalInvolvedTargetDataHelpers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGoalInvolvedTargetDataHelpers>();
	}
};
DUMPER7_ASSERTS_UGoalInvolvedTargetDataHelpers;

// Class Runtime.AbilityTask_NetworkFindBallTarget
// 0x0100 (0x0198 - 0x0098)
class UAbilityTask_NetworkFindBallTarget final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void(const struct FBallInterceptionPointTargetData& _found, const struct FTargetingContext& _targetContext)> OnFound; // 0x0098(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(const struct FBallInterceptionPointTargetData& _found, const struct FTargetingContext& _targetContext)> OnUnfound; // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(const struct FBallInterceptionPointTargetData& _found, const struct FTargetingContext& _targetContext)> OnTargetRejected; // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(const struct FBallInterceptionPointTargetData& _found, const struct FTargetingContext& _targetContext)> OnCancel; // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D8[0xC0];                                      // 0x00D8(0x00C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_NetworkFindBallTarget* BPF_NetworkFindBallTarget(class UGameplayAbility* _owningAbility, const struct FOnDemandTargetProvider& _targetProvider, const struct FOnDemandTargetProvider& _targetValidationProvider, const struct FGameplayTag& _gameplayTag, bool _bDoOnce);
	static class UAbilityTask_NetworkFindBallTarget* BPF_NetworkFindBallTargetWithCancelInput(class UGameplayAbility* _owningAbility, const struct FOnDemandTargetProvider& _targetProvider, const struct FOnDemandTargetProvider& _targetValidationProvider, const struct FGameplayTag& _gameplayTag, class USCInputAction* _inAction, EInputWatchTrigger _eWatchTrigger, bool _bDoOnce);

	void InitCancel(class USCInputAction* _inAction, EInputWatchTrigger _eWatchTrigger);
	void OnAbilityTaskCancel();
	void OnCancelInput(const class USCInputAction* _action, const struct FInputActionState& _listenerState);
	void OnServerReady();
	void SearchTarget();
	void ServerReceiveTargetData(const struct FGameplayAbilityTargetDataHandle& _data, const struct FGameplayTag& _activationTag);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_NetworkFindBallTarget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_NetworkFindBallTarget")
	}
	static class UAbilityTask_NetworkFindBallTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_NetworkFindBallTarget>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_NetworkFindBallTarget;

// Class Runtime.AbilityTask_NetworkHitProjection
// 0x0090 (0x0128 - 0x0098)
class UAbilityTask_NetworkHitProjection final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> OnHitPredicted; // 0x0098(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void()>              OnHitProjectionFailed;                             // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	class UAbilityTask_HandleHitboxBase*          m_HandleHitboxBaseTaskPtr;                         // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C0[0x68];                                      // 0x00C0(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_NetworkHitProjection* BPF_NetworkHitProjection(class UGameplayAbility* _owningAbility, const struct FGameplayAbilityTargetDataHandle& _context, TSubclassOf<class UTargetDatasource> _datasource, TSubclassOf<class UTargetPicker> _picker, const struct FGameplayTag& _gameplayTag, class UAbilityTask_HandleHitboxBase* _handleHitboxTaskPtr);

	void ServerReceiveTargetData(const struct FGameplayAbilityTargetDataHandle& _data, const struct FGameplayTag& _activationTag);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_NetworkHitProjection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_NetworkHitProjection")
	}
	static class UAbilityTask_NetworkHitProjection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_NetworkHitProjection>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_NetworkHitProjection;

// Class Runtime.Goal
// 0x0068 (0x0318 - 0x02B0)
class AGoal : public AActor
{
public:
	uint8                                         m_uiTeam;                                          // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class AGoal* _goal, uint8 _uiTeam)> BPE_OnCrossbarHit;             // 0x02B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	bool                                          m_bToggleRestartMatch;                             // 0x02C8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bToggleVFX;                                      // 0x02C9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bToggleSFX;                                      // 0x02CA(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bToggleUIText;                                   // 0x02CB(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                m_vGoalExtraSize;                                  // 0x02D0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E8[0x30];                                     // 0x02E8(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BPE_GetCollision(class USceneComponent** _outCollision) const;
	bool BPF_IsPointInGoal(const struct FVector& _vPoint, bool _bUseGoalExtraSize) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Goal")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Goal")
	}
	static class AGoal* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGoal>();
	}
};
DUMPER7_ASSERTS_AGoal;

// Class Runtime.AbilityTask_NetworkHitValidation
// 0x0068 (0x0100 - 0x0098)
class UAbilityTask_NetworkHitValidation final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> OnHitPredicted; // 0x0098(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void()>              OnHitProjectionFailed;                             // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	class UAbilityTask_HandleHitboxBase*          m_HandleHitboxBaseTaskPtr;                         // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C0[0x40];                                      // 0x00C0(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_NetworkHitValidation* BPF_NetworkHitValidation(class UGameplayAbility* _owningAbility, const struct FGameplayAbilityTargetDataHandle& _context, TSubclassOf<class UTargetDatasource> _datasource, TSubclassOf<class UTargetPicker> _picker, const struct FGameplayTag& _gameplayTag, class UAbilityTask_HandleHitboxBase* _handleHitboxTaskPtr);

	void ServerReceiveTargetData(const struct FGameplayAbilityTargetDataHandle& _data, const struct FGameplayTag& _activationTag);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_NetworkHitValidation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_NetworkHitValidation")
	}
	static class UAbilityTask_NetworkHitValidation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_NetworkHitValidation>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_NetworkHitValidation;

// Class Runtime.AbilityTask_NetworkSyncShootData
// 0x0118 (0x02B8 - 0x01A0)
class UAbilityTask_NetworkSyncShootData final : public UAbilityTask_NetworkSyncWithDelay
{
public:
	uint8                                         Pad_1A0[0x118];                                    // 0x01A0(0x0118)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_NetworkSyncShootData* BPF_NetworkSyncShootDataWithInputs(class USCGameplayAbility* _owningAbility, const struct FRTInputActionsForNetworkSyncShoot& _inputAction, struct FShootPrepTargetData& _inOutShootPrep, const struct FGameplayAbilityTargetDataHandle& _context, const TArray<TSubclassOf<class UTrajectoryStatus>>& _trajectoryStatus, const struct FSCConditionsToSyncEarly& _conditionsToSyncEarly, const struct FRTNetworkSyncShootTimeArg& _networkSyncTimeArg, const struct FSCNetworkSyncData& _syncData, const struct FGameplayTag& _shootTypeTag);

	void BPF_GetShootParams(struct FShootParams* _outShootParams) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_NetworkSyncShootData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_NetworkSyncShootData")
	}
	static class UAbilityTask_NetworkSyncShootData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_NetworkSyncShootData>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_NetworkSyncShootData;

// Class Runtime.BallStealBinder
// 0x0098 (0x0190 - 0x00F8)
class UBallStealBinder final : public UGameStateScopedEventBinder
{
public:
	struct FGameplayTag                           m_FeedLogPlayerStealTag;                           // 0x00F8(0x0008)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagQuery                      m_ThiefRequiredTags;                               // 0x0100(0x0048)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagQuery                      m_StolenRequiredTags;                              // 0x0148(0x0048)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	void OnBallStolen(class ARuntimePlayerState* _playerStateThief, class ARuntimePlayerState* _playerStateStolen);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BallStealBinder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BallStealBinder")
	}
	static class UBallStealBinder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBallStealBinder>();
	}
};
DUMPER7_ASSERTS_UBallStealBinder;

// Class Runtime.RTCustomizationLevelSequenceDataAsset
// 0x0000 (0x0150 - 0x0150)
class URTCustomizationLevelSequenceDataAsset : public USCCustomizationLevelSequenceDataAsset
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RTCustomizationLevelSequenceDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RTCustomizationLevelSequenceDataAsset")
	}
	static class URTCustomizationLevelSequenceDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<URTCustomizationLevelSequenceDataAsset>();
	}
};
DUMPER7_ASSERTS_URTCustomizationLevelSequenceDataAsset;

// Class Runtime.FinisherCustomizationDataAsset
// 0x0008 (0x0158 - 0x0150)
class UFinisherCustomizationDataAsset final : public URTCustomizationLevelSequenceDataAsset
{
public:
	bool                                          m_bHideBallDuringSequence;                         // 0x0150(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m_iMinimumPlayersNumberRequired;                   // 0x0154(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FinisherCustomizationDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FinisherCustomizationDataAsset")
	}
	static class UFinisherCustomizationDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFinisherCustomizationDataAsset>();
	}
};
DUMPER7_ASSERTS_UFinisherCustomizationDataAsset;

// Class Runtime.AbilityTask_NetworkSyncTargetData
// 0x0088 (0x0120 - 0x0098)
class UAbilityTask_NetworkSyncTargetData final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> OnSync;      // 0x0098(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> OnTimeOut;   // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> OnCancel;    // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x58];                                      // 0x00C8(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_NetworkSyncTargetData* BPF_NetworkSyncTargetData(class UGameplayAbility* _owningAbility, const struct FGameplayAbilityTargetDataHandle& _targetData, float _fSleepDuration, float _fListenDuration, float _fLagCompensation);

	void OnCancelledCallback();
	void OnReplicatedCallback(const struct FGameplayAbilityTargetDataHandle& _data, const struct FGameplayTag& _activationTag);
	void OnSignalCallback();
	void SendSignalFromServer();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_NetworkSyncTargetData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_NetworkSyncTargetData")
	}
	static class UAbilityTask_NetworkSyncTargetData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_NetworkSyncTargetData>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_NetworkSyncTargetData;

// Class Runtime.ShootForceShootPrepCondition
// 0x0028 (0x00A0 - 0x0078)
class UShootForceShootPrepCondition final : public UTargetDataCondition
{
public:
	struct FSCMathExpressionFloat                 m_MathExpression;                                  // 0x0078(0x0020)(Edit, NativeAccessSpecifierPrivate)
	bool                                          m_bConvertToPercent;                               // 0x0098(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ShootForceShootPrepCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ShootForceShootPrepCondition")
	}
	static class UShootForceShootPrepCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShootForceShootPrepCondition>();
	}
};
DUMPER7_ASSERTS_UShootForceShootPrepCondition;

// Class Runtime.AbilityTask_NetworkWaitTargetData
// 0x0070 (0x0108 - 0x0098)
class UAbilityTask_NetworkWaitTargetData final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> OnReceived;  // 0x0098(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> OnTimeOut;   // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> OnCancel;    // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x40];                                      // 0x00C8(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_NetworkWaitTargetData* BPF_NetworkWaitTargetData(class UGameplayAbility* _owningAbility, EAbilityTaskNetWaitType _eType, const struct FGameplayAbilityTargetDataHandle& _targetData, float _fSleepDuration, float _fListenDuration);

	void OnCancelledCallback();
	void OnReplicatedCallback(const struct FGameplayAbilityTargetDataHandle& _data, const struct FGameplayTag& _activationTag);
	void OnSignalCallback();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_NetworkWaitTargetData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_NetworkWaitTargetData")
	}
	static class UAbilityTask_NetworkWaitTargetData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_NetworkWaitTargetData>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_NetworkWaitTargetData;

// Class Runtime.GoalKeeperDashInputToBallTargetAngleCondition
// 0x0008 (0x0080 - 0x0078)
class UGoalKeeperDashInputToBallTargetAngleCondition final : public UTargetDataCondition
{
public:
	float                                         m_fHalfAnglePrecision;                             // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GoalKeeperDashInputToBallTargetAngleCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GoalKeeperDashInputToBallTargetAngleCondition")
	}
	static class UGoalKeeperDashInputToBallTargetAngleCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGoalKeeperDashInputToBallTargetAngleCondition>();
	}
};
DUMPER7_ASSERTS_UGoalKeeperDashInputToBallTargetAngleCondition;

// Class Runtime.AbilityTask_PlayMontageFromAestheticMontage
// 0x0000 (0x0228 - 0x0228)
class UAbilityTask_PlayMontageFromAestheticMontage final : public UAbilityTask_SCPlayMontageAndWait
{
public:
	static class UAbilityTask_PlayMontageFromAestheticMontage* BPF_PlayMontageFromAestheticMontage(class USCGameplayAbility* _owningAbility, class UAbilityTask_PlaySimulatedAestheticMontage* _aestheticMontageTask, EAbilityExecOrigin _eIn, EAbilityExecOutputWithValidation* _eOut, class FName _taskInstanceName, float _fFallbackStartTime, TSubclassOf<class UAnimSequencePicker> _fallbackPicker, class FName _fallbackSlotName, class UBasicMontagePlayerConfiguration* _overrideConfiguration, bool _bLog, bool _bStopWhenAbilityEnds, const struct FGameplayAbilityTargetDataHandle& _playerContext, class FName _StartSection);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_PlayMontageFromAestheticMontage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_PlayMontageFromAestheticMontage")
	}
	static class UAbilityTask_PlayMontageFromAestheticMontage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_PlayMontageFromAestheticMontage>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_PlayMontageFromAestheticMontage;

// Class Runtime.AbilityTask_PlaySimulatedAestheticMontage
// 0x0060 (0x00F8 - 0x0098)
class UAbilityTask_PlaySimulatedAestheticMontage final : public UAbilityTask
{
public:
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnBlendOut;                                        // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnEnded;                                           // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UAnimMontage*                           m_AestheticMontage;                                // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimMontage*                           m_BaseMontage;                                     // 0x00C8(0x0008)(Net, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bMirror;                                         // 0x00D0(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_fPlayRate;                                       // 0x00D4(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
