#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SCCharacterCustomization

#include "Basic.hpp"

#include "SCCharacterCustomization_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "StructUtils_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SCCore_structs.hpp"
#include "SCCore_classes.hpp"


namespace SDK
{

// Class SCCharacterCustomization.CharacterCustomizationComponent
// 0x0590 (0x0648 - 0x00B8)
class UCharacterCustomizationComponent : public UActorComponent
{
public:
	TMulticastInlineDelegate<void(class UCharacterCustomizationComponent* _characterCustomizationComponent, bool _bWasCharacterGenerated)> m_OnCharacterGenerated; // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x20];                                      // 0x00C8(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          m_bSimplifiedMaterialModeEnabled;                  // 0x00E8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterial*                              m_SimplifiedMaterial;                              // 0x00F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<struct FCharacterPartEnumHandler, class UMaterial*> m_SimplifiedMaterialPerPart;            // 0x00F8(0x0050)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FCharacterPartEnumHandler              m_PartAssignedToMainMesh;                          // 0x0148(0x0050)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UAnimInstance>              m_PostProcessAnimBlueprint;                        // 0x0198(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FCharacterPartEnumHandler              m_PartAssignedToMainPhysicAsset;                   // 0x01A0(0x0050)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USCCharacterCustomizationParameterLinks* m_ParameterLinksAsset;                            // 0x01F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bMergeMeshAllowed;                               // 0x01F8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m_iNeededMergeablePartCount;                       // 0x01FC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bSeparateMeshesPerLODCount;                      // 0x0200(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bForceSyncLoad;                                  // 0x0201(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_202[0x6];                                      // 0x0202(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCharacterPartEnumHandler>      m_NonMergeableParts;                               // 0x0208(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<struct FCharacterPartEnumHandler, class FName> m_SocketToAttachedTo;                        // 0x0218(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FCollisionProfileName                  m_CosmeticsCollision;                              // 0x0268(0x0008)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FCharacterPartEnumHandler>      m_NeedRetargetingParts;                            // 0x0270(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FCharacterPartEnumHandler>      m_ForcedMaterialDynamicParts;                      // 0x0280(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FCharacterPartEnumHandler>      m_BodyParts;                                       // 0x0290(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FName                                   m_CullParameterName;                               // 0x02A0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   m_CullVecParameterName;                            // 0x02A8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<struct FCharacterPartEnumHandler, struct FCharacterPartCullDescription> m_CullableByMap;    // 0x02B0(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                          m_bCopyMaterialIfHasAnyChange;                     // 0x0300(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMesh*>                  m_GeneratedMeshes;                                 // 0x0308(0x0010)(Edit, ZeroConstructor, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	TArray<class UObject*>                        m_LoadedExtraAssets;                               // 0x0318(0x0010)(Edit, ZeroConstructor, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	TArray<struct FInstancedStruct>               m_GeneratedExtraInfos;                             // 0x0328(0x0010)(Edit, ZeroConstructor, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	TMap<struct FCharacterPartEnumHandler, class USkeletalMeshComponent*> m_NonMergeableMeshComponents; // 0x0338(0x0050)(Edit, ExportObject, Transient, EditConst, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class USkeletalMeshComponent>  m_OwnerMesh;                                       // 0x0388(0x0008)(Edit, ExportObject, ZeroConstructor, Transient, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FCharacterMeshDescription              m_CurrentCharacterMeshDescription;                 // 0x0390(0x0030)(Edit, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	struct FCharacterMeshDescription              m_PendingCharacterMeshDescription;                 // 0x03C0(0x0030)(Edit, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	struct FSCCharacterCustomizationDescription   m_CurrentOrPendingCustoDescription;                // 0x03F0(0x00F0)(Edit, Transient, EditConst, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4E0[0x160];                                    // 0x04E0(0x0160)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          m_bAllowTimeSlicing;                               // 0x0640(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_641[0x7];                                      // 0x0641(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BPE_HandleClearExtraAssets();
	void BPE_HandleSpawnExtraAssets(const TArray<struct FPrimaryAssetId>& _extrasAssets);
	void BPF_GenerateCharacterFromCusto(const struct FSCCharacterCustomizationDescription& _custoDescription, bool _bForceRebuild);
	void BPF_SetMergeMeshAllowed(bool _bInAllowed);
	void BPF_SetSimplifiedMaterialModeEnabled(bool _bInEnabled);
	void OnAllExtraAssetsSaved();

	void BPE_InitGeneratedMeshComponent(class USkeletalMeshComponent* _generatedMeshComp, int32 _iCharacterPart) const;
	const struct FSCCharacterCustomizationDescription BPF_GetCurrentCharacterDescription() const;
	class UObject* BPF_GetExtraAsset(const struct FExtraAssetEnumHandler& _extraAsset) const;
	const struct FInstancedStruct BPF_GetExtraInfo(const struct FExtraInfoEnumHandler& _extraInfo) const;
	class USkeletalMeshComponent* BPF_GetMeshComponentByCharacterPart(const struct FCharacterPartEnumHandler& _eCharacterPart) const;
	bool BPF_ShouldRegenerateCharacter(const struct FSCCharacterCustomizationDescription& _custoDescription) const;
	class USkeletalMeshComponent* GetMasterComponent() const;
	TArray<class FName> GetSkeletonSockets() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CharacterCustomizationComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CharacterCustomizationComponent")
	}
	static class UCharacterCustomizationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterCustomizationComponent>();
	}
};
DUMPER7_ASSERTS_UCharacterCustomizationComponent;

// Class SCCharacterCustomization.CharacterCustomizationHelpers
// 0x0000 (0x0028 - 0x0028)
class UCharacterCustomizationHelpers final : public UBlueprintFunctionLibrary
{
public:
	static bool BPF_DoesPrimaryAssetTypesContain(const TArray<struct FPrimaryAssetType>& _assetTypesToCheck, const TSoftObjectPtr<class UObject> _objectToTest);
	static void BPF_EnumToBodyBuildEnumHandler(int32 _iValue, struct FBodyBuildEnumHandler* _eOutHandler);
	static void BPF_EnumToCharacterPartEnumHandler(int32 _iValue, struct FCharacterPartEnumHandler* _eOutHandler);
	static void BPF_EnumToExtraAssetEnumHandler(int32 _iValue, struct FExtraAssetEnumHandler* _eOutHandler);
	static void BPF_EnumToExtraInfoEnumHandler(int32 _iValue, struct FExtraInfoEnumHandler* _eOutHandler);
	static void BPF_EnumToGenderEnumHandler(int32 _iValue, struct FGenderEnumHandler* _eOutHandler);
	static int32 BPF_FindCustoColorIndexFromColor(const TArray<struct FCustoColor>& _custoColorOptions, const struct FLinearColor& _color);
	static struct FSCPartParameterDescription BPF_FindOrAddParameterDescriptionFromParameterName(struct FSCCharacterPartDescription& _characterPartDesc, const struct FCharacterPartEnumHandler& _eCharacterPart, const class FName& _parameterName, const ESCCharacterPartParameterTypes _eParameterType, bool _bCheck);
	static uint8 BPF_GetBodyBuildValue(const struct FBodyBuildEnumHandler& _eBodyBuild, bool* _bOutIsValid);
	static uint8 BPF_GetCharacterPartValue(const struct FCharacterPartEnumHandler& _eCharacterPart, bool* _bOutIsValid);
	static TArray<struct FLinearColor> BPF_GetColors(const TArray<struct FCustoColor>& _custoColors);
	static const class USCCharacterCustomizationUIInfosAsset* BPF_GetCustomizationUIInfos();
	static uint8 BPF_GetExtraAssetValue(const struct FExtraAssetEnumHandler& _eExtraAsset, bool* _bOutIsValid);
	static uint8 BPF_GetExtraInfoValue(const struct FExtraInfoEnumHandler& _eExtraAsset, bool* _bOutIsValid);
	static uint8 BPF_GetGenderValue(const struct FGenderEnumHandler& _eGender, bool* _bOutIsValid);
	static struct FSCCharacterPartDescription BPF_GetOrAddPartDescriptionFromCharacterPart(struct FSCCharacterCustomizationDescription& _characterCustomizationDesc, const struct FCharacterPartEnumHandler& _eCharacterPart);
	static TArray<struct FCharacterPartEnumHandler> BPF_GetOwners(const struct FCharacterCustomizationRowUIBuilderStruct& _custoUIBuilderRow);
	static TArray<class FName> BPF_GetParameters(const struct FCharacterCustomizationRowUIBuilderStruct& _custoUIBuilderRow);
	static const struct FSCCharacterPartDescription BPF_GetPartDescriptionFromCharacterPart(const struct FSCCharacterCustomizationDescription& _characterCustomizationDesc, const struct FCharacterPartEnumHandler& _eCharacterPart);
	static TArray<struct FCharacterCustomizationRowUIBuilderStruct> BPF_GetRows(const struct FSubCategoryUIBuilder& _subCategory);
	static bool BPF_IsParametersMerge(const struct FCharacterCustomizationRowUIBuilderStruct& _custoUIBuilderRow);
	static struct FSCCharacterCustomizationDescription BPF_OverrideCharacterParts(struct FSCCharacterCustomizationDescription& _characterCustomizationDesc, const struct FSCCharacterCustomizationDescription& _custoDescToOverrideWith, bool _bIncludeDataAssets, bool _bCanOverrideWithNull);
	static void BPF_SetCharacterPartMesh(struct FSCCharacterCustomizationDescription& _characterCustomizationDesc, const struct FCharacterPartEnumHandler& _eCharacterPart, TSoftObjectPtr<class USCCharacterPartDataAsset> _characterPartModel);
	static void BPF_SetCharacterPartParameter(struct FSCCharacterCustomizationDescription& _characterCustomizationDesc, const struct FCharacterPartEnumHandler& _eCharacterPart, const struct FSCPartParameterDescription& _parameterValue, bool _bCheck);
	static void BPF_SetMaterialParameter(class UMaterialInstanceDynamic* _material, class FName _parameterName, const struct FSCPartParameterValue& _parameterValue);
	static void BPF_TryGetParameterDescriptionFromParameterName(const struct FSCCharacterPartDescription& _characterPartDesc, const class FName& _parameterName, const ESCCharacterPartParameterTypes _eParameterType, struct FSCPartParameterDescription* _outParamDesc, bool* _bOutFound);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CharacterCustomizationHelpers")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CharacterCustomizationHelpers")
	}
	static class UCharacterCustomizationHelpers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterCustomizationHelpers>();
	}
};
DUMPER7_ASSERTS_UCharacterCustomizationHelpers;

// Class SCCharacterCustomization.CustomizationTextureUserData
// 0x01A8 (0x01D0 - 0x0028)
class UCustomizationTextureUserData final : public UAssetUserData
{
public:
	class FText                                   m_DisplayName;                                     // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FText                                   m_Description;                                     // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FInstancedStruct                       m_AdditionnalInfos;                                // 0x0048(0x0010)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  m_Tags;                                            // 0x0058(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class UCurveColorPaletteAsset*                m_CurveColorPalette;                               // 0x0078(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETextureThumbnailMode                         m_ThumbnailMode;                                   // 0x0080(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              m_ThumbnailImage;                                  // 0x0088(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSCCustomizationId                     m_ThumbnailPose;                                   // 0x00B0(0x0120)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CustomizationTextureUserData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CustomizationTextureUserData")
	}
	static class UCustomizationTextureUserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizationTextureUserData>();
	}
};
DUMPER7_ASSERTS_UCustomizationTextureUserData;

// Class SCCharacterCustomization.CurveColorPaletteAsset
// 0x0010 (0x0040 - 0x0030)
class UCurveColorPaletteAsset final : public UDataAsset
{
public:
	TArray<TSoftObjectPtr<class UCurveLinearColor>> m_CurveColors;                                   // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CurveColorPaletteAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CurveColorPaletteAsset")
	}
	static class UCurveColorPaletteAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCurveColorPaletteAsset>();
	}
};
DUMPER7_ASSERTS_UCurveColorPaletteAsset;

// Class SCCharacterCustomization.SCBaseCustomizationDataAsset
// 0x0050 (0x0080 - 0x0030)
class USCBaseCustomizationDataAsset : public UDataAsset
{
public:
	class FText                                   m_DisplayName;                                     // 0x0030(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   m_Description;                                     // 0x0040(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  m_Tags;                                            // 0x0050(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FInstancedStruct                       m_AdditionnalInfos;                                // 0x0070(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SCBaseCustomizationDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SCBaseCustomizationDataAsset")
	}
	static class USCBaseCustomizationDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USCBaseCustomizationDataAsset>();
	}
};
DUMPER7_ASSERTS_USCBaseCustomizationDataAsset;

// Class SCCharacterCustomization.SCCharacterCustomizationContainer
// 0x00F0 (0x0118 - 0x0028)
class USCCharacterCustomizationContainer : public UObject
{
public:
	struct FSCCharacterCustomizationDescription   m_CharacterCustomizationDesc;                      // 0x0028(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SCCharacterCustomizationContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SCCharacterCustomizationContainer")
	}
	static class USCCharacterCustomizationContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<USCCharacterCustomizationContainer>();
	}
};
DUMPER7_ASSERTS_USCCharacterCustomizationContainer;

// Class SCCharacterCustomization.SCCharacterCustomizationDataAssetContainer
// 0x0038 (0x0068 - 0x0030)
class USCCharacterCustomizationDataAssetContainer final : public UDataAsset
{
public:
	TArray<TSoftObjectPtr<class USCBaseCustomizationDataAsset>> m_Assets;                            // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture>                m_Thumbnail;                                       // 0x0040(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SCCharacterCustomizationDataAssetContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SCCharacterCustomizationDataAssetContainer")
	}
	static class USCCharacterCustomizationDataAssetContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<USCCharacterCustomizationDataAssetContainer>();
	}
};
DUMPER7_ASSERTS_USCCharacterCustomizationDataAssetContainer;

// Class SCCharacterCustomization.SCCharacterCustomizationMandatoryRulesDataAsset
// 0x0100 (0x0130 - 0x0030)
class USCCharacterCustomizationMandatoryRulesDataAsset final : public UDataAsset
{
public:
	struct FGenderEnumHandler                     m_eGender;                                         // 0x0030(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBodyBuildEnumHandler                  m_eBodyBuild;                                      // 0x0090(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSCCharacterPartDataAssetOverrideCondition> m_MandatoryCharacterPartRules;         // 0x00F0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FSCParameterOverrideCondition>  m_MandatoryParameterRules;                         // 0x0100(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FSCExtraAssetOverrideCondition> m_MandatoryExtraAssetRules;                        // 0x0110(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FSCExtraInfoOverrideCondition>  m_MandatoryExtraInfoRules;                         // 0x0120(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SCCharacterCustomizationMandatoryRulesDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SCCharacterCustomizationMandatoryRulesDataAsset")
	}
	static class USCCharacterCustomizationMandatoryRulesDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USCCharacterCustomizationMandatoryRulesDataAsset>();
	}
};
DUMPER7_ASSERTS_USCCharacterCustomizationMandatoryRulesDataAsset;

// Class SCCharacterCustomization.SCBaseCharacterCustomizationUIBuilderAsset
// 0x0000 (0x0030 - 0x0030)
class USCBaseCharacterCustomizationUIBuilderAsset : public UDataAsset
{
public:
	TArray<class FName> GetAllParameterNames() const;
	TArray<class FName> GetTextureParameterNames() const;
	TArray<class FName> GetUIExposedColorParameterNames() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SCBaseCharacterCustomizationUIBuilderAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SCBaseCharacterCustomizationUIBuilderAsset")
	}
	static class USCBaseCharacterCustomizationUIBuilderAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USCBaseCharacterCustomizationUIBuilderAsset>();
	}
};
DUMPER7_ASSERTS_USCBaseCharacterCustomizationUIBuilderAsset;

// Class SCCharacterCustomization.SCCharacterCustomizationParameterLinks
// 0x0010 (0x0040 - 0x0030)
class USCCharacterCustomizationParameterLinks final : public USCBaseCharacterCustomizationUIBuilderAsset
{
public:
	TArray<struct FSCCharacterCustomizationParameterLink> m_Links;                                   // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SCCharacterCustomizationParameterLinks")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SCCharacterCustomizationParameterLinks")
	}
	static class USCCharacterCustomizationParameterLinks* GetDefaultObj()
	{
		return GetDefaultObjImpl<USCCharacterCustomizationParameterLinks>();
	}
};
DUMPER7_ASSERTS_USCCharacterCustomizationParameterLinks;

// Class SCCharacterCustomization.SCCharacterCustomizationSettings
// 0x04B0 (0x04F8 - 0x0048)
class USCCharacterCustomizationSettings final : public USCBaseGameSettings
{
public:
	struct FSCUserEnumSetting                     m_ProjectUserEnums[0xB];                           // 0x0048(0x0048)(Edit, Config, NativeAccessSpecifierPublic)
	uint8                                         Pad_360[0x110];                                    // 0x0360(0x0110)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USCCharacterCustomizationUIInfosAsset> m_UIInfos;                           // 0x0470(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class USCCharacterPartDataAsset> m_AssetConsideredAsNone;                         // 0x0498(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class USCCustomizationSetDataAsset> m_SetConsideredAsNone;                        // 0x04C0(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<TSoftObjectPtr<class UTexture2D>>      m_TextureConsideredAsNoneArray;                    // 0x04E8(0x0010)(Edit, ZeroConstructor, Config, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SCCharacterCustomizationSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SCCharacterCustomizationSettings")
	}
	static class USCCharacterCustomizationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<USCCharacterCustomizationSettings>();
	}
};
DUMPER7_ASSERTS_USCCharacterCustomizationSettings;

// Class SCCharacterCustomization.SCCharacterCustomizationTimeSlicingSubsystem
// 0x0020 (0x0180 - 0x0160)
class USCCharacterCustomizationTimeSlicingSubsystem final : public USCWorldSubsystem
{
public:
	uint8                                         Pad_160[0x20];                                     // 0x0160(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SCCharacterCustomizationTimeSlicingSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SCCharacterCustomizationTimeSlicingSubsystem")
	}
	static class USCCharacterCustomizationTimeSlicingSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USCCharacterCustomizationTimeSlicingSubsystem>();
	}
};
DUMPER7_ASSERTS_USCCharacterCustomizationTimeSlicingSubsystem;

// Class SCCharacterCustomization.SCCharacterCustomizationRowUIBuilderPresetAsset
// 0x0010 (0x0040 - 0x0030)
class USCCharacterCustomizationRowUIBuilderPresetAsset final : public USCBaseCharacterCustomizationUIBuilderAsset
{
public:
	TArray<struct FCharacterCustomizationRowUIBuilderStruct> m_Rows;                                 // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SCCharacterCustomizationRowUIBuilderPresetAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SCCharacterCustomizationRowUIBuilderPresetAsset")
	}
	static class USCCharacterCustomizationRowUIBuilderPresetAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USCCharacterCustomizationRowUIBuilderPresetAsset>();
	}
};
DUMPER7_ASSERTS_USCCharacterCustomizationRowUIBuilderPresetAsset;

// Class SCCharacterCustomization.SCCharacterCustomizationUIBuilderAsset
// 0x0010 (0x0040 - 0x0030)
class USCCharacterCustomizationUIBuilderAsset final : public USCBaseCharacterCustomizationUIBuilderAsset
{
public:
	TArray<struct FMainCategoryUIBuilder>         m_UICategories;                                    // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SCCharacterCustomizationUIBuilderAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SCCharacterCustomizationUIBuilderAsset")
	}
	static class USCCharacterCustomizationUIBuilderAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USCCharacterCustomizationUIBuilderAsset>();
	}
};
DUMPER7_ASSERTS_USCCharacterCustomizationUIBuilderAsset;

// Class SCCharacterCustomization.SCCharacterCustomizationUIInfosAsset
// 0x0118 (0x0148 - 0x0030)
class USCCharacterCustomizationUIInfosAsset : public UDataAsset
{
public:
	class USCCustomizationCurveAtlasInfoDataAsset* m_CurveAtlasInfo;                                 // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USCColorListDataAsset*                  m_DefaultColorList;                                // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USCCustomizationViewModelBuilder*       m_ViewModelBuilder;                                // 0x0040(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FPrimaryAssetType>              m_DefaultTexturePrimaryAssetTypeArray;             // 0x0048(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FCharacterPartArrayUIInfosStruct       m_CharacterPartsData;                              // 0x0058(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FExtraAssetArrayUIInfosStruct          m_ExtraAssetsData;                                 // 0x0068(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FExtraInfoArrayUIInfosStruct           m_ExtraInfosData;                                  // 0x0078(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	TMap<TSoftObjectPtr<class UMaterial>, struct FParameterUIInfosMap> m_ParametersPerMaterial;      // 0x0088(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, struct FSoftObjectArray> m_AssetsPerFilter;                            // 0x00D8(0x0050)(Edit, EditConst, Protected, NativeAccessSpecifierProtected)
	TArray<struct FSpecificationsData>            m_ItemSpecData;                                    // 0x0128(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_138[0x10];                                     // 0x0138(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static TArray<class FName> GetAllUIExposedParameterNames();

	void BPF_GenerateCustomizationData();

	const TArray<struct FPrimaryAssetType> BPF_GetCharacterPrimaryAssetTypes(const struct FCharacterPartEnumHandler& _eCharacterPart) const;
	const TArray<struct FPrimaryAssetType> BPF_GetExtraAssetsPrimaryAssetTypes(const struct FExtraAssetEnumHandler& _eExtraAsset) const;
	const struct FExtraAssetUIInfosStruct BPF_GetExtraAssetsUIInfos(const struct FExtraAssetEnumHandler& _eExtraAsset) const;
	const struct FExtraInfoUIInfosStruct BPF_GetExtraInfoUIInfos(const struct FExtraInfoEnumHandler& _eExtraInfo) const;
	void BPF_GetParameterUIInfos(const struct FCharacterPartEnumHandler& _eCharacterPart, class FName _parameterName, struct FParameterUIInfosStruct* _foundParameterInfos, bool* _bFound) const;
	TArray<class FName> GetTextureParameterNames() const;
	TArray<class FName> GetUIExposedCurveParameterNameArray() const;
	TArray<class FName> GetUIExposedTextureParameterNameArray() const;
	TArray<class FName> GetUIExposedVectorParameterNameArray() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SCCharacterCustomizationUIInfosAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SCCharacterCustomizationUIInfosAsset")
	}
	static class USCCharacterCustomizationUIInfosAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USCCharacterCustomizationUIInfosAsset>();
	}
};
DUMPER7_ASSERTS_USCCharacterCustomizationUIInfosAsset;

// Class SCCharacterCustomization.UIExposedParametersAssetUserData
// 0x0030 (0x0058 - 0x0028)
class UUIExposedParametersAssetUserData final : public UAssetUserData
{
public:
	TArray<class FName>                           m_ScalarParameters;                                // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           m_TextureParameters;                               // 0x0038(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           m_VectorParameters;                                // 0x0048(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	TArray<class FName> GetMaterialScalarParameterNameArray() const;
	TArray<class FName> GetMaterialTextureParameterNameArray() const;
	TArray<class FName> GetMaterialVectorParameterNameArray() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIExposedParametersAssetUserData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIExposedParametersAssetUserData")
	}
	static class UUIExposedParametersAssetUserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIExposedParametersAssetUserData>();
	}
};
DUMPER7_ASSERTS_UUIExposedParametersAssetUserData;

// Class SCCharacterCustomization.SCCharacterPartDataAsset
// 0x0180 (0x0200 - 0x0080)
class USCCharacterPartDataAsset final : public USCBaseCustomizationDataAsset
{
public:
	TSoftObjectPtr<class UTexture2D>              m_Thumbnail;                                       // 0x0080(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_bCustomCharacterPartType;                        // 0x00A8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharacterPartEnumHandler              m_eCharacterPartType;                              // 0x00B0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSCCharacterPartMeshData               m_MeshesData;                                      // 0x0100(0x0038)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSCCharacterPartPhysicAssetData        m_PhysicAssetsData;                                // 0x0138(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FCustomizationCullMaskContainer        m_CullMaskContainer;                               // 0x0170(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FSCParameterOverrideCondition>  m_OverridingParametersConditions;                  // 0x0180(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FSCMeshDataOverrideCondition>   m_OverridingMeshDataConditions;                    // 0x0190(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FSCExtraAssetOverrideCondition> m_OverridingExtraAssetConditions;                  // 0x01A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FSCExtraInfoOverrideCondition>  m_OverridingExtraInfoConditions;                   // 0x01B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          m_bUseRestrictionsAsInclusions;                    // 0x01C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_bIgnoreExtraInfos;                               // 0x01C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_bIgnoreExtraAssets;                              // 0x01C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C3[0x5];                                      // 0x01C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSCCustomizationId>             m_CustomizationRestrictions;                       // 0x01C8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          m_bUseFilteredExposedParameterNamesAsExclusionArray; // 0x01D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           m_FilteredExposedParameterNames;                   // 0x01E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSCCustomizationId>             m_Specifications;                                  // 0x01F0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	bool BPF_FindSpecification(const struct FSCCustomizationId& _customizationID) const;
	bool BPF_FindSpecificationWithParameter(const class FName& _parameterName) const;
	TSoftObjectPtr<class USkeletalMesh> BPF_GetDefaultMesh(const struct FGenderEnumHandler& _eGender, const struct FBodyBuildEnumHandler& _eBodyBuild) const;
	TArray<class FName> GetMaterialParameterNameArray() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SCCharacterPartDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SCCharacterPartDataAsset")
	}
	static class USCCharacterPartDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USCCharacterPartDataAsset>();
	}
};
DUMPER7_ASSERTS_USCCharacterPartDataAsset;

// Class SCCharacterCustomization.SCColorListDataAsset
// 0x0010 (0x0090 - 0x0080)
class USCColorListDataAsset final : public USCBaseCustomizationDataAsset
{
public:
	TArray<struct FCustoColor>                    m_ColorArray;                                      // 0x0080(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	const TArray<struct FCustoColor> BPF_GetColors() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SCColorListDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SCColorListDataAsset")
	}
	static class USCColorListDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USCColorListDataAsset>();
	}
};
DUMPER7_ASSERTS_USCColorListDataAsset;

// Class SCCharacterCustomization.SCCustomizationCondition
// 0x0008 (0x0030 - 0x0028)
class USCCustomizationCondition : public UObject
{
public:
	bool                                          m_bOnlyIfLastCustomizedId;                         // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SCCustomizationCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SCCustomizationCondition")
	}
	static class USCCustomizationCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USCCustomizationCondition>();
	}
};
DUMPER7_ASSERTS_USCCustomizationCondition;

// Class SCCharacterCustomization.SCCustomizationBodyTypeCondition
// 0x00C0 (0x00F0 - 0x0030)
class USCCustomizationBodyTypeCondition final : public USCCustomizationCondition
{
public:
	struct FBodyBuildEnumHandler                  m_eBodyBuild;                                      // 0x0030(0x0060)(Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGenderEnumHandler                     m_eGender;                                         // 0x0090(0x0060)(Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SCCustomizationBodyTypeCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SCCustomizationBodyTypeCondition")
	}
	static class USCCustomizationBodyTypeCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USCCustomizationBodyTypeCondition>();
	}
};
DUMPER7_ASSERTS_USCCustomizationBodyTypeCondition;

// Class SCCharacterCustomization.SCCharacterPartCondition
// 0x0050 (0x0080 - 0x0030)
class USCCharacterPartCondition : public USCCustomizationCondition
{
public:
	struct FCharacterPartEnumHandler              m_ePartToEvaluate;                                 // 0x0030(0x0050)(Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SCCharacterPartCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SCCharacterPartCondition")
	}
	static class USCCharacterPartCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USCCharacterPartCondition>();
	}
};
DUMPER7_ASSERTS_USCCharacterPartCondition;

// Class SCCharacterCustomization.SCCustomizationPartDataAssetCondition
// 0x0030 (0x00B0 - 0x0080)
class USCCustomizationPartDataAssetCondition final : public USCCharacterPartCondition
{
public:
	TSoftObjectPtr<class USCCharacterPartDataAsset> m_DataAsset;                                     // 0x0080(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bCheckPartHasDataAsset;                          // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SCCustomizationPartDataAssetCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SCCustomizationPartDataAssetCondition")
	}
	static class USCCustomizationPartDataAssetCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USCCustomizationPartDataAssetCondition>();
	}
};
DUMPER7_ASSERTS_USCCustomizationPartDataAssetCondition;

// Class SCCharacterCustomization.SCCustomizationParameterCondition
// 0x0058 (0x00D8 - 0x0080)
class USCCustomizationParameterCondition final : public USCCharacterPartCondition
{
public:
	struct FSCTrackedParameterDescription         m_Parameter;                                       // 0x0080(0x0050)(Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bOnlyIfParameterNotFound;                        // 0x00D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bMustMatch;                                      // 0x00D1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SCCustomizationParameterCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SCCustomizationParameterCondition")
	}
	static class USCCustomizationParameterCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USCCustomizationParameterCondition>();
	}
};
DUMPER7_ASSERTS_USCCustomizationParameterCondition;

// Class SCCharacterCustomization.SCCustomizationExtraInfoCondition
// 0x0078 (0x00A8 - 0x0030)
class USCCustomizationExtraInfoCondition final : public USCCustomizationCondition
{
public:
	struct FExtraInfoEnumHandler                  m_eExtraInfoToEvaluate;                            // 0x0030(0x0060)(Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FInstancedStruct                       m_ExtraInfoStruct;                                 // 0x0090(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	bool                                          m_bOnlyCheckStructType;                            // 0x00A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bMustMatch;                                      // 0x00A1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SCCustomizationExtraInfoCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SCCustomizationExtraInfoCondition")
	}
	static class USCCustomizationExtraInfoCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USCCustomizationExtraInfoCondition>();
	}
};
DUMPER7_ASSERTS_USCCustomizationExtraInfoCondition;

// Class SCCharacterCustomization.SCCustomizationExtraAssetCondition
// 0x0078 (0x00A8 - 0x0030)
class USCCustomizationExtraAssetCondition final : public USCCustomizationCondition
{
public:
	struct FExtraAssetEnumHandler                 m_eExtraAssetToEvaluate;                           // 0x0030(0x0060)(Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FPrimaryAssetId                        m_AssetId;                                         // 0x0090(0x0010)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bMustMatch;                                      // 0x00A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SCCustomizationExtraAssetCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SCCustomizationExtraAssetCondition")
	}
	static class USCCustomizationExtraAssetCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USCCustomizationExtraAssetCondition>();
	}
};
DUMPER7_ASSERTS_USCCustomizationExtraAssetCondition;

// Class SCCharacterCustomization.SCCustomizationCurveAtlasInfoDataAsset
// 0x0078 (0x00A8 - 0x0030)
class USCCustomizationCurveAtlasInfoDataAsset final : public UDataAsset
{
public:
	TMap<class UCurveLinearColorAtlas*, struct FSCCustomizationCurveDataMap> m_CurveDataPerAtlas;    // 0x0030(0x0050)(Edit, EditFixedSize, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class USCCharacterCustomizationUIInfosAsset> m_UIInfosAsset;                      // 0x0080(0x0028)(Edit, EditConst, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	int32 BPF_ConvertMaterialCurveIndexToInfoIndex(int32 _iMaterialCurveIndex, const class UCurveLinearColorAtlas* _atlas) const;
	const struct FSCCustomizationCurveData BPF_GetCurveData(const class UCurveLinearColor* _curve, const class UCurveLinearColorAtlas* _atlas) const;
	const struct FSCCustomizationCurveData BPF_GetCurveDataFromInfoIndex(int32 _iInfoIndex, const class UCurveLinearColorAtlas* _atlas) const;
	TArray<class FName> GetAllMaterialParameters() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SCCustomizationCurveAtlasInfoDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SCCustomizationCurveAtlasInfoDataAsset")
	}
	static class USCCustomizationCurveAtlasInfoDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USCCustomizationCurveAtlasInfoDataAsset>();
	}
};
DUMPER7_ASSERTS_USCCustomizationCurveAtlasInfoDataAsset;

// Class SCCharacterCustomization.SCCustomizationGroupCondition
// 0x0018 (0x0048 - 0x0030)
class USCCustomizationGroupCondition final : public USCCustomizationCondition
{
public:
	EConditionGroupOperators                      m_eOperator;                                       // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSCCustomizationConditionInstance> m_Conditions;                                   // 0x0038(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SCCustomizationGroupCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SCCustomizationGroupCondition")
	}
	static class USCCustomizationGroupCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USCCustomizationGroupCondition>();
	}
};
DUMPER7_ASSERTS_USCCustomizationGroupCondition;

// Class SCCharacterCustomization.SequenceTransformOriginComputer
// 0x0000 (0x0028 - 0x0028)
class USequenceTransformOriginComputer : public UObject
{
public:
	struct FTransform BPE_ComputeSequenceTransformOrigin(class UWorld* _world, const struct FTransform& _defaultTransform) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SequenceTransformOriginComputer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SequenceTransformOriginComputer")
	}
	static class USequenceTransformOriginComputer* GetDefaultObj()
	{
		return GetDefaultObjImpl<USequenceTransformOriginComputer>();
	}
};
DUMPER7_ASSERTS_USequenceTransformOriginComputer;

// Class SCCharacterCustomization.SCCustomizationLevelSequenceDataAsset
// 0x00D0 (0x0150 - 0x0080)
class USCCustomizationLevelSequenceDataAsset : public USCBaseCustomizationDataAsset
{
public:
	class ULevelSequence*                         m_Sequence;                                        // 0x0080(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESequenceThumbnailMode                        m_ThumbnailMode;                                   // 0x0088(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimSequence>           m_AnimSequence;                                    // 0x0090(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_fAnimTime;                                       // 0x00B8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              m_DefaultTexture;                                  // 0x00C0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class ULevelSequence>          m_ViewSequence;                                    // 0x00E8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture>                m_ThumbnailVideo;                                  // 0x0110(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_fVideoTime;                                      // 0x0138(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSequenceTransformOriginComputerDatasourceInstance m_TransformOriginComputerDatasourceInstance; // 0x0140(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	struct FTransform BPF_ComputeSequenceTransformOrigin(class UWorld* _world, const class AActor* _target) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SCCustomizationLevelSequenceDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SCCustomizationLevelSequenceDataAsset")
	}
	static class USCCustomizationLevelSequenceDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USCCustomizationLevelSequenceDataAsset>();
	}
};
DUMPER7_ASSERTS_USCCustomizationLevelSequenceDataAsset;

// Class SCCharacterCustomization.SCCustomizationPartTagCondition
// 0x0048 (0x00C8 - 0x0080)
class USCCustomizationPartTagCondition final : public USCCharacterPartCondition
{
public:
	struct FGameplayTagQuery                      m_TagQuery;                                        // 0x0080(0x0048)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SCCustomizationPartTagCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SCCustomizationPartTagCondition")
	}
	static class USCCustomizationPartTagCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USCCustomizationPartTagCondition>();
	}
};
DUMPER7_ASSERTS_USCCustomizationPartTagCondition;

// Class SCCharacterCustomization.SCCustomizationSetDataAsset
// 0x00F0 (0x0170 - 0x0080)
class USCCustomizationSetDataAsset : public USCBaseCustomizationDataAsset
{
public:
	TMap<struct FCharacterPartEnumHandler, TSoftObjectPtr<class USCCharacterPartDataAsset>> m_PartDataAssets; // 0x0080(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<struct FExtraAssetEnumHandler, struct FPrimaryAssetId> m_ExtraAssets;                       // 0x00D0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<struct FExtraInfoEnumHandler, struct FInstancedStruct> m_ExtraInfos;                        // 0x0120(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	void BPF_ApplyToCustomization(const class UObject* _worldContext, struct FSCCharacterCustomizationDescription& _inOutDescription) const;
	void BPF_GetAssets(TArray<TSoftObjectPtr<class UObject>>* _outAssets) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SCCustomizationSetDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SCCustomizationSetDataAsset")
	}
	static class USCCustomizationSetDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USCCustomizationSetDataAsset>();
	}
};
DUMPER7_ASSERTS_USCCustomizationSetDataAsset;

// Class SCCharacterCustomization.CustomizationUICategory
// 0x0120 (0x0148 - 0x0028)
class UCustomizationUICategory : public UObject
{
public:
	struct FGameplayTag                           m_UITag;                                           // 0x0028(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   m_DisplayName;                                     // 0x0030(0x0010)(Edit, NativeAccessSpecifierPublic)
	ECustomizationUICategoryType                  m_eType;                                           // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  m_FiltersTag;                                      // 0x0048(0x0020)(Edit, NativeAccessSpecifierPublic)
	bool                                          m_bUseFiltersAsExclusion;                          // 0x0068(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_bKeepParentCharacterPart;                        // 0x0069(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCharacterPartEnumHandler>      m_eCharacterParts;                                 // 0x0070(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class FName                                   m_ParameterName;                                   // 0x0080(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FExtraAssetEnumHandler                 m_eExtraAsset;                                     // 0x0088(0x0060)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FExtraInfoEnumHandler                  m_eExtraInfo;                                      // 0x00E8(0x0060)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CustomizationUICategory")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CustomizationUICategory")
	}
	static class UCustomizationUICategory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizationUICategory>();
	}
};
DUMPER7_ASSERTS_UCustomizationUICategory;

// Class SCCharacterCustomization.CustomizationUICategoryList
// 0x0010 (0x0158 - 0x0148)
