#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SCCombatSystem

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "SCCore_structs.hpp"
#include "SCCombatSystem_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SCCombatSystem.AbilityTask_HandleHitboxBase.BPF_SetClientPayload
// 0x0028 (0x0028 - 0x0000)
struct AbilityTask_HandleHitboxBase_BPF_SetClientPayload final
{
public:
	struct FGameplayAbilityTargetDataHandle       _payload;                                          // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_HandleHitboxBase_BPF_SetClientPayload;

// Function SCCombatSystem.AbilityTask_HandleAttack.BPF_HandleAttack
// 0x0018 (0x0018 - 0x0000)
struct AbilityTask_HandleAttack_BPF_HandleAttack final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameplayEffect>            _onMissGameplayEffect;                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_HandleAttack*              ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_HandleAttack_BPF_HandleAttack;

// Function SCCombatSystem.AbilityTask_HandleBallStealTracking.BP_HandleBallStealTracking
// 0x0170 (0x0170 - 0x0000)
struct AbilityTask_HandleBallStealTracking_BP_HandleBallStealTracking final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   _taskInstanceName;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAnimSequencePlayInfos                 _playInfos;                                        // 0x0010(0x0130)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class USCInputAction*                         _action;                                           // 0x0140(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UBallStealTrackingRootMotionModifier> _rootMotionModifier;                     // 0x0148(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fInputDelay;                                      // 0x0150(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fUpdateInputFrequency;                            // 0x0154(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBallStealTracking_DirectionSource            _eDir;                                             // 0x0158(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_HandleBallStealTracking*   ReturnValue;                                       // 0x0160(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_168[0x8];                                      // 0x0168(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbilityTask_HandleBallStealTracking_BP_HandleBallStealTracking;

// Function SCCombatSystem.AbilityTask_HandleHitbox.BPF_HandleHitbox
// 0x0020 (0x0020 - 0x0000)
struct AbilityTask_HandleHitbox_BPF_HandleHitbox final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHitDetectionDB*                        _hitDetection;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UHitboxData>                _hitboxData;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_HandleHitbox*              ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_HandleHitbox_BPF_HandleHitbox;

// Function SCCombatSystem.AbilityTask_HandleHitboxComponent.BPF_HandleHitboxComponent
// 0x0098 (0x0098 - 0x0000)
struct AbilityTask_HandleHitboxComponent_BPF_HandleHitboxComponent final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           _hitboxID;                                         // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UHitSortingMethod>          _hitSortingMethod;                                 // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTargetDatasourceInstance              _predTargetDatasource;                             // 0x0018(0x0048)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                         _fPredictionDuration;                              // 0x0060(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       _context;                                          // 0x0068(0x0028)(Parm, NativeAccessSpecifierPublic)
	class UAbilityTask_HandleHitboxComponent*     ReturnValue;                                       // 0x0090(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_HandleHitboxComponent_BPF_HandleHitboxComponent;

// Function SCCombatSystem.AbilityTask_HandleHitboxComponent.HandleHitboxComponent
// 0x0098 (0x0098 - 0x0000)
struct AbilityTask_HandleHitboxComponent_HandleHitboxComponent final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           _hitboxID;                                         // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UHitSortingMethod>          _hitSortingMethod;                                 // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTargetDatasourceInstance              _predTargetDatasource;                             // 0x0018(0x0048)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                         _fPredictionDuration;                              // 0x0060(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       _context;                                          // 0x0068(0x0028)(Parm, NativeAccessSpecifierPublic)
	class UAbilityTask_HandleHitboxComponent*     ReturnValue;                                       // 0x0090(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_HandleHitboxComponent_HandleHitboxComponent;

// Function SCCombatSystem.AbilityTask_PredictHit.BPF_PredictHit
// 0x0020 (0x0020 - 0x0000)
struct AbilityTask_PredictHit_BPF_PredictHit final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_HandleHitboxBase*          _hitTask;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fPredictionDuration;                              // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bEndTaskOnPrediction;                             // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bCancelPredictionOnEndTask;                       // 0x0015(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PredictHit*                ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_PredictHit_BPF_PredictHit;

// Function SCCombatSystem.AttackAnimationMetadata.BPF_MakeAttackIDFromMontageInstanceID
// 0x0020 (0x0020 - 0x0000)
struct AttackAnimationMetadata_BPF_MakeAttackIDFromMontageInstanceID final
{
public:
	int32                                         _iMontageInstanceID;                               // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAttackID                              ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AttackAnimationMetadata_BPF_MakeAttackIDFromMontageInstanceID;

// Function SCCombatSystem.AttackHitNotifyState.GetCustomDataTableStruct
// 0x0008 (0x0008 - 0x0000)
struct AttackHitNotifyState_GetCustomDataTableStruct final
{
public:
	class UScriptStruct*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AttackHitNotifyState_GetCustomDataTableStruct;

// Function SCCombatSystem.HitComponent.BPF_GetHitBoxTagFromHitRequest
// 0x0088 (0x0088 - 0x0000)
struct HitComponent_BPF_GetHitBoxTagFromHitRequest final
{
public:
	class USCGameplayAbility*                     _ability;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitRequest                            _hitRequest;                                       // 0x0008(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ReturnValue;                                       // 0x0080(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HitComponent_BPF_GetHitBoxTagFromHitRequest;

// Function SCCombatSystem.HitComponent.BPF_GetHitBoxTagFromPendingHit
// 0x0370 (0x0370 - 0x0000)
struct HitComponent_BPF_GetHitBoxTagFromPendingHit final
{
public:
	class USCGameplayAbility*                     _ability;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPendingHit                            _pendingHit;                                       // 0x0010(0x0350)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ReturnValue;                                       // 0x0360(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_HitComponent_BPF_GetHitBoxTagFromPendingHit;

// Function SCCombatSystem.HitComponent.BPF_IsEnvironmentHit
// 0x01A8 (0x01A8 - 0x0000)
struct HitComponent_BPF_IsEnvironmentHit final
{
public:
	struct FHitDescription                        _hitDescription;                                   // 0x0000(0x01A0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x01A0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_HitComponent_BPF_IsEnvironmentHit;

// Function SCCombatSystem.HitComponent.BPF_MakeGameplayCueParametersFromPendingHit
// 0x0440 (0x0440 - 0x0000)
struct HitComponent_BPF_MakeGameplayCueParametersFromPendingHit final
{
public:
	class USCGameplayAbility*                     _ability;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPendingHit                            _hitDescription;                                   // 0x0010(0x0350)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FGameplayCueParameters                 ReturnValue;                                       // 0x0360(0x00D8)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_438[0x8];                                      // 0x0438(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_HitComponent_BPF_MakeGameplayCueParametersFromPendingHit;

// Function SCCombatSystem.HitComponent.BPF_SetInstigator
// 0x0008 (0x0008 - 0x0000)
struct HitComponent_BPF_SetInstigator final
{
public:
	class AActor*                                 _instigator;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HitComponent_BPF_SetInstigator;

// Function SCCombatSystem.HitComponent.ClientRejectPendingClientHit
// 0x0010 (0x0010 - 0x0000)
struct HitComponent_ClientRejectPendingClientHit final
{
public:
	struct FPredictionKey                         _hitPredictionKey;                                 // 0x0000(0x0010)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HitComponent_ClientRejectPendingClientHit;

// Function SCCombatSystem.HitComponent.ServerAddPendingClientHits
// 0x0010 (0x0010 - 0x0000)
struct HitComponent_ServerAddPendingClientHits final
{
public:
	TArray<struct FPendingHit>                    _hit;                                              // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HitComponent_ServerAddPendingClientHits;

// Function SCCombatSystem.HitComponent.ServerNotifyPredictedHit
// 0x0350 (0x0350 - 0x0000)
struct HitComponent_ServerNotifyPredictedHit final
{
public:
	struct FPendingHit                            _hit;                                              // 0x0000(0x0350)(ConstParm, Parm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HitComponent_ServerNotifyPredictedHit;

// Function SCCombatSystem.HitComponent.ServerOnHitSolved
// 0x0360 (0x0360 - 0x0000)
struct HitComponent_ServerOnHitSolved final
{
public:
	struct FPendingHit                            _hit;                                              // 0x0000(0x0350)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          _bResult;                                          // 0x0350(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_351[0xF];                                      // 0x0351(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_HitComponent_ServerOnHitSolved;

// Function SCCombatSystem.HitComponent.ServerUpdatePredictedHit
// 0x0028 (0x0028 - 0x0000)
struct HitComponent_ServerUpdatePredictedHit final
{
public:
	class UHurtboxComponent*                      _target;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitOwnerID                            _ID;                                               // 0x0008(0x0018)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fTime;                                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_HitComponent_ServerUpdatePredictedHit;

// Function SCCombatSystem.HitComponent.BPF_GetInstigator
// 0x0008 (0x0008 - 0x0000)
struct HitComponent_BPF_GetInstigator final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HitComponent_BPF_GetInstigator;

// Function SCCombatSystem.HitComponent.ServerNotifyCanceledHit
// 0x0020 (0x0020 - 0x0000)
struct HitComponent_ServerNotifyCanceledHit final
{
public:
	class UHurtboxComponent*                      _target;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitOwnerID                            _ID;                                               // 0x0008(0x0018)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HitComponent_ServerNotifyCanceledHit;

// Function SCCombatSystem.AttackComponent.BPF_GetAttackIDFromNotify
// 0x0048 (0x0048 - 0x0000)
struct AttackComponent_BPF_GetAttackIDFromNotify final
{
public:
	struct FAnimNotifyEventReference              _eventReference;                                   // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAttackID                              ReturnValue;                                       // 0x0030(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AttackComponent_BPF_GetAttackIDFromNotify;

// Function SCCombatSystem.AttackComponent.BPF_GetLatestAttackID
// 0x0018 (0x0018 - 0x0000)
struct AttackComponent_BPF_GetLatestAttackID final
{
public:
	struct FAttackID                              ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AttackComponent_BPF_GetLatestAttackID;

// Function SCCombatSystem.DefaultHitAbility.BuildPayload
// 0x0380 (0x0380 - 0x0000)
struct DefaultHitAbility_BuildPayload final
{
public:
	struct FPendingHit                            _hit;                                              // 0x0000(0x0350)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FGameplayAbilityTargetDataHandle       _context;                                          // 0x0350(0x0028)(Parm, NativeAccessSpecifierPublic)
	class UAbilityTask_HandleHitboxBase*          _payloadTarget;                                    // 0x0378(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DefaultHitAbility_BuildPayload;

// Function SCCombatSystem.HitboxActor.BPF_BuildHitPayload
// 0x0380 (0x0380 - 0x0000)
struct HitboxActor_BPF_BuildHitPayload final
{
public:
	struct FPendingHit                            _hit;                                              // 0x0000(0x0350)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FGameplayAbilityTargetDataHandle       _context;                                          // 0x0350(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UAbilityTask_HandleHitboxBase*          _payloadTarget;                                    // 0x0378(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HitboxActor_BPF_BuildHitPayload;

// Function SCCombatSystem.HitboxComponent.BPF_SetHitBoxTableRow
// 0x0008 (0x0008 - 0x0000)
struct HitboxComponent_BPF_SetHitBoxTableRow final
{
public:
	class FName                                   _hitBoxTableRowName;                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HitboxComponent_BPF_SetHitBoxTableRow;

// Function SCCombatSystem.HitboxComponent.BPF_GetCurrentHitBoxRow
// 0x0010 (0x0010 - 0x0000)
struct HitboxComponent_BPF_GetCurrentHitBoxRow final
{
public:
	struct FDataTableRowHandle                    ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HitboxComponent_BPF_GetCurrentHitBoxRow;

// Function SCCombatSystem.HitboxComponent.BPF_GetHitDetectionExtent
// 0x0018 (0x0018 - 0x0000)
struct HitboxComponent_BPF_GetHitDetectionExtent final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HitboxComponent_BPF_GetHitDetectionExtent;

// Function SCCombatSystem.HitboxComponent.GetCustomDataTableStruct
// 0x0008 (0x0008 - 0x0000)
struct HitboxComponent_GetCustomDataTableStruct final
{
public:
	class UScriptStruct*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HitboxComponent_GetCustomDataTableStruct;

// Function SCCombatSystem.HitboxData.GetCustomDataTableStruct
// 0x0008 (0x0008 - 0x0000)
struct HitboxData_GetCustomDataTableStruct final
{
public:
	class UScriptStruct*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HitboxData_GetCustomDataTableStruct;

// Function SCCombatSystem.HitReaction.BPF_BuildClientPayload
// 0x0390 (0x0390 - 0x0000)
struct HitReaction_BPF_BuildClientPayload final
{
public:
	const class USCGameplayAbility*               _ability;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPendingHit                            _hit;                                              // 0x0010(0x0350)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FGameplayAbilityTargetDataHandle       _outResultTargetData;                              // 0x0360(0x0028)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	uint8                                         Pad_388[0x8];                                      // 0x0388(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_HitReaction_BPF_BuildClientPayload;

// Function SCCombatSystem.HitReaction.BPF_OnHit
// 0x0360 (0x0360 - 0x0000)
struct HitReaction_BPF_OnHit final
{
public:
	const class USCGameplayAbility*               _ability;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPendingHit                            _hit;                                              // 0x0010(0x0350)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HitReaction_BPF_OnHit;

// Function SCCombatSystem.HitReaction.BPF_OnHurt
// 0x0380 (0x0380 - 0x0000)
struct HitReaction_BPF_OnHurt final
{
public:
	class UHurtboxSolverComponent*                _hurtComponent;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPendingHit                            _hit;                                              // 0x0010(0x0350)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  _outcomeTags;                                      // 0x0360(0x0020)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HitReaction_BPF_OnHurt;

// Function SCCombatSystem.HitReaction.BPF_OnReaction
// 0x0360 (0x0360 - 0x0000)
struct HitReaction_BPF_OnReaction final
{
public:
	EHitReactionType                              _eReaction;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPendingHit                            _hit;                                              // 0x0010(0x0350)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HitReaction_BPF_OnReaction;

// Function SCCombatSystem.HitReactionHelpers.BPF_GetInstance
// 0x0018 (0x0018 - 0x0000)
struct HitReactionHelpers_BPF_GetInstance final
{
public:
	struct FHitReactionInstance                   _instance;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HitReactionHelpers_BPF_GetInstance;

// Function SCCombatSystem.HitReactionHelpers.GetEditorDesc
// 0x0020 (0x0020 - 0x0000)
struct HitReactionHelpers_GetEditorDesc final
{
public:
	struct FHitReactionInstance                   _reaction;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HitReactionHelpers_GetEditorDesc;

// Function SCCombatSystem.HitDescTargetDataHandleHelpers.Conv_BaseHitDescTargetDataHandle
// 0x0740 (0x0740 - 0x0000)
struct HitDescTargetDataHandleHelpers_Conv_BaseHitDescTargetDataHandle final
{
public:
	struct FHitTargetDataHandle                   _hHit;                                             // 0x0000(0x03A0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FBaseHitDescTargetDataHandle           ReturnValue;                                       // 0x03A0(0x03A0)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HitDescTargetDataHandleHelpers_Conv_BaseHitDescTargetDataHandle;

// Function SCCombatSystem.HitDescTargetDataHandleHelpers.Conv_HitTargetDataHandle
// 0x06F0 (0x06F0 - 0x0000)
struct HitDescTargetDataHandleHelpers_Conv_HitTargetDataHandle final
{
public:
	struct FPendingHit                            _hit;                                              // 0x0000(0x0350)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FHitTargetDataHandle                   ReturnValue;                                       // 0x0350(0x03A0)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HitDescTargetDataHandleHelpers_Conv_HitTargetDataHandle;

// Function SCCombatSystem.HurtboxSolverComponent.BPF_MakeHitTargetDataHandle
// 0x0540 (0x0540 - 0x0000)
struct HurtboxSolverComponent_BPF_MakeHitTargetDataHandle final
{
public:
	struct FHitDescription                        _hHit;                                             // 0x0000(0x01A0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FHitTargetDataHandle                   ReturnValue;                                       // 0x01A0(0x03A0)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HurtboxSolverComponent_BPF_MakeHitTargetDataHandle;

// Function SCCombatSystem.HurtboxSolverComponent.BPF_MakeHurtTargetDataHandle
// 0x0540 (0x0540 - 0x0000)
struct HurtboxSolverComponent_BPF_MakeHurtTargetDataHandle final
{
public:
	struct FHitDescription                        _hHit;                                             // 0x0000(0x01A0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FHurtTargetDataHandle                  ReturnValue;                                       // 0x01A0(0x03A0)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HurtboxSolverComponent_BPF_MakeHurtTargetDataHandle;

// Function SCCombatSystem.HurtboxSolverComponent.OnRep_NextValidPredictedHit
// 0x0020 (0x0020 - 0x0000)
struct HurtboxSolverComponent_OnRep_NextValidPredictedHit final
{
public:
	struct FHitPredictionResult                   PreviousSimulatedTasks;                            // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HurtboxSolverComponent_OnRep_NextValidPredictedHit;

// Function SCCombatSystem.HurtboxSolverComponent.OnWorldRemoved
// 0x0008 (0x0008 - 0x0000)
struct HurtboxSolverComponent_OnWorldRemoved final
{
public:
	class UWorld*                                 _destroyedWorld;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HurtboxSolverComponent_OnWorldRemoved;

// Function SCCombatSystem.HurtboxSolverComponent.BPF_GetPendingHitCount
// 0x0004 (0x0004 - 0x0000)
struct HurtboxSolverComponent_BPF_GetPendingHitCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HurtboxSolverComponent_BPF_GetPendingHitCount;

// Function SCCombatSystem.OnActorCollidedBinder.OnActorCollided
// 0x0120 (0x0120 - 0x0000)
struct OnActorCollidedBinder_OnActorCollided final
{
public:
	class AActor*                                 SelfActor;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NormalImpulse;                                     // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             Hit;                                               // 0x0028(0x00F8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OnActorCollidedBinder_OnActorCollided;

// Function SCCombatSystem.OnActorHitBinder.OnActorHit
// 0x0350 (0x0350 - 0x0000)
struct OnActorHitBinder_OnActorHit final
{
public:
	struct FPendingHit                            _hit;                                              // 0x0000(0x0350)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OnActorHitBinder_OnActorHit;

// Function SCCombatSystem.OnActorHurtBinder.OnActorHurt
// 0x0350 (0x0350 - 0x0000)
struct OnActorHurtBinder_OnActorHurt final
{
public:
	struct FPendingHit                            _hit;                                              // 0x0000(0x0350)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OnActorHurtBinder_OnActorHurt;

// Function SCCombatSystem.SCProjectile.BPF_ComputeStartTransformForTargetActor
// 0x0120 (0x0120 - 0x0000)
struct SCProjectile_BPF_ComputeStartTransformForTargetActor final
{
public:
	const class UObject*                          _worldContextObject;                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             _spawnLocation;                                    // 0x0010(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AActor*                           _targetActor;                                      // 0x0070(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fOutWantedSpeed;                                  // 0x0078(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               _maxRotation;                                      // 0x0080(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                _vDeltaOnTarget;                                   // 0x0098(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fNoTargetDistance;                                // 0x00B0(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bCurvedTrajectory;                                // 0x00B4(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B5[0xB];                                       // 0x00B5(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ReturnValue;                                       // 0x00C0(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SCProjectile_BPF_ComputeStartTransformForTargetActor;

// Function SCCombatSystem.SCProjectile.BPF_ComputeStartTransformForTargetLocation
// 0x0140 (0x0140 - 0x0000)
struct SCProjectile_BPF_ComputeStartTransformForTargetLocation final
{
public:
	const class UObject*                          _worldContextObject;                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             _spawnLocation;                                    // 0x0010(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                _vTargetLocation;                                  // 0x0070(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                _vTargetVelocity;                                  // 0x0088(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fOutWantedSpeed;                                  // 0x00A0(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               _maxRotation;                                      // 0x00A8(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                _vDeltaOnTarget;                                   // 0x00C0(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bCurvedTrajectory;                                // 0x00D8(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ReturnValue;                                       // 0x00E0(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SCProjectile_BPF_ComputeStartTransformForTargetLocation;

}

