#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SCCombatSystem

#include "Basic.hpp"

#include "SCCombatSystem_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "SCCore_structs.hpp"
#include "SCCore_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "StructUtils_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "MotionWarping_classes.hpp"
#include "PhysicsCore_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class SCCombatSystem.AbilityTask_HandleHitboxBase
// 0x0408 (0x04A0 - 0x0098)
#pragma pack(push, 0x1)
class alignas(0x10) UAbilityTask_HandleHitboxBase : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget)> m_OnHit; // 0x0098(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget)> m_OnHitValidated; // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget)> m_OnHitRecovery; // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget)> m_OnHitRejected; // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget)> m_BuildClientHitboxPayload; // 0x00D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FTargetDatasourceInstance              m_PredTargetDatasource;                            // 0x00E8(0x0048)(ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_130[0x140];                                    // 0x0130(0x0140)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_fPredictionDuration;                             // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_274[0x154];                                    // 0x0274(0x0154)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class UHurtboxSolverComponent*>          m_PredRegisteredHurtboxSolvers;                    // 0x03C8(0x0050)(ExportObject, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_418[0x6C];                                     // 0x0418(0x006C)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& _context, bool* _bReturnResult)> m_HitConditionalFunction; // 0x0484(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_494[0x4];                                      // 0x0494(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BPF_ScheduleDestroyActor();
	void BPF_SetClientPayload(const struct FGameplayAbilityTargetDataHandle& _payload);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_HandleHitboxBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_HandleHitboxBase")
	}
	static class UAbilityTask_HandleHitboxBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_HandleHitboxBase>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UAbilityTask_HandleHitboxBase;

// Class SCCombatSystem.AbilityTask_HandleAttack
// 0x0020 (0x04C0 - 0x04A0)
class UAbilityTask_HandleAttack final : public UAbilityTask_HandleHitboxBase
{
public:
	TSubclassOf<class UGameplayEffect>            m_OnMissGameplayEffect;                            // 0x0498(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget)> m_OnMiss; // 0x04A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B0[0x10];                                     // 0x04B0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_HandleAttack* BPF_HandleAttack(class UGameplayAbility* _owningAbility, TSubclassOf<class UGameplayEffect> _onMissGameplayEffect);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_HandleAttack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_HandleAttack")
	}
	static class UAbilityTask_HandleAttack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_HandleAttack>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_HandleAttack;

// Class SCCombatSystem.AbilityTask_HandleBallStealTracking
// 0x01D8 (0x0270 - 0x0098)
class UAbilityTask_HandleBallStealTracking final : public UAbilityTask
{
public:
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USCInputAction*                         m_action;                                          // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnTimedOutAndDestinationReached;                   // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int16                                         m_iActivationPredictionKey;                        // 0x00B8(0x0002)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSequencePlayInfos                 m_PlayInfos;                                       // 0x00C0(0x0130)(Net, NativeAccessSpecifierPublic)
	struct FVector                                m_vStartLocation;                                  // 0x01F0(0x0018)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UBallStealTrackingRootMotionModifier> m_Modifier;                              // 0x0208(0x0008)(Net, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESCCharacterSpeedState                        m_eStartSpeedState;                                // 0x0210(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBallStealTrackingRootMotionModifier*   m_ResultModifier;                                  // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_220[0x20];                                     // 0x0220(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  m_qStartRotation;                                  // 0x0240(0x0020)(Net, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_260[0x10];                                     // 0x0260(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_HandleBallStealTracking* BP_HandleBallStealTracking(class UGameplayAbility* _owningAbility, class FName _taskInstanceName, const struct FAnimSequencePlayInfos& _playInfos, class USCInputAction* _action, TSubclassOf<class UBallStealTrackingRootMotionModifier> _rootMotionModifier, float _fInputDelay, float _fUpdateInputFrequency, EBallStealTracking_DirectionSource _eDir);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_HandleBallStealTracking")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_HandleBallStealTracking")
	}
	static class UAbilityTask_HandleBallStealTracking* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_HandleBallStealTracking>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_HandleBallStealTracking;

// Class SCCombatSystem.HitSortingMethod
// 0x0000 (0x0028 - 0x0028)
class UHitSortingMethod : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HitSortingMethod")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HitSortingMethod")
	}
	static class UHitSortingMethod* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHitSortingMethod>();
	}
};
DUMPER7_ASSERTS_UHitSortingMethod;

// Class SCCombatSystem.ProjectHitSortingMethod
// 0x0008 (0x0030 - 0x0028)
class UProjectHitSortingMethod final : public UHitSortingMethod
{
public:
	EAxis                                         m_eProjectionAxis;                                 // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ProjectHitSortingMethod")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ProjectHitSortingMethod")
	}
	static class UProjectHitSortingMethod* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProjectHitSortingMethod>();
	}
};
DUMPER7_ASSERTS_UProjectHitSortingMethod;

// Class SCCombatSystem.SpatioTemporalSortingMethod
// 0x0008 (0x0030 - 0x0028)
class USpatioTemporalSortingMethod final : public UHitSortingMethod
{
public:
	EAxis                                         m_eProjectionAxis;                                 // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpatioTemporalSortingMethod")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpatioTemporalSortingMethod")
	}
	static class USpatioTemporalSortingMethod* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatioTemporalSortingMethod>();
	}
};
DUMPER7_ASSERTS_USpatioTemporalSortingMethod;

// Class SCCombatSystem.PriorityWeightHitSortingMethod
// 0x0008 (0x0030 - 0x0028)
class UPriorityWeightHitSortingMethod final : public UHitSortingMethod
{
public:
	EAxis                                         m_eProjectionAxis;                                 // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PriorityWeightHitSortingMethod")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PriorityWeightHitSortingMethod")
	}
	static class UPriorityWeightHitSortingMethod* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPriorityWeightHitSortingMethod>();
	}
};
DUMPER7_ASSERTS_UPriorityWeightHitSortingMethod;

// Class SCCombatSystem.AbilityTask_HandleHitbox
// 0x0000 (0x04A0 - 0x04A0)
class UAbilityTask_HandleHitbox final : public UAbilityTask_HandleHitboxBase
{
public:
	static class UAbilityTask_HandleHitbox* BPF_HandleHitbox(class UGameplayAbility* _owningAbility, class UHitDetectionDB* _hitDetection, TSubclassOf<class UHitboxData> _hitboxData);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_HandleHitbox")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_HandleHitbox")
	}
	static class UAbilityTask_HandleHitbox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_HandleHitbox>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_HandleHitbox;

// Class SCCombatSystem.AbilityTask_HandleHitboxComponent
// 0x0010 (0x04B0 - 0x04A0)
class UAbilityTask_HandleHitboxComponent final : public UAbilityTask_HandleHitboxBase
{
public:
	struct FGameplayTag                           m_HitboxID;                                        // 0x0498(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UHitSortingMethod>          m_HitSortingMethod;                                // 0x04A0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A8[0x8];                                      // 0x04A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_HandleHitboxComponent* BPF_HandleHitboxComponent(class UGameplayAbility* _owningAbility, const struct FGameplayTag& _hitboxID, TSubclassOf<class UHitSortingMethod> _hitSortingMethod, const struct FTargetDatasourceInstance& _predTargetDatasource, float _fPredictionDuration, const struct FGameplayAbilityTargetDataHandle& _context);
	static class UAbilityTask_HandleHitboxComponent* HandleHitboxComponent(class UGameplayAbility* _owningAbility, const struct FGameplayTag& _hitboxID, TSubclassOf<class UHitSortingMethod> _hitSortingMethod, const struct FTargetDatasourceInstance& _predTargetDatasource, float _fPredictionDuration, const struct FGameplayAbilityTargetDataHandle& _context);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_HandleHitboxComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_HandleHitboxComponent")
	}
	static class UAbilityTask_HandleHitboxComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_HandleHitboxComponent>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_HandleHitboxComponent;

// Class SCCombatSystem.AbilityTask_PredictHit
// 0x0038 (0x00D0 - 0x0098)
class UAbilityTask_PredictHit final : public UAbilityTask
{
public:
	uint8                                         Pad_98[0x10];                                      // 0x0098(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FPendingHit& _hit, const float _fTimeSincePredictionStart)> m_OnPredicted; // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(const struct FPendingHit& _hit, const float _fTimeSincePredictionStart)> m_OnPredictionCanceled; // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_PredictHit* BPF_PredictHit(class UGameplayAbility* _owningAbility, class UAbilityTask_HandleHitboxBase* _hitTask, float _fPredictionDuration, bool _bEndTaskOnPrediction, bool _bCancelPredictionOnEndTask);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_PredictHit")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_PredictHit")
	}
	static class UAbilityTask_PredictHit* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_PredictHit>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_PredictHit;

// Class SCCombatSystem.RedirectToAttackTarget
// 0x0000 (0x0028 - 0x0028)
class URedirectToAttackTarget final : public UMontagePlayerRedirection
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedirectToAttackTarget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedirectToAttackTarget")
	}
	static class URedirectToAttackTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedirectToAttackTarget>();
	}
};
DUMPER7_ASSERTS_URedirectToAttackTarget;

// Class SCCombatSystem.RedirectWithOffset
// 0x0010 (0x0038 - 0x0028)
class URedirectWithOffset : public UMontagePlayerRedirection
{
public:
	TArray<struct FRemapAngleStruct>              m_RemapAngles;                                     // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedirectWithOffset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedirectWithOffset")
	}
	static class URedirectWithOffset* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedirectWithOffset>();
	}
};
DUMPER7_ASSERTS_URedirectWithOffset;

// Class SCCombatSystem.RedirectAnimWithTarget
// 0x0010 (0x0038 - 0x0028)
class URedirectAnimWithTarget : public UMontagePlayerRedirection
{
public:
	class FName                                   m_BoneName;                                        // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          m_HorizontalRedirectionOnly;                       // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedirectAnimWithTarget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedirectAnimWithTarget")
	}
	static class URedirectAnimWithTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedirectAnimWithTarget>();
	}
};
DUMPER7_ASSERTS_URedirectAnimWithTarget;

// Class SCCombatSystem.RedirectAnimDisplacementToInput
// 0x0000 (0x0028 - 0x0028)
class URedirectAnimDisplacementToInput final : public UMontagePlayerRedirection
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedirectAnimDisplacementToInput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedirectAnimDisplacementToInput")
	}
	static class URedirectAnimDisplacementToInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedirectAnimDisplacementToInput>();
	}
};
DUMPER7_ASSERTS_URedirectAnimDisplacementToInput;

// Class SCCombatSystem.RedirectToMakeSideFacingTarget
// 0x0000 (0x0028 - 0x0028)
class URedirectToMakeSideFacingTarget final : public UMontagePlayerRedirection
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RedirectToMakeSideFacingTarget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RedirectToMakeSideFacingTarget")
	}
	static class URedirectToMakeSideFacingTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedirectToMakeSideFacingTarget>();
	}
};
DUMPER7_ASSERTS_URedirectToMakeSideFacingTarget;

// Class SCCombatSystem.AttackAnimationMetadata
// 0x01A0 (0x0558 - 0x03B8)
class UAttackAnimationMetadata : public UPlayMontageAnimationMetadata
{
public:
	class UScriptStruct*                          m_HitboxDataTableRowType;                          // 0x03B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    m_AttackDataTable;                                 // 0x03C0(0x0010)(Deprecated, NoDestructor, NativeAccessSpecifierPublic)
	struct FFloatDataBinding                      m_TimeScaleOnMiss;                                 // 0x03D0(0x0048)(Edit, NativeAccessSpecifierPublic)
	bool                                          m_bUseRecoveryFrameCount;                          // 0x0418(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntDataBinding                        m_RecoveryFrameCount;                              // 0x0420(0x0048)(Edit, NativeAccessSpecifierPublic)
	bool                                          m_bUseStartupFrameCount;                           // 0x0468(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntDataBinding                        m_StartupFrameCount;                               // 0x0470(0x0048)(Edit, NativeAccessSpecifierPublic)
	bool                                          m_bUseActiveFrameCount;                            // 0x04B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B9[0x7];                                      // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntDataBinding                        m_ActiveFrameCount;                                // 0x04C0(0x0048)(Edit, NativeAccessSpecifierPublic)
	struct FClassDataBinding                      m_DefaultHitbox;                                   // 0x0508(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTag                           m_OnMissGameplayTag;                               // 0x0540(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCachedFloatCurve                      m_TrackingCurve;                                   // 0x0548(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FCachedFloatCurve                      m_RootMotionScaleCurve;                            // 0x0550(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static struct FAttackID BPF_MakeAttackIDFromMontageInstanceID(const int32 _iMontageInstanceID);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AttackAnimationMetadata")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AttackAnimationMetadata")
	}
	static class UAttackAnimationMetadata* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAttackAnimationMetadata>();
	}
};
DUMPER7_ASSERTS_UAttackAnimationMetadata;

// Class SCCombatSystem.SharedAttackAnimationMetadata
// 0x0000 (0x00A8 - 0x00A8)
class USharedAttackAnimationMetadata final : public USCSharedAnimationMetadata
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SharedAttackAnimationMetadata")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SharedAttackAnimationMetadata")
	}
	static class USharedAttackAnimationMetadata* GetDefaultObj()
	{
		return GetDefaultObjImpl<USharedAttackAnimationMetadata>();
	}
};
DUMPER7_ASSERTS_USharedAttackAnimationMetadata;

// Class SCCombatSystem.AttackStateNotify
// 0x0008 (0x0040 - 0x0038)
class UAttackStateNotify final : public UAnimNotify
{
public:
	EAttackState                                  m_eState;                                          // 0x0038(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AttackStateNotify")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AttackStateNotify")
	}
	static class UAttackStateNotify* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAttackStateNotify>();
	}
};
DUMPER7_ASSERTS_UAttackStateNotify;

// Class SCCombatSystem.AttackStateNotifyState
// 0x0008 (0x0038 - 0x0030)
class UAttackStateNotifyState : public UAnimNotifyState
{
public:
	EAttackState                                  m_eInState;                                        // 0x0030(0x0001)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttackState                                  m_eOutState;                                       // 0x0031(0x0001)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AttackStateNotifyState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AttackStateNotifyState")
	}
	static class UAttackStateNotifyState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAttackStateNotifyState>();
	}
};
DUMPER7_ASSERTS_UAttackStateNotifyState;

// Class SCCombatSystem.AttackHitNotifyState
// 0x0038 (0x0070 - 0x0038)
class UAttackHitNotifyState : public UAttackStateNotifyState
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    m_HitboxTableRow;                                  // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          m_bUseHitGroupID;                                  // 0x0058(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m_HitGroupID;                                      // 0x005C(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAnimNotifyHitboxInfos>         m_Hitboxs;                                         // 0x0060(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	class UScriptStruct* GetCustomDataTableStruct() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AttackHitNotifyState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AttackHitNotifyState")
	}
	static class UAttackHitNotifyState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAttackHitNotifyState>();
	}
};
DUMPER7_ASSERTS_UAttackHitNotifyState;

// Class SCCombatSystem.HitComponent
// 0x00B0 (0x0168 - 0x00B8)
class UHitComponent : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x48];                                      // 0x00B8(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FPendingHit& _hit)> m_OnPredictedHit;                 // 0x0100(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FPendingHit& _hit)> m_OnHit;                          // 0x0110(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FPendingHit& _hit)> m_OnHitRecovery;                  // 0x0120(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<struct FPendingHit>                    m_ServerPendingHitsFromClient;                     // 0x0130(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<struct FPendingHit>                    m_ServerValidatedHits;                             // 0x0140(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<struct FPendingHit>                    m_ServerRejectedHits;                              // 0x0150(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_160[0x8];                                      // 0x0160(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static struct FGameplayTag BPF_GetHitBoxTagFromHitRequest(class USCGameplayAbility* _ability, const struct FHitRequest& _hitRequest);
	static struct FGameplayTag BPF_GetHitBoxTagFromPendingHit(class USCGameplayAbility* _ability, const struct FPendingHit& _pendingHit);
	static bool BPF_IsEnvironmentHit(const struct FHitDescription& _hitDescription);
	static struct FGameplayCueParameters BPF_MakeGameplayCueParametersFromPendingHit(class USCGameplayAbility* _ability, const struct FPendingHit& _hitDescription);

	void BPF_SetInstigator(class AActor* _instigator);
	void ClientRejectPendingClientHit(const struct FPredictionKey& _hitPredictionKey);
	void ServerAddPendingClientHits(const TArray<struct FPendingHit>& _hit);
	void ServerNotifyPredictedHit(const struct FPendingHit& _hit);
	void ServerOnHitSolved(const struct FPendingHit& _hit, bool _bResult);
	void ServerUpdatePredictedHit(class UHurtboxComponent* _target, const struct FHitOwnerID& _ID, float _fTime);

	class AActor* BPF_GetInstigator() const;
	void ServerNotifyCanceledHit(class UHurtboxComponent* _target, const struct FHitOwnerID& _ID) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HitComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HitComponent")
	}
	static class UHitComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHitComponent>();
	}
};
DUMPER7_ASSERTS_UHitComponent;

// Class SCCombatSystem.AttackComponent
// 0x0068 (0x01D0 - 0x0168)
class UAttackComponent final : public UHitComponent
{
public:
	uint8                                         Pad_168[0x68];                                     // 0x0168(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static struct FAttackID BPF_GetAttackIDFromNotify(const struct FAnimNotifyEventReference& _eventReference);

	struct FAttackID BPF_GetLatestAttackID() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AttackComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AttackComponent")
	}
	static class UAttackComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAttackComponent>();
	}
};
DUMPER7_ASSERTS_UAttackComponent;

// Class SCCombatSystem.AttackSnapbackRootMotionModifier
// 0x0010 (0x0130 - 0x0120)
class UAttackSnapbackRootMotionModifier final : public USCRootMotionModifier
{
public:
	uint8                                         Pad_120[0x10];                                     // 0x0120(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AttackSnapbackRootMotionModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AttackSnapbackRootMotionModifier")
	}
	static class UAttackSnapbackRootMotionModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAttackSnapbackRootMotionModifier>();
	}
};
DUMPER7_ASSERTS_UAttackSnapbackRootMotionModifier;

// Class SCCombatSystem.BallStealTrackingRootMotionModifier
// 0x0080 (0x0170 - 0x00F0)
class UBallStealTrackingRootMotionModifier : public URootMotionModifier
{
public:
	float                                         m_fRotationSpeed;                                  // 0x00E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<ESCCharacterSpeedState, float>           m_ScalePerSpeedState;                              // 0x00F0(0x0050)(Edit, NativeAccessSpecifierPublic)
	ESCCharacterSpeedState                        m_eSpeedState;                                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m_iActivationPredictionKey;                        // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_bHasDir;                                         // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                m_vNewDir;                                         // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_fScale;                                          // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BallStealTrackingRootMotionModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BallStealTrackingRootMotionModifier")
	}
	static class UBallStealTrackingRootMotionModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBallStealTrackingRootMotionModifier>();
	}
};
DUMPER7_ASSERTS_UBallStealTrackingRootMotionModifier;

// Class SCCombatSystem.DefaultHitAbility
// 0x0000 (0x0648 - 0x0648)
class UDefaultHitAbility final : public USCGameplayAbility
{
public:
	void BuildPayload(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DefaultHitAbility")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DefaultHitAbility")
	}
	static class UDefaultHitAbility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultHitAbility>();
	}
};
DUMPER7_ASSERTS_UDefaultHitAbility;

// Class SCCombatSystem.HitboxActor
// 0x0050 (0x0328 - 0x02D8)
class AHitboxActor : public ADataTableValueContainerActor
{
public:
	uint8                                         Pad_2D8[0x10];                                     // 0x02D8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          m_bStartWithHitboxActivated;                       // 0x02E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class USCGameplayAbility>         m_DefaultHitAbility;                               // 0x02F0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USCAbilitySystemComponent*              m_AbilitySystemComponent;                          // 0x02F8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHitComponent*                          m_HitComponent;                                    // 0x0300(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        m_SceneComponent;                                  // 0x0308(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHitboxComponent*                       m_HitboxComponent;                                 // 0x0310(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UHitSortingMethod>          m_HitSortingMethod;                                // 0x0318(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_320[0x8];                                      // 0x0320(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BPF_ActivateHitbox();
	void BPF_BuildHitPayload(const struct FPendingHit& _hit, const struct FGameplayAbilityTargetDataHandle& _context, class UAbilityTask_HandleHitboxBase* _payloadTarget);
	void BPF_DeactivateHitbox();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HitboxActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HitboxActor")
	}
	static class AHitboxActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHitboxActor>();
	}
};
DUMPER7_ASSERTS_AHitboxActor;

// Class SCCombatSystem.EnvHitboxActor
// 0x0008 (0x0330 - 0x0328)
class AEnvHitboxActor final : public AHitboxActor
{
public:
	uint8                                         Pad_328[0x8];                                      // 0x0328(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnvHitboxActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnvHitboxActor")
	}
	static class AEnvHitboxActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEnvHitboxActor>();
	}
};
DUMPER7_ASSERTS_AEnvHitboxActor;

// Class SCCombatSystem.HitDetectionDB
// 0x0008 (0x0030 - 0x0028)
class UHitDetectionDB : public UObject
{
public:
	float                                         m_fServerScale;                                    // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HitDetectionDB")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HitDetectionDB")
	}
	static class UHitDetectionDB* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHitDetectionDB>();
	}
};
DUMPER7_ASSERTS_UHitDetectionDB;

// Class SCCombatSystem.TrailHitDetectionDB
// 0x0028 (0x0058 - 0x0030)
class UTrailHitDetectionDB final : public UHitDetectionDB
{
public:
	int32                                         m_iCount;                                          // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                m_vCloneDistance;                                  // 0x0038(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UHitDetectionDB*                        m_ClonedHitDetectionDB;                            // 0x0050(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TrailHitDetectionDB")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TrailHitDetectionDB")
	}
	static class UTrailHitDetectionDB* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTrailHitDetectionDB>();
	}
};
DUMPER7_ASSERTS_UTrailHitDetectionDB;

// Class SCCombatSystem.HitboxComponent
// 0x0120 (0x0360 - 0x0240)
class UHitboxComponent final : public USceneComponent
{
public:
	uint8                                         Pad_240[0x10];                                     // 0x0240(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptStruct*                          m_TableRowType;                                    // 0x0250(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    m_HitboxTableRow;                                  // 0x0258(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayTag                           m_HitboxID;                                        // 0x0268(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         m_iHitboxIndex;                                    // 0x0270(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_bSkipActivationTagQueryOnDedicatedServer;        // 0x0274(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_275[0x3];                                      // 0x0275(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      m_ActivationTagQuery;                              // 0x0278(0x0048)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      m_DeactivationTagQuery;                            // 0x02C0(0x0048)(Edit, NativeAccessSpecifierPublic)
	struct FBaseActorConditionInstance            m_ActivationCondition;                             // 0x0308(0x0010)(Edit, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UHitDetectionDB*                        m_HitDetection;                                    // 0x0318(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 m_DebugColor;                                      // 0x0320(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UHitboxData>                m_HitboxData;                                      // 0x0328(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitboxDataInstance                    m_HitboxDataInstance;                              // 0x0330(0x0030)(Edit, NativeAccessSpecifierPublic)

public:
	void BPF_ResetHitBoxTableRowToDefault();
	void BPF_SetHitBoxTableRow(const class FName _hitBoxTableRowName);

	struct FDataTableRowHandle BPF_GetCurrentHitBoxRow() const;
	struct FVector BPF_GetHitDetectionExtent() const;
	class UScriptStruct* GetCustomDataTableStruct() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HitboxComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HitboxComponent")
	}
	static class UHitboxComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHitboxComponent>();
	}
};
DUMPER7_ASSERTS_UHitboxComponent;

// Class SCCombatSystem.HitStackBehavior
// 0x0000 (0x0028 - 0x0028)
class UHitStackBehavior : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HitStackBehavior")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HitStackBehavior")
	}
	static class UHitStackBehavior* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHitStackBehavior>();
	}
};
DUMPER7_ASSERTS_UHitStackBehavior;

// Class SCCombatSystem.SingleHitBehavior
// 0x0000 (0x0028 - 0x0028)
class USingleHitBehavior final : public UHitStackBehavior
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SingleHitBehavior")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SingleHitBehavior")
	}
	static class USingleHitBehavior* GetDefaultObj()
	{
		return GetDefaultObjImpl<USingleHitBehavior>();
	}
};
DUMPER7_ASSERTS_USingleHitBehavior;

// Class SCCombatSystem.HitRequestCondition
// 0x0000 (0x0028 - 0x0028)
class UHitRequestCondition final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HitRequestCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HitRequestCondition")
	}
	static class UHitRequestCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHitRequestCondition>();
	}
};
DUMPER7_ASSERTS_UHitRequestCondition;

// Class SCCombatSystem.HitboxData
// 0x02A8 (0x02D0 - 0x0028)
class UHitboxData : public UObject
{
public:
	uint8                                         Pad_28[0x30];                                      // 0x0028(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptStruct*                          m_RowType;                                         // 0x0058(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    m_DataTableRow;                                    // 0x0060(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    m_ParentDataTableRow;                              // 0x0070(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FTargetDataTypeFilter                  m_TargetDataFilter;                                // 0x0080(0x0030)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FInstancedPropertyBag                  m_ExposedParams;                                   // 0x00B0(0x0010)(Edit, NativeAccessSpecifierPublic)
	TSubclassOf<class UAttributeSet>              m_AttributeSet;                                    // 0x00C0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           m_HitboxTag;                                       // 0x00C8(0x0008)(Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  m_InteractionTags;                                 // 0x00D0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayTagDataBinding                m_Tag;                                             // 0x00F0(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayTagContainerDataBinding       m_AttackTagContainer;                              // 0x0120(0x0048)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                          m_bHitEnvironment;                                 // 0x0168(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UHitStackBehavior>          m_HitStackBehavior;                                // 0x0170(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      m_HurtboxTagQuery;                                 // 0x0178(0x0048)(Edit, NativeAccessSpecifierPublic)
	struct FBaseActorTargetConditionInstance      m_HitRequestCondition;                             // 0x01C0(0x0010)(Edit, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TSubclassOf<class UHitRequestCondition>       m_CustomHitRequestCondition;                       // 0x01D0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTargetDataConditionInstance           m_Condition;                                       // 0x01D8(0x0010)(Edit, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	EHitboxGroup                                  m_eHitboxGroup;                                    // 0x01E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHitboxRecoveryMethod                         m_eRecoveryMethod;                                 // 0x01EC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFloatDataBinding                      m_RecoveryDuration;                                // 0x01F0(0x0048)(Edit, NativeAccessSpecifierPublic)
	bool                                          m_bStartRecoveryOnConditionFail;                   // 0x0238(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHitboxRecoveryMethod                         m_eConditionFailRecoveryMethod;                    // 0x0239(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23A[0x6];                                      // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFloatDataBinding                      m_ConditionFailRecoveryDuration;                   // 0x0240(0x0048)(Edit, NativeAccessSpecifierPublic)
	bool                                          m_bApplyRecoveryOnConditionFail;                   // 0x0288(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_fRecoveryDuration;                               // 0x028C(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_bEndRecoveryOnHitCollisionEnd;                   // 0x0290(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitReactionInstance                   m_HitReaction;                                     // 0x0298(0x0010)(Edit, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FGameplayTag                           m_HurtTagEvent;                                    // 0x02A8(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           m_HitTagEvent;                                     // 0x02B0(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           m_HurtGameplayCueTag;                              // 0x02B8(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           m_HitGameplayCueTag;                               // 0x02C0(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         m_iPriorityWeight;                                 // 0x02C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 m_DebugColor;                                      // 0x02CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	class UScriptStruct* GetCustomDataTableStruct() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HitboxData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HitboxData")
	}
	static class UHitboxData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHitboxData>();
	}
};
DUMPER7_ASSERTS_UHitboxData;

// Class SCCombatSystem.HitInstigatorActorCondition
// 0x0010 (0x0088 - 0x0078)
class UHitInstigatorActorCondition : public UTargetDataCondition
{
public:
	struct FBaseActorConditionInstance            m_Condition;                                       // 0x0078(0x0010)(Edit, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HitInstigatorActorCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HitInstigatorActorCondition")
	}
	static class UHitInstigatorActorCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHitInstigatorActorCondition>();
	}
};
DUMPER7_ASSERTS_UHitInstigatorActorCondition;

// Class SCCombatSystem.HitInstigatorFromContextActorCondition
// 0x0000 (0x0088 - 0x0088)
class UHitInstigatorFromContextActorCondition final : public UHitInstigatorActorCondition
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HitInstigatorFromContextActorCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HitInstigatorFromContextActorCondition")
	}
	static class UHitInstigatorFromContextActorCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHitInstigatorFromContextActorCondition>();
	}
};
DUMPER7_ASSERTS_UHitInstigatorFromContextActorCondition;

// Class SCCombatSystem.HitReaction
// 0x0000 (0x0028 - 0x0028)
class UHitReaction : public UObject
{
public:
	void BPF_BuildClientPayload(const class USCGameplayAbility* _ability, const struct FPendingHit& _hit, struct FGameplayAbilityTargetDataHandle& _outResultTargetData) const;
	void BPF_OnHit(const class USCGameplayAbility* _ability, const struct FPendingHit& _hit) const;
	void BPF_OnHurt(class UHurtboxSolverComponent* _hurtComponent, const struct FPendingHit& _hit, struct FGameplayTagContainer* _outcomeTags) const;
	void BPF_OnReaction(EHitReactionType _eReaction, const struct FPendingHit& _hit) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HitReaction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HitReaction")
	}
	static class UHitReaction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHitReaction>();
	}
};
DUMPER7_ASSERTS_UHitReaction;

// Class SCCombatSystem.HitReactionTarget
// 0x0000 (0x0028 - 0x0028)
class UHitReactionTarget : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HitReactionTarget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HitReactionTarget")
	}
	static class UHitReactionTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHitReactionTarget>();
	}
};
DUMPER7_ASSERTS_UHitReactionTarget;

// Class SCCombatSystem.HurtHitReactionTarget
// 0x0000 (0x0028 - 0x0028)
class UHurtHitReactionTarget : public UHitReactionTarget
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HurtHitReactionTarget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HurtHitReactionTarget")
	}
	static class UHurtHitReactionTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHurtHitReactionTarget>();
	}
};
DUMPER7_ASSERTS_UHurtHitReactionTarget;

// Class SCCombatSystem.InstigatorHitReactionTarget
// 0x0000 (0x0028 - 0x0028)
class UInstigatorHitReactionTarget final : public UHitReactionTarget
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InstigatorHitReactionTarget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InstigatorHitReactionTarget")
	}
	static class UInstigatorHitReactionTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInstigatorHitReactionTarget>();
	}
};
DUMPER7_ASSERTS_UInstigatorHitReactionTarget;

// Class SCCombatSystem.GameplayEventHitReaction
// 0x0020 (0x0048 - 0x0028)
class UGameplayEventHitReaction final : public UHitReaction
{
public:
	struct FGameplayTag                           m_GameplayEvent;                                   // 0x0028(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UHitReactionTarget>         m_Target;                                          // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGameplayTag>                   m_NamedEventsToSend;                               // 0x0038(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameplayEventHitReaction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameplayEventHitReaction")
	}
	static class UGameplayEventHitReaction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayEventHitReaction>();
	}
};
DUMPER7_ASSERTS_UGameplayEventHitReaction;

// Class SCCombatSystem.GameplayEffectHitReaction
// 0x0060 (0x0088 - 0x0028)
class UGameplayEffectHitReaction final : public UHitReaction
{
public:
	TSubclassOf<class UGameplayEffect>            m_GameplayEffect;                                  // 0x0028(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_bRemoveEffectOnHitRecovery;                      // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UHitReactionTarget>         m_Target;                                          // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFloatDataBinding                      m_EffectLevel;                                     // 0x0040(0x0048)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameplayEffectHitReaction")
	}
	static const class FName& StaticName()
	{
