#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SCCore

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SCCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "AIModule_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "StructUtils_structs.hpp"
#include "MovieScene_structs.hpp"
#include "StateTreeModule_structs.hpp"


namespace SDK::Params
{

// Function SCCore.AbilityMontageNotifyState.BPF_NotifyBegin
// 0x00F0 (0x00F0 - 0x0000)
struct AbilityMontageNotifyState_BPF_NotifyBegin final
{
public:
	struct FGameplayAbilityTargetDataHandle       _context;                                          // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class USCGameplayAbility*                     _ability;                                          // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAnimNotifyEvent                       _event;                                            // 0x0030(0x00B8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                         _fDuration;                                        // 0x00E8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbilityMontageNotifyState_BPF_NotifyBegin;

// Function SCCore.AbilityTask_ApplyRootMotionSnapFromInitialSpeed.BPF_SnapFromInitialSpeed
// 0x0040 (0x0040 - 0x0000)
struct AbilityTask_ApplyRootMotionSnapFromInitialSpeed_BPF_SnapFromInitialSpeed final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   _taskInstanceName;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                _vTargetPosition;                                  // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            _springSpeedPerInitialDistance;                    // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fDistanceReachRadius;                             // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_ApplyRootMotionSnapFromInitialSpeed* ReturnValue;                             // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_ApplyRootMotionSnapFromInitialSpeed_BPF_SnapFromInitialSpeed;

// Function SCCore.AbilityTask_BlueprintGenericTask.BPF_BlueprintGenericTask
// 0x0010 (0x0010 - 0x0000)
struct AbilityTask_BlueprintGenericTask_BPF_BlueprintGenericTask final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_BlueprintGenericTask*      ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_BlueprintGenericTask_BPF_BlueprintGenericTask;

// Function SCCore.SCAbilitySystemBPLibrary.BPF_CancelAbilityByTag
// 0x0050 (0x0050 - 0x0000)
struct SCAbilitySystemBPLibrary_BPF_CancelAbilityByTag final
{
public:
	class UAbilitySystemComponent*                _asc;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  _withTags;                                         // 0x0008(0x0020)(Parm, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  _withoutTags;                                      // 0x0028(0x0020)(Parm, NativeAccessSpecifierPublic)
	class UGameplayAbility*                       _ignore;                                           // 0x0048(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SCAbilitySystemBPLibrary_BPF_CancelAbilityByTag;

// Function SCCore.SCAbilitySystemBPLibrary.BPF_FindLocalAbility
// 0x0020 (0x0020 - 0x0000)
struct SCAbilitySystemBPLibrary_BPF_FindLocalAbility final
{
public:
	class UAbilitySystemComponent*                _asc;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameplayAbility>           _abilityClass;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bIncludeChildren;                                 // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bCheckIfActive;                                   // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayAbility*                       ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SCAbilitySystemBPLibrary_BPF_FindLocalAbility;

// Function SCCore.SCAbilitySystemBPLibrary.BPF_GetAbility
// 0x0020 (0x0020 - 0x0000)
struct SCAbilitySystemBPLibrary_BPF_GetAbility final
{
public:
	struct FGameplayEffectContextHandle           _effectContext;                                    // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	class UGameplayAbility*                       ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SCAbilitySystemBPLibrary_BPF_GetAbility;

// Function SCCore.SCAbilitySystemBPLibrary.BPF_GetGameplayEffectContextHandleFromActiveEffectHandle
// 0x0020 (0x0020 - 0x0000)
struct SCAbilitySystemBPLibrary_BPF_GetGameplayEffectContextHandleFromActiveEffectHandle final
{
public:
	struct FActiveGameplayEffectHandle            _activeHandle;                                     // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle           ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SCAbilitySystemBPLibrary_BPF_GetGameplayEffectContextHandleFromActiveEffectHandle;

// Function SCCore.SCAbilitySystemBPLibrary.BPF_GetSetByCallerMagnitude
// 0x02C8 (0x02C8 - 0x0000)
struct SCAbilitySystemBPLibrary_BPF_GetSetByCallerMagnitude final
{
public:
	struct FGameplayEffectSpec                    _effectSpec;                                       // 0x0000(0x02B8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FGameplayTag                           _gameplayTag;                                      // 0x02B8(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x02C0(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SCAbilitySystemBPLibrary_BPF_GetSetByCallerMagnitude;

// Function SCCore.SCAbilitySystemBPLibrary.BPF_HasActiveAbilities
// 0x0030 (0x0030 - 0x0000)
struct SCAbilitySystemBPLibrary_BPF_HasActiveAbilities final
{
public:
	class UAbilitySystemComponent*                _asc;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  _gameplayTagContainer;                             // 0x0008(0x0020)(Parm, NativeAccessSpecifierPublic)
	bool                                          _bOnlyAbilitiesThatSatisfyTagRequirements;         // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0029(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SCAbilitySystemBPLibrary_BPF_HasActiveAbilities;

// Function SCCore.SCAbilitySystemBPLibrary.BPF_IsEffectHandleValid
// 0x000C (0x000C - 0x0000)
struct SCAbilitySystemBPLibrary_BPF_IsEffectHandleValid final
{
public:
	struct FActiveGameplayEffectHandle            _activeHandle;                                     // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SCAbilitySystemBPLibrary_BPF_IsEffectHandleValid;

// Function SCCore.AbilityTask_ChangeMovementMode.BPF_TaskChangeMovementMode
// 0x0020 (0x0020 - 0x0000)
struct AbilityTask_ChangeMovementMode_BPF_TaskChangeMovementMode final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USCDynamicSpeedMovementComponent*       _movementComponent;                                // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMovementMode                                 _eMovementModeStartingAbility;                     // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_ChangeMovementMode*        ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_ChangeMovementMode_BPF_TaskChangeMovementMode;

// Function SCCore.AbilityTask_Transition.IsTransitionAllowedByTransitionDB
// 0x0038 (0x0038 - 0x0000)
struct AbilityTask_Transition_IsTransitionAllowedByTransitionDB final
{
public:
	struct FSCTransition                          _testingTransition;                                // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSCTransition                          _currentTransition;                                // 0x0018(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fTransitionRatio;                                 // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bIsInDeccel;                                      // 0x0034(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0035(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbilityTask_Transition_IsTransitionAllowedByTransitionDB;

// Function SCCore.SCActorHelpers.BPF_GetClosestActor
// 0x0020 (0x0020 - 0x0000)
struct SCActorHelpers_BPF_GetClosestActor final
{
public:
	class AActor*                                 _target;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         _actors;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SCActorHelpers_BPF_GetClosestActor;

// Function SCCore.AbilityTask_ComputeTransition.BPF_ComputeTransition
// 0x0048 (0x0048 - 0x0000)
struct AbilityTask_ComputeTransition_BPF_ComputeTransition final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSCTransitionSettings                  _transitionSettings;                               // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         _iMaxPreviousMovementDescriptionCount;             // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_ComputeTransition*         ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_ComputeTransition_BPF_ComputeTransition;

// Function SCCore.AbilityTask_DetectGameplayTagMontageNotify.BPF_DetectGameplayTagMontageNotify
// 0x0010 (0x0010 - 0x0000)
struct AbilityTask_DetectGameplayTagMontageNotify_BPF_DetectGameplayTagMontageNotify final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_DetectGameplayTagMontageNotify* ReturnValue;                                  // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_DetectGameplayTagMontageNotify_BPF_DetectGameplayTagMontageNotify;

// Function SCCore.TargetDataCondition.BPF_Evaluate
// 0x0038 (0x0038 - 0x0000)
struct TargetDataCondition_BPF_Evaluate final
{
public:
	const class AActor*                           _actor;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAbilityTargetDataHandle       _handle;                                           // 0x0008(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_TargetDataCondition_BPF_Evaluate;

// Function SCCore.AbilityTask_HandleAvailabilityTags.BPF_HandleAvailabilityTags
// 0x0090 (0x0090 - 0x0000)
struct AbilityTask_HandleAvailabilityTags_BPF_HandleAvailabilityTags final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTagAvailabilityLayer                  _tag;                                              // 0x0008(0x0070)(Parm, NativeAccessSpecifierPublic)
	struct FFloatRange                            _timeRange;                                        // 0x0078(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_HandleAvailabilityTags*    ReturnValue;                                       // 0x0088(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_HandleAvailabilityTags_BPF_HandleAvailabilityTags;

// Function SCCore.AbilityTask_HandleAvailabilityTags.BPF_HandleAvailabilityTagsFromData
// 0x0028 (0x0028 - 0x0000)
struct AbilityTask_HandleAvailabilityTags_BPF_HandleAvailabilityTagsFromData final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UTagAvailabilityLayerContainer> _data;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFloatRange                            _timeRange;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_HandleAvailabilityTags*    ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_HandleAvailabilityTags_BPF_HandleAvailabilityTagsFromData;

// Function SCCore.AbilityTask_HandleCharacterLocomotion.BPF_HandleCharacterLocomotion
// 0x0070 (0x0070 - 0x0000)
struct AbilityTask_HandleCharacterLocomotion_BPF_HandleCharacterLocomotion final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USCInputAction*                         _inputAction;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputStablizationSettings             _inputStabilizationSettings;                       // 0x0010(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      _activationQuery;                                  // 0x0020(0x0048)(Parm, NativeAccessSpecifierPublic)
	class UAbilityTask_HandleCharacterLocomotion* ReturnValue;                                       // 0x0068(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_HandleCharacterLocomotion_BPF_HandleCharacterLocomotion;

// Function SCCore.AbilityTask_HandleGameplayCue.BPF_HandleGameplayCue
// 0x0038 (0x0038 - 0x0000)
struct AbilityTask_HandleGameplayCue_BPF_HandleGameplayCue final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           _gameplayCueTag;                                   // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle           _context;                                          // 0x0010(0x0018)(Parm, NativeAccessSpecifierPublic)
	bool                                          _bReplicated;                                      // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_HandleGameplayCue*         ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_HandleGameplayCue_BPF_HandleGameplayCue;

// Function SCCore.AbilityTask_HandleGameplayEffect.BPF_HandleGameplayEffect
// 0x0020 (0x0020 - 0x0000)
struct AbilityTask_HandleGameplayEffect_BPF_HandleGameplayEffect final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameplayEffect>            _gameplayEffectClass;                              // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         _iGameplayEffectLevel;                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         _iStacks;                                          // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_HandleGameplayEffect*      ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_HandleGameplayEffect_BPF_HandleGameplayEffect;

// Function SCCore.AbilityTask_HandleGameplayEffectSpecToSelf.BPF_HandleGameplayEffectSpecToSelf
// 0x0020 (0x0020 - 0x0000)
struct AbilityTask_HandleGameplayEffectSpecToSelf_BPF_HandleGameplayEffectSpecToSelf final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectSpecHandle              _specHandle;                                       // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UAbilityTask_HandleGameplayEffectSpecToSelf* ReturnValue;                                  // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_HandleGameplayEffectSpecToSelf_BPF_HandleGameplayEffectSpecToSelf;

// Function SCCore.AbilityTask_HandleLooseGameplayTags.BPF_HandleLooseGameplayTag
// 0x0030 (0x0030 - 0x0000)
struct AbilityTask_HandleLooseGameplayTags_BPF_HandleLooseGameplayTag final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           _gameplayTag;                                      // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFloatRange                            _timeRange;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bReplicated;                                      // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_HandleLooseGameplayTags*   ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_HandleLooseGameplayTags_BPF_HandleLooseGameplayTag;

// Function SCCore.AbilityTask_HandleLooseGameplayTags.BPF_HandleLooseGameplayTags
// 0x0048 (0x0048 - 0x0000)
struct AbilityTask_HandleLooseGameplayTags_BPF_HandleLooseGameplayTags final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  _gameplayTags;                                     // 0x0008(0x0020)(Parm, NativeAccessSpecifierPublic)
	struct FFloatRange                            _timeRange;                                        // 0x0028(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bReplicated;                                      // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_HandleLooseGameplayTags*   ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_HandleLooseGameplayTags_BPF_HandleLooseGameplayTags;

// Function SCCore.AbilityTask_MoveToLocationWithSpeed.BPF_MoveToLocationWithSpeed
// 0x0068 (0x0068 - 0x0000)
struct AbilityTask_MoveToLocationWithSpeed_BPF_MoveToLocationWithSpeed final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   _taskInstanceName;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                _vTargetLocation;                                  // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            _speedCurve;                                       // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bRestrictSpeedToExpected;                         // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bSetNewMovementMode;                              // 0x0031(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMovementMode                                 _eMovementMode;                                    // 0x0032(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveVector*                           _pathOffsetCurve;                                  // 0x0038(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                _vPathOffsetAmplitude;                             // 0x0040(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fComputeDistanceStep;                             // 0x0058(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_MoveToLocationWithSpeed*   ReturnValue;                                       // 0x0060(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_MoveToLocationWithSpeed_BPF_MoveToLocationWithSpeed;

// Function SCCore.AbilityTask_MoveToLocationWithSpeed.BPF_MoveToLocationWithSpeedAndDuration
// 0x0048 (0x0048 - 0x0000)
struct AbilityTask_MoveToLocationWithSpeed_BPF_MoveToLocationWithSpeedAndDuration final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   _taskInstanceName;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                _vMaxTargetLocation;                               // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            _speedCurve;                                       // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bRestrictSpeedToExpected;                         // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bSetNewMovementMode;                              // 0x0031(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMovementMode                                 _eMovementMode;                                    // 0x0032(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _fComputeDistanceStep;                             // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fDuration;                                        // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_MoveToLocationWithSpeed*   ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_MoveToLocationWithSpeed_BPF_MoveToLocationWithSpeedAndDuration;

// Function SCCore.AbilityTask_MoveToSnapLocation.BPF_MoveToSnapLocation
// 0x0040 (0x0040 - 0x0000)
struct AbilityTask_MoveToSnapLocation_BPF_MoveToSnapLocation final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   _taskInstanceName;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAnimSequenceSnapPrediction            _snapPrediction;                                   // 0x0010(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          _bRedirectToTarget;                                // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _fRotationBlendDuration;                           // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_MoveToSnapLocation*        ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_MoveToSnapLocation_BPF_MoveToSnapLocation;

// Function SCCore.AbilityTask_NetworkSyncWithDelay.BPF_NetworkSyncWithDelay
// 0x00A0 (0x00A0 - 0x0000)
struct AbilityTask_NetworkSyncWithDelay_BPF_NetworkSyncWithDelay final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAbilityTargetDataHandle       _targetData;                                       // 0x0008(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FSCConditionsToSyncEarly               _conditionsToSyncEarly;                            // 0x0030(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FGameplayAbilityTargetDataHandle       _context;                                          // 0x0048(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FSCNetworkSyncData                     _syncData;                                         // 0x0070(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         _fFireTime;                                        // 0x0080(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fShootCompensationTime;                           // 0x0084(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           _gameplayTag;                                      // 0x0088(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fCatchupTime;                                     // 0x0090(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_NetworkSyncWithDelay*      ReturnValue;                                       // 0x0098(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_NetworkSyncWithDelay_BPF_NetworkSyncWithDelay;

// Function SCCore.AbilityTask_NetworkSyncWithDelay.BPF_NetworkSyncWithDelayOrInputTrigger
// 0x00A0 (0x00A0 - 0x0000)
struct AbilityTask_NetworkSyncWithDelay_BPF_NetworkSyncWithDelayOrInputTrigger final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAbilityTargetDataHandle       _targetData;                                       // 0x0008(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FSCConditionsToSyncEarly               _conditionsToSyncEarly;                            // 0x0030(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FGameplayAbilityTargetDataHandle       _context;                                          // 0x0048(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FSCNetworkSyncData                     _syncData;                                         // 0x0070(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         _fFireTime;                                        // 0x0080(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fShootCompensationTime;                           // 0x0084(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           _gameplayTag;                                      // 0x0088(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fCatchupTime;                                     // 0x0090(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fMinTimeBeforeSync;                               // 0x0094(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_NetworkSyncWithDelay*      ReturnValue;                                       // 0x0098(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_NetworkSyncWithDelay_BPF_NetworkSyncWithDelayOrInputTrigger;

// Function SCCore.AbilityTask_NetworkSyncWithDelay.BuildProvidedTargetData
// 0x0030 (0x0030 - 0x0000)
struct AbilityTask_NetworkSyncWithDelay_BuildProvidedTargetData final
{
public:
	struct FTargetDataTypeFilter                  _outProvidedTargetData;                            // 0x0000(0x0030)(Parm, OutParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_NetworkSyncWithDelay_BuildProvidedTargetData;

// Function SCCore.AbilityTask_NetworkSyncWithDelay.CheckEndSyncConditions
// 0x0030 (0x0030 - 0x0000)
struct AbilityTask_NetworkSyncWithDelay_CheckEndSyncConditions final
{
public:
	struct FGameplayAbilityTargetDataHandle       _targetData;                                       // 0x0000(0x0028)(Parm, NativeAccessSpecifierPublic)
	bool                                          _bFire;                                            // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0029(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbilityTask_NetworkSyncWithDelay_CheckEndSyncConditions;

// Function SCCore.AbilityTask_NetworkSyncWithDelay.OnInputTrigger
// 0x00A0 (0x00A0 - 0x0000)
struct AbilityTask_NetworkSyncWithDelay_OnInputTrigger final
{
public:
	const class USCInputAction*                   _action;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputActionState                      _listenerState;                                    // 0x0008(0x0098)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_NetworkSyncWithDelay_OnInputTrigger;

// Function SCCore.AbilityTask_NetworkSyncWithDelay.ReceiveTargetData
// 0x0030 (0x0030 - 0x0000)
struct AbilityTask_NetworkSyncWithDelay_ReceiveTargetData final
{
public:
	struct FGameplayAbilityTargetDataHandle       _data;                                             // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTag                           _activationTag;                                    // 0x0028(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_NetworkSyncWithDelay_ReceiveTargetData;

// Function SCCore.AbilityTask_NetworkSyncWithDelay.SendTargetData
// 0x0002 (0x0002 - 0x0000)
struct AbilityTask_NetworkSyncWithDelay_SendTargetData final
{
public:
	bool                                          _bFire;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bSyncByConditions;                                // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_NetworkSyncWithDelay_SendTargetData;

// Function SCCore.AbilityTask_NetworkSyncWithDelay.UpdateParamsTargetData
// 0x0002 (0x0002 - 0x0000)
struct AbilityTask_NetworkSyncWithDelay_UpdateParamsTargetData final
{
public:
	bool                                          _bFire;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bSyncByConditions;                                // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_NetworkSyncWithDelay_UpdateParamsTargetData;

// Function SCCore.AbilityTask_NetworkSyncInput.BPF_NetworkSyncInput
// 0x0030 (0x0030 - 0x0000)
struct AbilityTask_NetworkSyncInput_BPF_NetworkSyncInput final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USCInputAction*                         _inputToListen;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fTime;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fCompensationTime;                                // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           _gameplayTag;                                      // 0x0018(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fCatchupTime;                                     // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_NetworkSyncInput*          ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_NetworkSyncInput_BPF_NetworkSyncInput;

// Function SCCore.AbilityTask_NetworkSyncInput.BPF_NetworkSyncInputWithInputTrigger
// 0x0030 (0x0030 - 0x0000)
struct AbilityTask_NetworkSyncInput_BPF_NetworkSyncInputWithInputTrigger final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USCInputAction*                         _inputToListen;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fTime;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fCompensationTime;                                // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           _gameplayTag;                                      // 0x0018(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fCatchupTime;                                     // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fMinTimeBeforeSync;                               // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_NetworkSyncInput*          ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_NetworkSyncInput_BPF_NetworkSyncInputWithInputTrigger;

// Function SCCore.SCAimingBillboardActor.BPE_ComputeScore
// 0x0020 (0x0020 - 0x0000)
struct SCAimingBillboardActor_BPE_ComputeScore final
{
public:
	struct FVector                                _v3DPointToTest;                                   // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SCAimingBillboardActor_BPE_ComputeScore;

// Function SCCore.SCAimingBillboardActor.BPE_ComputeSize
// 0x0010 (0x0010 - 0x0000)
struct SCAimingBillboardActor_BPE_ComputeSize final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SCAimingBillboardActor_BPE_ComputeSize;

// Function SCCore.SCAimingBillboardActor.BPF_GetActorOwner
// 0x0008 (0x0008 - 0x0000)
struct SCAimingBillboardActor_BPF_GetActorOwner final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SCAimingBillboardActor_BPF_GetActorOwner;

// Function SCCore.SCAimingBillboardActor.BPF_GetScore
// 0x0004 (0x0004 - 0x0000)
struct SCAimingBillboardActor_BPF_GetScore final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SCAimingBillboardActor_BPF_GetScore;

// Function SCCore.AbilityTask_NetworkWaitCharacterHitGround.BPF_NetworkWaitCharacterHitGround
// 0x0020 (0x0020 - 0x0000)
struct AbilityTask_NetworkWaitCharacterHitGround_BPF_NetworkWaitCharacterHitGround final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fStartAtTime;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fTimeOutDuration;                                 // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           _gameplayTag;                                      // 0x0010(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_NetworkWaitCharacterHitGround* ReturnValue;                                   // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_NetworkWaitCharacterHitGround_BPF_NetworkWaitCharacterHitGround;

// Function SCCore.AbilityTask_NetworkWaitCharacterHitGround.ReceiveTargetData
// 0x0030 (0x0030 - 0x0000)
struct AbilityTask_NetworkWaitCharacterHitGround_ReceiveTargetData final
{
public:
	struct FGameplayAbilityTargetDataHandle       _data;                                             // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTag                           _activationTag;                                    // 0x0028(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_NetworkWaitCharacterHitGround_ReceiveTargetData;

// Function SCCore.AbilityTask_SCPlayMontageAndWait.BP_CreatePlayMontageAndWaitProxy_Context
// 0x0050 (0x0050 - 0x0000)
struct AbilityTask_SCPlayMontageAndWait_BP_CreatePlayMontageAndWaitProxy_Context final
{
public:
	class UGameplayAbility*                       _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   _taskInstanceName;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAbilityTargetDataHandle       _context;                                          // 0x0010(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   _StartSection;                                     // 0x0038(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bStopWhenAbilityEnds;                             // 0x0040(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bEndAbilityOnMoveInterrupt;                       // 0x0041(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _fStartTime;                                       // 0x0044(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_SCPlayMontageAndWait*      ReturnValue;                                       // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_SCPlayMontageAndWait_BP_CreatePlayMontageAndWaitProxy_Context;

// Function SCCore.AbilityTask_SCPlayMontageAndWait.BPF_PickAbilityAnimSequence
// 0x0180 (0x0180 - 0x0000)
struct AbilityTask_SCPlayMontageAndWait_BPF_PickAbilityAnimSequence final
{
public:
	EAbilityExecOrigin                            _eIn;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAbilityExecOutputWithValidation              _eOut;                                             // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USCGameplayAbility*                     _ability;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UAnimSequencePicker>        _picker;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAbilityTargetDataHandle       _playerContext;                                    // 0x0018(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAnimSequencePlayInfos                 _outSequenceInfos;                                 // 0x0040(0x0130)(Parm, OutParm, NativeAccessSpecifierPublic)
	class UBasicMontagePlayerConfiguration*       _overrideConfiguration;                            // 0x0170(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bLog;                                             // 0x0178(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbilityTask_SCPlayMontageAndWait_BPF_PickAbilityAnimSequence;

// Function SCCore.AbilityTask_SCPlayMontageAndWait.BPF_PickAbilityAnimSequenceFromInstance
// 0x01B0 (0x01B0 - 0x0000)
struct AbilityTask_SCPlayMontageAndWait_BPF_PickAbilityAnimSequenceFromInstance final
{
public:
	EAbilityExecOrigin                            _eIn;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAbilityExecOutputWithValidation              _eOut;                                             // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USCGameplayAbility*                     _ability;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAnimSequencePickerInstance            _pickerInstance;                                   // 0x0010(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FGameplayAbilityTargetDataHandle       _playerContext;                                    // 0x0048(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAnimSequencePlayInfos                 _outSequenceInfos;                                 // 0x0070(0x0130)(Parm, OutParm, NativeAccessSpecifierPublic)
	class UBasicMontagePlayerConfiguration*       _overrideConfiguration;                            // 0x01A0(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bLog;                                             // 0x01A8(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbilityTask_SCPlayMontageAndWait_BPF_PickAbilityAnimSequenceFromInstance;

// Function SCCore.AbilityTask_SCPlayMontageAndWait.BPF_PickAndPlayMontage
// 0x0070 (0x0070 - 0x0000)
struct AbilityTask_SCPlayMontageAndWait_BPF_PickAndPlayMontage final
{
public:
	class USCGameplayAbility*                     _owningAbility;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAbilityExecOrigin                            _eIn;                                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
