#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SCCore

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "SCCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ModelViewViewModel_structs.hpp"
#include "ModelViewViewModel_classes.hpp"
#include "StructUtils_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "CommonUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "MovieSceneTracks_classes.hpp"
#include "RigVM_classes.hpp"
#include "InputCore_structs.hpp"
#include "GameplayTasks_classes.hpp"
#include "MotionWarping_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "CommonGame_classes.hpp"
#include "GameplayCameras_classes.hpp"
#include "CinematicCamera_classes.hpp"
#include "CommonUser_classes.hpp"
#include "GameplayStateTreeModule_classes.hpp"
#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"
#include "LevelSequence_classes.hpp"
#include "MediaAssets_structs.hpp"


namespace SDK
{

// Class SCCore.AbilityMontageNotifyState
// 0x0000 (0x0030 - 0x0030)
class UAbilityMontageNotifyState final : public UAnimNotifyState
{
public:
	void BPF_NotifyBegin(const struct FGameplayAbilityTargetDataHandle& _context, class USCGameplayAbility* _ability, const struct FAnimNotifyEvent& _event, float _fDuration) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityMontageNotifyState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityMontageNotifyState")
	}
	static class UAbilityMontageNotifyState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityMontageNotifyState>();
	}
};
DUMPER7_ASSERTS_UAbilityMontageNotifyState;

// Class SCCore.SCActivatableWidgetContainer
// 0x0008 (0x04E0 - 0x04D8)
class USCActivatableWidgetContainer final : public UCommonActivatableWidget
{
public:
	bool                                          m_bActivateImmediateChildren;                      // 0x04D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bActivateChildrenRecursively;                    // 0x04D9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bOnlyPropagateToAutoActivateWidgets;             // 0x04DA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4DB[0x5];                                      // 0x04DB(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SCActivatableWidgetContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SCActivatableWidgetContainer")
	}
	static class USCActivatableWidgetContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<USCActivatableWidgetContainer>();
	}
};
DUMPER7_ASSERTS_USCActivatableWidgetContainer;

// Class SCCore.AbilityTask_ApplyRootMotionSnapFromInitialSpeed
// 0x0050 (0x0138 - 0x00E8)
class UAbilityTask_ApplyRootMotionSnapFromInitialSpeed final : public UAbilityTask_ApplyRootMotion_Base
{
public:
	TMulticastInlineDelegate<void(bool DestinationReached)> OnFinished;                              // 0x00E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FVector_NetQuantize100                 m_vTargetLocation;                                 // 0x00F8(0x0018)(Net, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector_NetQuantize100                 m_vInitialVelocity;                                // 0x0110(0x0018)(Net, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         m_fDistanceReachSquared;                           // 0x0128(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            m_SpringSpeedPerInitialDistance;                   // 0x0130(0x0008)(Net, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UAbilityTask_ApplyRootMotionSnapFromInitialSpeed* BPF_SnapFromInitialSpeed(class UGameplayAbility* _owningAbility, class FName _taskInstanceName, const struct FVector& _vTargetPosition, class UCurveFloat* _springSpeedPerInitialDistance, float _fDistanceReachRadius);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_ApplyRootMotionSnapFromInitialSpeed")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_ApplyRootMotionSnapFromInitialSpeed")
	}
	static class UAbilityTask_ApplyRootMotionSnapFromInitialSpeed* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_ApplyRootMotionSnapFromInitialSpeed>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_ApplyRootMotionSnapFromInitialSpeed;

// Class SCCore.AbilityTask_BlueprintGenericTask
// 0x0020 (0x00B8 - 0x0098)
class UAbilityTask_BlueprintGenericTask final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void()>              OnTaskStarted;                                     // 0x0098(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void()>              OnAbilityEnd;                                      // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)

public:
	static class UAbilityTask_BlueprintGenericTask* BPF_BlueprintGenericTask(class UGameplayAbility* _owningAbility);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_BlueprintGenericTask")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_BlueprintGenericTask")
	}
	static class UAbilityTask_BlueprintGenericTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_BlueprintGenericTask>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_BlueprintGenericTask;

// Class SCCore.SCAbilitySystemBPLibrary
// 0x0000 (0x0028 - 0x0028)
class USCAbilitySystemBPLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void BPF_CancelAbilityByTag(class UAbilitySystemComponent* _asc, const struct FGameplayTagContainer& _withTags, const struct FGameplayTagContainer& _withoutTags, class UGameplayAbility* _ignore);
	static class UGameplayAbility* BPF_FindLocalAbility(class UAbilitySystemComponent* _asc, TSubclassOf<class UGameplayAbility> _abilityClass, bool _bIncludeChildren, bool _bCheckIfActive);
	static class UGameplayAbility* BPF_GetAbility(const struct FGameplayEffectContextHandle& _effectContext);
	static struct FGameplayEffectContextHandle BPF_GetGameplayEffectContextHandleFromActiveEffectHandle(const struct FActiveGameplayEffectHandle& _activeHandle);
	static float BPF_GetSetByCallerMagnitude(const struct FGameplayEffectSpec& _effectSpec, const struct FGameplayTag& _gameplayTag);
	static bool BPF_HasActiveAbilities(class UAbilitySystemComponent* _asc, const struct FGameplayTagContainer& _gameplayTagContainer, bool _bOnlyAbilitiesThatSatisfyTagRequirements);
	static bool BPF_IsEffectHandleValid(const struct FActiveGameplayEffectHandle& _activeHandle);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SCAbilitySystemBPLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SCAbilitySystemBPLibrary")
	}
	static class USCAbilitySystemBPLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<USCAbilitySystemBPLibrary>();
	}
};
DUMPER7_ASSERTS_USCAbilitySystemBPLibrary;

// Class SCCore.AbilityTask_ChangeMovementMode
// 0x0010 (0x00A8 - 0x0098)
class UAbilityTask_ChangeMovementMode final : public UAbilityTask
{
public:
	class USCDynamicSpeedMovementComponent*       m_MovementComponent;                               // 0x0098(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_ChangeMovementMode* BPF_TaskChangeMovementMode(class UGameplayAbility* _owningAbility, class USCDynamicSpeedMovementComponent* _movementComponent, EMovementMode _eMovementModeStartingAbility);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_ChangeMovementMode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_ChangeMovementMode")
	}
	static class UAbilityTask_ChangeMovementMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_ChangeMovementMode>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_ChangeMovementMode;

// Class SCCore.AbilityTask_Transition
// 0x0060 (0x00F8 - 0x0098)
class UAbilityTask_Transition : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void(TSubclassOf<class USCTransitionDB> _transitionDB, const struct FSCTransition& _foundTransition, const struct FVector& _vStartVelocity, bool _bWasOrientedToMovement, const struct FVector& _vWantedDir)> m_OnTransitionFound; // 0x0098(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSubclassOf<class USCTransitionDB>            m_TransitionDB;                                    // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USCTransitionMovementComponent*         m_mvtComponent;                                    // 0x00B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B8[0x40];                                      // 0x00B8(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsTransitionAllowedByTransitionDB(const struct FSCTransition& _testingTransition, const struct FSCTransition& _currentTransition, float _fTransitionRatio, bool _bIsInDeccel) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_Transition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_Transition")
	}
	static class UAbilityTask_Transition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_Transition>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_Transition;

// Class SCCore.SCActorHelpers
// 0x0000 (0x0028 - 0x0028)
class USCActorHelpers final : public UBlueprintFunctionLibrary
{
public:
	static class AActor* BPF_GetClosestActor(class AActor* _target, const TArray<class AActor*>& _actors);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SCActorHelpers")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SCActorHelpers")
	}
	static class USCActorHelpers* GetDefaultObj()
	{
		return GetDefaultObjImpl<USCActorHelpers>();
	}
};
DUMPER7_ASSERTS_USCActorHelpers;

// Class SCCore.AbilityTask_ComputeTransition
// 0x0088 (0x0180 - 0x00F8)
class UAbilityTask_ComputeTransition final : public UAbilityTask_Transition
{
public:
	uint8                                         Pad_F8[0x80];                                      // 0x00F8(0x0080)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m_iMaxPreviousMovementDescriptionCount;            // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_ComputeTransition* BPF_ComputeTransition(class UGameplayAbility* _owningAbility, const struct FSCTransitionSettings& _transitionSettings, int32 _iMaxPreviousMovementDescriptionCount);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_ComputeTransition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_ComputeTransition")
	}
	static class UAbilityTask_ComputeTransition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_ComputeTransition>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_ComputeTransition;

// Class SCCore.AbilityTask_DetectGameplayTagMontageNotify
// 0x0028 (0x00C0 - 0x0098)
class UAbilityTask_DetectGameplayTagMontageNotify final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void(const struct FGameplayTag& _tag, const struct FGameplayAbilityTargetDataHandle& _targetData)> m_OnDetected; // 0x0098(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A8[0x18];                                      // 0x00A8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_DetectGameplayTagMontageNotify* BPF_DetectGameplayTagMontageNotify(class UGameplayAbility* _owningAbility);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_DetectGameplayTagMontageNotify")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_DetectGameplayTagMontageNotify")
	}
	static class UAbilityTask_DetectGameplayTagMontageNotify* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_DetectGameplayTagMontageNotify>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_DetectGameplayTagMontageNotify;

// Class SCCore.NumericConverter
// 0x0000 (0x0028 - 0x0028)
class UNumericConverter : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NumericConverter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NumericConverter")
	}
	static class UNumericConverter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNumericConverter>();
	}
};
DUMPER7_ASSERTS_UNumericConverter;

// Class SCCore.AbilityTask_EvaluateCondition
// 0x0028 (0x00C0 - 0x0098)
class UAbilityTask_EvaluateCondition : public UAbilityTask
{
public:
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              m_OnValidated;                                     // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              m_OnInvalidated;                                   // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_EvaluateCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_EvaluateCondition")
	}
	static class UAbilityTask_EvaluateCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_EvaluateCondition>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_EvaluateCondition;

// Class SCCore.AbilityTask_TaskWithTimeRange
// 0x0018 (0x00B0 - 0x0098)
class UAbilityTask_TaskWithTimeRange : public UAbilityTask
{
public:
	uint8                                         Pad_98[0x18];                                      // 0x0098(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_TaskWithTimeRange")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_TaskWithTimeRange")
	}
	static class UAbilityTask_TaskWithTimeRange* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_TaskWithTimeRange>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_TaskWithTimeRange;

// Class SCCore.TargetDataCondition
// 0x0050 (0x0078 - 0x0028)
class UTargetDataCondition : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTargetDataTypeFilter                  m_TargetDataFilter;                                // 0x0048(0x0030)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	bool BPF_Evaluate(const class AActor* _actor, const struct FGameplayAbilityTargetDataHandle& _handle) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TargetDataCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TargetDataCondition")
	}
	static class UTargetDataCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetDataCondition>();
	}
};
DUMPER7_ASSERTS_UTargetDataCondition;

// Class SCCore.NamedGameplayTagContainerTargetDataCondition
// 0x0050 (0x00C8 - 0x0078)
class UNamedGameplayTagContainerTargetDataCondition : public UTargetDataCondition
{
public:
	struct FGameplayTagContainer                  m_RequiredTags;                                    // 0x0078(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  m_ForbiddenTags;                                   // 0x0098(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	bool                                          m_bHideNameParameter;                              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           m_Name;                                            // 0x00BC(0x0008)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NamedGameplayTagContainerTargetDataCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NamedGameplayTagContainerTargetDataCondition")
	}
	static class UNamedGameplayTagContainerTargetDataCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNamedGameplayTagContainerTargetDataCondition>();
	}
};
DUMPER7_ASSERTS_UNamedGameplayTagContainerTargetDataCondition;

// Class SCCore.AbilityTask_HandleAvailabilityTags
// 0x0080 (0x0130 - 0x00B0)
class UAbilityTask_HandleAvailabilityTags final : public UAbilityTask_TaskWithTimeRange
{
public:
	uint8                                         Pad_B0[0x80];                                      // 0x00B0(0x0080)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_HandleAvailabilityTags* BPF_HandleAvailabilityTags(class UGameplayAbility* _owningAbility, const struct FTagAvailabilityLayer& _tag, const struct FFloatRange& _timeRange);
	static class UAbilityTask_HandleAvailabilityTags* BPF_HandleAvailabilityTagsFromData(class UGameplayAbility* _owningAbility, TSubclassOf<class UTagAvailabilityLayerContainer> _data, const struct FFloatRange& _timeRange);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_HandleAvailabilityTags")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_HandleAvailabilityTags")
	}
	static class UAbilityTask_HandleAvailabilityTags* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_HandleAvailabilityTags>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_HandleAvailabilityTags;

// Class SCCore.AbilityTask_HandleCharacterLocomotion
// 0x00A0 (0x0138 - 0x0098)
class UAbilityTask_HandleCharacterLocomotion final : public UAbilityTask
{
public:
	class USCInputAction*                         m_InputAction;                                     // 0x0098(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      m_ActivationQuery;                                 // 0x00A0(0x0048)(Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_E8[0x50];                                      // 0x00E8(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_HandleCharacterLocomotion* BPF_HandleCharacterLocomotion(class UGameplayAbility* _owningAbility, class USCInputAction* _inputAction, const struct FInputStablizationSettings& _inputStabilizationSettings, const struct FGameplayTagQuery& _activationQuery);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_HandleCharacterLocomotion")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_HandleCharacterLocomotion")
	}
	static class UAbilityTask_HandleCharacterLocomotion* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_HandleCharacterLocomotion>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_HandleCharacterLocomotion;

// Class SCCore.SCActor
// 0x0028 (0x02D8 - 0x02B0)
class ASCActor : public AActor
{
public:
	uint8                                         Pad_2B0[0x20];                                     // 0x02B0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          m_bIsStreamable;                                   // 0x02D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bIsPooled;                                       // 0x02D1(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2D2[0x6];                                      // 0x02D2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SCActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SCActor")
	}
	static class ASCActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASCActor>();
	}
};
DUMPER7_ASSERTS_ASCActor;

// Class SCCore.AbilityTask_HandleGameplayCue
// 0x0028 (0x00C0 - 0x0098)
class UAbilityTask_HandleGameplayCue final : public UAbilityTask
{
public:
	uint8                                         Pad_98[0x28];                                      // 0x0098(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_HandleGameplayCue* BPF_HandleGameplayCue(class UGameplayAbility* _owningAbility, const struct FGameplayTag& _gameplayCueTag, const struct FGameplayEffectContextHandle& _context, bool _bReplicated);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_HandleGameplayCue")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_HandleGameplayCue")
	}
	static class UAbilityTask_HandleGameplayCue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_HandleGameplayCue>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_HandleGameplayCue;

// Class SCCore.AbilityTask_HandleGameplayEffect
// 0x0018 (0x00B0 - 0x0098)
class UAbilityTask_HandleGameplayEffect final : public UAbilityTask
{
public:
	uint8                                         Pad_98[0x18];                                      // 0x0098(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_HandleGameplayEffect* BPF_HandleGameplayEffect(class UGameplayAbility* _owningAbility, TSubclassOf<class UGameplayEffect> _gameplayEffectClass, int32 _iGameplayEffectLevel, int32 _iStacks);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_HandleGameplayEffect")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_HandleGameplayEffect")
	}
	static class UAbilityTask_HandleGameplayEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_HandleGameplayEffect>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_HandleGameplayEffect;

// Class SCCore.NodalObjectInterface
// 0x0000 (0x0000 - 0x0000)
class INodalObjectInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NodalObjectInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NodalObjectInterface")
	}
	static class INodalObjectInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<INodalObjectInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_INodalObjectInterface;

// Class SCCore.AbilityTask_HandleGameplayEffectSpecToSelf
// 0x0018 (0x00B0 - 0x0098)
class UAbilityTask_HandleGameplayEffectSpecToSelf final : public UAbilityTask
{
public:
	uint8                                         Pad_98[0x18];                                      // 0x0098(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_HandleGameplayEffectSpecToSelf* BPF_HandleGameplayEffectSpecToSelf(class UGameplayAbility* _owningAbility, const struct FGameplayEffectSpecHandle& _specHandle);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_HandleGameplayEffectSpecToSelf")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_HandleGameplayEffectSpecToSelf")
	}
	static class UAbilityTask_HandleGameplayEffectSpecToSelf* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_HandleGameplayEffectSpecToSelf>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_HandleGameplayEffectSpecToSelf;

// Class SCCore.AbilityTask_HandleLooseGameplayTags
// 0x0030 (0x00E0 - 0x00B0)
class UAbilityTask_HandleLooseGameplayTags final : public UAbilityTask_TaskWithTimeRange
{
public:
	uint8                                         Pad_B0[0x30];                                      // 0x00B0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_HandleLooseGameplayTags* BPF_HandleLooseGameplayTag(class UGameplayAbility* _owningAbility, const struct FGameplayTag& _gameplayTag, const struct FFloatRange& _timeRange, bool _bReplicated);
	static class UAbilityTask_HandleLooseGameplayTags* BPF_HandleLooseGameplayTags(class UGameplayAbility* _owningAbility, const struct FGameplayTagContainer& _gameplayTags, const struct FFloatRange& _timeRange, bool _bReplicated);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_HandleLooseGameplayTags")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_HandleLooseGameplayTags")
	}
	static class UAbilityTask_HandleLooseGameplayTags* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_HandleLooseGameplayTags>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_HandleLooseGameplayTags;

// Class SCCore.TimeStretchNotifyState
// 0x0000 (0x0030 - 0x0030)
class UTimeStretchNotifyState final : public UAnimNotifyState
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TimeStretchNotifyState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TimeStretchNotifyState")
	}
	static class UTimeStretchNotifyState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTimeStretchNotifyState>();
	}
};
DUMPER7_ASSERTS_UTimeStretchNotifyState;

// Class SCCore.AbilityTask_MoveToLocationWithSpeed
// 0x0018 (0x0180 - 0x0168)
class UAbilityTask_MoveToLocationWithSpeed final : public UAbilityTask_ApplyRootMotionMoveToForce
{
public:
	bool                                          m_bUseDurationInsteadOfTargetLocation;             // 0x0168(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            m_SpeedCurve;                                      // 0x0170(0x0008)(Net, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         m_fComputeDistanceStep;                            // 0x0178(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_MoveToLocationWithSpeed* BPF_MoveToLocationWithSpeed(class UGameplayAbility* _owningAbility, class FName _taskInstanceName, const struct FVector& _vTargetLocation, class UCurveFloat* _speedCurve, bool _bRestrictSpeedToExpected, bool _bSetNewMovementMode, EMovementMode _eMovementMode, class UCurveVector* _pathOffsetCurve, const struct FVector& _vPathOffsetAmplitude, float _fComputeDistanceStep);
	static class UAbilityTask_MoveToLocationWithSpeed* BPF_MoveToLocationWithSpeedAndDuration(class UGameplayAbility* _owningAbility, class FName _taskInstanceName, const struct FVector& _vMaxTargetLocation, class UCurveFloat* _speedCurve, bool _bRestrictSpeedToExpected, bool _bSetNewMovementMode, EMovementMode _eMovementMode, float _fComputeDistanceStep, float _fDuration);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_MoveToLocationWithSpeed")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_MoveToLocationWithSpeed")
	}
	static class UAbilityTask_MoveToLocationWithSpeed* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_MoveToLocationWithSpeed>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_MoveToLocationWithSpeed;

// Class SCCore.AbilityTask_MoveToSnapLocation
// 0x0020 (0x0188 - 0x0168)
class UAbilityTask_MoveToSnapLocation final : public UAbilityTask_ApplyRootMotionMoveToForce
{
public:
	struct FRotator                               m_StartRotation;                                   // 0x0168(0x0018)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          m_bRedirectToTarget;                               // 0x0180(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_fRotationBlendDuration;                          // 0x0184(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UAbilityTask_MoveToSnapLocation* BPF_MoveToSnapLocation(class UGameplayAbility* _owningAbility, class FName _taskInstanceName, const struct FAnimSequenceSnapPrediction& _snapPrediction, bool _bRedirectToTarget, float _fRotationBlendDuration);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_MoveToSnapLocation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_MoveToSnapLocation")
	}
	static class UAbilityTask_MoveToSnapLocation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_MoveToSnapLocation>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_MoveToSnapLocation;

// Class SCCore.ScaleSpeedRootMotionModifierData
// 0x0148 (0x0170 - 0x0028)
class UScaleSpeedRootMotionModifierData : public UObject
{
public:
	struct FScaleSpeedCurveData                   m_DefaultHorizontalCurveData;                      // 0x0028(0x0098)(Edit, NativeAccessSpecifierPublic)
	struct FScaleSpeedCurveData                   m_DefaultVerticalCurveData;                        // 0x00C0(0x0098)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FConditionalSpeedCurveData>     m_ConditionalSpeedCurves;                          // 0x0158(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          m_bConserveLastModifiedSpeedUpToAnimEnd;           // 0x0168(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ScaleSpeedRootMotionModifierData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ScaleSpeedRootMotionModifierData")
	}
	static class UScaleSpeedRootMotionModifierData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScaleSpeedRootMotionModifierData>();
	}
};
DUMPER7_ASSERTS_UScaleSpeedRootMotionModifierData;

// Class SCCore.AbilityTask_NetworkSyncWithDelay
// 0x0108 (0x01A0 - 0x0098)
class UAbilityTask_NetworkSyncWithDelay : public UAbilityTask
{
public:
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> OnSync;      // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> OnTimeOut;   // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> OnCancel;    // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> m_BuildClientPayload; // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_E0[0xC0];                                      // 0x00E0(0x00C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_NetworkSyncWithDelay* BPF_NetworkSyncWithDelay(class UGameplayAbility* _owningAbility, const struct FGameplayAbilityTargetDataHandle& _targetData, const struct FSCConditionsToSyncEarly& _conditionsToSyncEarly, const struct FGameplayAbilityTargetDataHandle& _context, const struct FSCNetworkSyncData& _syncData, float _fFireTime, float _fShootCompensationTime, const struct FGameplayTag& _gameplayTag, float _fCatchupTime);
	static class UAbilityTask_NetworkSyncWithDelay* BPF_NetworkSyncWithDelayOrInputTrigger(class UGameplayAbility* _owningAbility, const struct FGameplayAbilityTargetDataHandle& _targetData, const struct FSCConditionsToSyncEarly& _conditionsToSyncEarly, const struct FGameplayAbilityTargetDataHandle& _context, const struct FSCNetworkSyncData& _syncData, float _fFireTime, float _fShootCompensationTime, const struct FGameplayTag& _gameplayTag, float _fCatchupTime, float _fMinTimeBeforeSync);

	void BuildProvidedTargetData(struct FTargetDataTypeFilter* _outProvidedTargetData);
	bool CheckEndSyncConditions(const struct FGameplayAbilityTargetDataHandle& _targetData, bool _bFire);
	void InitInput();
	void OnCancelledCallback();
	void OnInputTrigger(const class USCInputAction* _action, const struct FInputActionState& _listenerState);
	void ReceiveTargetData(const struct FGameplayAbilityTargetDataHandle& _data, const struct FGameplayTag& _activationTag);
	void SendTargetData(bool _bFire, bool _bSyncByConditions);
	void UpdateParamsPostBuildPayload();
	void UpdateParamsTargetData(bool _bFire, bool _bSyncByConditions);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_NetworkSyncWithDelay")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_NetworkSyncWithDelay")
	}
	static class UAbilityTask_NetworkSyncWithDelay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_NetworkSyncWithDelay>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_NetworkSyncWithDelay;

// Class SCCore.AbilityTask_NetworkSyncInput
// 0x0010 (0x01B0 - 0x01A0)
class UAbilityTask_NetworkSyncInput final : public UAbilityTask_NetworkSyncWithDelay
{
public:
	uint8                                         Pad_1A0[0x10];                                     // 0x01A0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_NetworkSyncInput* BPF_NetworkSyncInput(class UGameplayAbility* _owningAbility, class USCInputAction* _inputToListen, float _fTime, float _fCompensationTime, const struct FGameplayTag& _gameplayTag, float _fCatchupTime);
	static class UAbilityTask_NetworkSyncInput* BPF_NetworkSyncInputWithInputTrigger(class UGameplayAbility* _owningAbility, class USCInputAction* _inputToListen, float _fTime, float _fCompensationTime, const struct FGameplayTag& _gameplayTag, float _fCatchupTime, float _fMinTimeBeforeSync);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_NetworkSyncInput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_NetworkSyncInput")
	}
	static class UAbilityTask_NetworkSyncInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_NetworkSyncInput>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_NetworkSyncInput;

// Class SCCore.SCAimingBillboardActor
// 0x0048 (0x0320 - 0x02D8)
class ASCAimingBillboardActor final : public ASCActor
{
public:
	TMulticastInlineDelegate<void(bool _bSelected, class ASCAimingBillboardActor* aimingBillboard)> OnSelectionChangedDyn; // 0x02D8(0x0010)(ZeroConstructor, Transient, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E8[0x18];                                     // 0x02E8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UBoxComponent*                          m_BoxComponent;                                    // 0x0300(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bDebug;                                          // 0x0308(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_309[0x17];                                     // 0x0309(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float BPE_ComputeScore(const struct FVector& _v3DPointToTest) const;
	struct FVector2D BPE_ComputeSize() const;
	class AActor* BPF_GetActorOwner() const;
	float BPF_GetScore() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SCAimingBillboardActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SCAimingBillboardActor")
	}
	static class ASCAimingBillboardActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASCAimingBillboardActor>();
	}
};
DUMPER7_ASSERTS_ASCAimingBillboardActor;

// Class SCCore.AbilityTask_NetworkWaitCharacterHitGround
// 0x0088 (0x0120 - 0x0098)
class UAbilityTask_NetworkWaitCharacterHitGround final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> OnHitGround; // 0x0098(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> OnTimeOut;   // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> OnCancel;    // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> m_BuildClientPayload; // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D8[0x48];                                      // 0x00D8(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_NetworkWaitCharacterHitGround* BPF_NetworkWaitCharacterHitGround(class UGameplayAbility* _owningAbility, float _fStartAtTime, float _fTimeOutDuration, const struct FGameplayTag& _gameplayTag);

	void OnCancelledCallback();
	void ReceiveTargetData(const struct FGameplayAbilityTargetDataHandle& _data, const struct FGameplayTag& _activationTag);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_NetworkWaitCharacterHitGround")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_NetworkWaitCharacterHitGround")
	}
	static class UAbilityTask_NetworkWaitCharacterHitGround* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_NetworkWaitCharacterHitGround>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_NetworkWaitCharacterHitGround;

// Class SCCore.AbilityTask_SCPlayMontageAndWait
// 0x00B0 (0x0228 - 0x0178)
class UAbilityTask_SCPlayMontageAndWait : public UAbilityTask_PlayMontageAndWait
{
public:
	TMulticastInlineDelegate<void()>              m_OnCanMoveInterrupt;                              // 0x0178(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              m_OnMoveInterrupt;                                 // 0x0188(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              m_OnValidNullMontageChosen;                        // 0x0198(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                         m_iMontageInstanceID;                              // 0x01A8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1AC[0x7C];                                     // 0x01AC(0x007C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_SCPlayMontageAndWait* BP_CreatePlayMontageAndWaitProxy_Context(class UGameplayAbility* _owningAbility, class FName _taskInstanceName, const struct FGameplayAbilityTargetDataHandle& _context, class FName _StartSection, bool _bStopWhenAbilityEnds, bool _bEndAbilityOnMoveInterrupt, float _fStartTime);
	static void BPF_PickAbilityAnimSequence(EAbilityExecOrigin _eIn, EAbilityExecOutputWithValidation* _eOut, class USCGameplayAbility* _ability, TSubclassOf<class UAnimSequencePicker> _picker, const struct FGameplayAbilityTargetDataHandle& _playerContext, struct FAnimSequencePlayInfos* _outSequenceInfos, class UBasicMontagePlayerConfiguration* _overrideConfiguration, bool _bLog);
	static void BPF_PickAbilityAnimSequenceFromInstance(EAbilityExecOrigin _eIn, EAbilityExecOutputWithValidation* _eOut, class USCGameplayAbility* _ability, const struct FAnimSequencePickerInstance& _pickerInstance, const struct FGameplayAbilityTargetDataHandle& _playerContext, struct FAnimSequencePlayInfos* _outSequenceInfos, class UBasicMontagePlayerConfiguration* _overrideConfiguration, bool _bLog);
	static class UAbilityTask_SCPlayMontageAndWait* BPF_PickAndPlayMontage(class USCGameplayAbility* _owningAbility, EAbilityExecOrigin _eIn, EAbilityExecOutputWithValidation* _eOut, class FName _taskInstanceName, TSubclassOf<class UAnimSequencePicker> _picker, class FName _slotName, class UBasicMontagePlayerConfiguration* _overrideConfiguration, bool _bLog, bool _bStopWhenAbilityEnds, const struct FGameplayAbilityTargetDataHandle& _playerContext, class FName _StartSection);
	static class UAbilityTask_SCPlayMontageAndWait* BPF_PickAndPlayMontageFromInstance(class USCGameplayAbility* _owningAbility, EAbilityExecOrigin _eIn, EAbilityExecOutputWithValidation* _eOut, class FName _taskInstanceName, const struct FAnimSequencePickerInstance& _pickerInstance, class FName _slotName, class UBasicMontagePlayerConfiguration* _overrideConfiguration, bool _bLog, bool _bStopWhenAbilityEnds, const struct FGameplayAbilityTargetDataHandle& _playerContext, class FName _StartSection);
	static class UAbilityTask_SCPlayMontageAndWait* BPF_PickAndPlayMontageFromInstanceNoPayload(class USCGameplayAbility* _owningAbility, class FName _taskInstanceName, const struct FAnimSequencePickerInstance& _pickerInstance, class FName _slotName, class UBasicMontagePlayerConfiguration* _overrideConfiguration, bool _bLog, bool _bStopWhenAbilityEnds, const struct FGameplayAbilityTargetDataHandle& _playerContext, class FName _StartSection);
	static class UAbilityTask_SCPlayMontageAndWait* BPF_PickAndPlayMontageNoPayload(class USCGameplayAbility* _owningAbility, class FName _taskInstanceName, TSubclassOf<class UAnimSequencePicker> _picker, class FName _slotName, class UBasicMontagePlayerConfiguration* _overrideConfiguration, bool _bLog, bool _bStopWhenAbilityEnds, const struct FGameplayAbilityTargetDataHandle& _playerContext, class FName _StartSection);
	static class UAbilityTask_SCPlayMontageAndWait* BPF_PickAndPlayMontageNoPayloadInlineTargetdata(class USCGameplayAbility* _owningAbility, class FName _taskInstanceName, TSubclassOf<class UAnimSequencePicker> _picker, class FName _slotName, class UBasicMontagePlayerConfiguration* _overrideConfiguration, bool _bLog, bool _bStopWhenAbilityEnds, const struct FGameplayAbilityTargetDataHandle& _playerContext, class FName _StartSection);
	static class UAbilityTask_SCPlayMontageAndWait* BPF_PickAndPlayMontageWithSlots(class USCGameplayAbility* _owningAbility, class FName _taskInstanceName, TSubclassOf<class UAnimSequencePickerContainer> _picker, const TMap<class FName, struct FAnimSequencePlayInfos>& _slots, class UBasicMontagePlayerConfiguration* _overrideConfiguration, bool _bLog, bool _bStopWhenAbilityEnds, const struct FGameplayAbilityTargetDataHandle& _playerContext, class FName _StartSection);
	static class UAbilityTask_SCPlayMontageAndWait* BPF_PickAndPlaySlaveMontage(class USCGameplayAbility* _owningAbility, class FName _taskInstanceName, TSubclassOf<class UAnimSequencePicker> _picker, class FName _slotName, class UBasicMontagePlayerConfiguration* _overrideConfiguration, bool _bLog, bool _bStopWhenAbilityEnds, const struct FGameplayAbilityTargetDataHandle& _playerContext, class FName _StartSection);
	static class UAbilityTask_SCPlayMontageAndWait* BPF_PickAndPlaySlaveMontageFromInstance(class USCGameplayAbility* _owningAbility, class FName _taskInstanceName, const struct FAnimSequencePickerInstance& _pickerInstance, class FName _slotName, class UBasicMontagePlayerConfiguration* _overrideConfiguration, bool _bLog, bool _bStopWhenAbilityEnds, const struct FGameplayAbilityTargetDataHandle& _playerContext, class FName _StartSection);
	static class UAbilityTask_SCPlayMontageAndWait* BPF_PlayMontageFromPicker(class USCGameplayAbility* _owningAbility, class FName _taskInstanceName, const struct FAnimSequencePlayInfos& _sequenceInfos, bool _bStopWhenAbilityEnds, const struct FGameplayAbilityTargetDataHandle& _playerContext, class FName _StartSection);
	static class UAbilityTask_SCPlayMontageAndWait* BPF_PlayServerMontage(class USCGameplayAbility* _owningAbility, class FName _taskInstanceName, bool _bLog, bool _bStopWhenAbilityEnds);
	static class UAbilityTask_SCPlayMontageAndWait* BPF_PrepareAndPlayMontageFromPlayInfos(class USCGameplayAbility* _owningAbility, EAbilityExecOrigin _eIn, EAbilityExecOutputWithValidation* _eOut, class FName _taskInstanceName, const struct FAnimSequencePlayInfos& _sequenceInfos, bool _bStopWhenAbilityEnds, const struct FGameplayAbilityTargetDataHandle& _playerContext, class FName _StartSection, bool _bEndAbilityOnMoveInterrupt);
	static class UAbilityTask_SCPlayMontageAndWait* SCPlayMontageAndWait(class UGameplayAbility* _owningAbility, class FName _taskInstanceName, class UAnimMontage* _montageToPlay, bool _bMirror, float _fRate, class FName _StartSection, bool _bStopWhenAbilityEnds, float _fAnimRootMotionTranslationScale, float _fStartTimeSeconds, bool _bEndAbilityOnMoveInterrupt, const struct FGameplayAbilityTargetDataHandle& _playerContext);

	void BPF_SetMoveInterruptContext(const struct FGameplayAbilityTargetDataHandle& _targetData);

	void BPF_GetPlayInfos(struct FAnimSequencePlayInfos* _outInfos) const;
	void BPF_GetPlayInfosTargetData(struct FGameplayAbilityTargetDataHandle* _targetData) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_SCPlayMontageAndWait")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_SCPlayMontageAndWait")
	}
	static class UAbilityTask_SCPlayMontageAndWait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_SCPlayMontageAndWait>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_SCPlayMontageAndWait;

// Class SCCore.SCMontageSectionMetadata
// 0x0010 (0x0038 - 0x0028)
class USCMontageSectionMetadata final : public UAnimMetaData
{
public:
	bool                                          m_bUseCustomDirectionAngleAxis;                    // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_fCustomDirectionAngleAxis;                       // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAxis                                         m_eSnapAxis;                                       // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SCMontageSectionMetadata")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SCMontageSectionMetadata")
	}
	static class USCMontageSectionMetadata* GetDefaultObj()
	{
		return GetDefaultObjImpl<USCMontageSectionMetadata>();
	}
};
DUMPER7_ASSERTS_USCMontageSectionMetadata;

// Class SCCore.AbilityTask_DetectEndMontage
// 0x0048 (0x00E0 - 0x0098)
class UAbilityTask_DetectEndMontage final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> m_OnEnded;   // 0x0098(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> m_BuildClientPayload; // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> m_OnCancelled; // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C8[0x18];                                      // 0x00C8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_DetectEndMontage* BPF_DetectEndMontage(class UGameplayAbility* _owningAbility, class UAbilityTask_SCPlayMontageAndWait* _scPlayMontageTask, const struct FGameplayTag& _gameplayTag, bool _bRegisterOnCanMoveInterruptEvent);

	void OnCancelled();
	void OnEnded();
	void ReceiveTargetData(const struct FGameplayAbilityTargetDataHandle& _data, const struct FGameplayTag& _activationTag);
	void SendTargetData();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_DetectEndMontage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_DetectEndMontage")
	}
	static class UAbilityTask_DetectEndMontage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_DetectEndMontage>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_DetectEndMontage;

// Class SCCore.AbilityTask_SCPlaySlotMontageAndWait
// 0x0008 (0x0230 - 0x0228)
class UAbilityTask_SCPlaySlotMontageAndWait final : public UAbilityTask_SCPlayMontageAndWait
{
public:
	uint8                                         Pad_228[0x8];                                      // 0x0228(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_SCPlaySlotMontageAndWait* BPF_PickAndPlaySlotMontage(class USCGameplayAbility* _owningAbility, EAbilityExecOrigin _eIn, EAbilityExecOutputWithValidation* _eOut, class FName _taskInstanceName, TSubclassOf<class UAnimSequencePickerSlotContainer> _picker, class FName _slot, class FName _animMontageSlotOverride, class UBasicMontagePlayerConfiguration* _overrideConfiguration, bool _bLog, bool _bStopWhenAbilityEnds, const struct FGameplayAbilityTargetDataHandle& _playerContext, class FName _StartSection);
	static class UAbilityTask_SCPlaySlotMontageAndWait* BPF_SwapPlayingSlotMontage(class USCGameplayAbility* _owningAbility, class UAbilityTask_SCPlayMontageAndWait* _playingMontage, EAbilityExecOrigin _eIn, EAbilityExecOutputWithValidation* _eOut, class FName _taskInstanceName, TSubclassOf<class UAnimSequencePickerSlotContainer> _picker, class FName _pickerSlot, class FName _animMontageSlotOverride, class UBasicMontagePlayerConfiguration* _overrideConfiguration, bool _bLog, bool _bStopWhenAbilityEnds, const struct FGameplayAbilityTargetDataHandle& _playerContext, class FName _StartSection);

	class FName BPF_GetSlot() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_SCPlaySlotMontageAndWait")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_SCPlaySlotMontageAndWait")
	}
	static class UAbilityTask_SCPlaySlotMontageAndWait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_SCPlaySlotMontageAndWait>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_SCPlaySlotMontageAndWait;

// Class SCCore.SCRootMotionModifier
// 0x0030 (0x0120 - 0x00F0)
class USCRootMotionModifier : public URootMotionModifier
{
public:
	struct FBooleanDataBinding                    m_Active;                                          // 0x00E8(0x0030)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SCRootMotionModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SCRootMotionModifier")
	}
	static class USCRootMotionModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<USCRootMotionModifier>();
	}
};
DUMPER7_ASSERTS_USCRootMotionModifier;

// Class SCCore.RootMotionModifier_CyclicSwapBones
// 0x0020 (0x0140 - 0x0120)
class URootMotionModifier_CyclicSwapBones final : public USCRootMotionModifier
{
public:
	uint8                                         Pad_120[0x20];                                     // 0x0120(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RootMotionModifier_CyclicSwapBones")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RootMotionModifier_CyclicSwapBones")
	}
	static class URootMotionModifier_CyclicSwapBones* GetDefaultObj()
	{
		return GetDefaultObjImpl<URootMotionModifier_CyclicSwapBones>();
	}
};
DUMPER7_ASSERTS_URootMotionModifier_CyclicSwapBones;

// Class SCCore.AbilityTask_SCStartAbilityState
// 0x0008 (0x00D8 - 0x00D0)
class UAbilityTask_SCStartAbilityState final : public UAbilityTask_StartAbilityState
{
public:
	uint8                                         Pad_D0[0x8];                                       // 0x00D0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_SCStartAbilityState* BPF_StartAbilityState(class UGameplayAbility* _owningAbility, class FName _stateName, bool _bBindTasks);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_SCStartAbilityState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_SCStartAbilityState")
	}
	static class UAbilityTask_SCStartAbilityState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_SCStartAbilityState>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_SCStartAbilityState;

// Class SCCore.AbilityTask_TickAction
// 0x0028 (0x00C0 - 0x0098)
class UAbilityTask_TickAction final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void(float fDeltaTime)> OnTick;                                         // 0x0098(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x18];                                      // 0x00A8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_TickAction* BPF_TickAction(class UGameplayAbility* OwningAbility);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_TickAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_TickAction")
	}
	static class UAbilityTask_TickAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_TickAction>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_TickAction;

// Class SCCore.MontagePoseModifier
// 0x0008 (0x0030 - 0x0028)
class UMontagePoseModifier : public UObject
{
public:
	bool                                          m_bMute;                                           // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MontagePoseModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MontagePoseModifier")
	}
	static class UMontagePoseModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMontagePoseModifier>();
	}
};
DUMPER7_ASSERTS_UMontagePoseModifier;

// Class SCCore.AbilityTask_TriggerTransition
// 0x0010 (0x0108 - 0x00F8)
class UAbilityTask_TriggerTransition final : public UAbilityTask_Transition
{
public:
	uint8                                         Pad_F8[0x10];                                      // 0x00F8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_TriggerTransition* BPF_TriggerTransition(class UGameplayAbility* _owningAbility, TSubclassOf<class USCTransitionDB> _transitionDB, bool _bIgnoreTransitionAvailability, bool _bWaitTransitionEnd, bool _bWaitRootMotionEnd);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_TriggerTransition")
	}
	static const class FName& StaticName()
	{
