#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SCSentry

#include "Basic.hpp"

#include "SCSentry_structs.hpp"


namespace SDK::Params
{

// Function SCSentry.SCSentry.AddBreadcrumbWithParams
// 0x0088 (0x0088 - 0x0000)
struct SCSentry_AddBreadcrumbWithParams final
{
public:
	class FString                                 _message;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 _category;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 _type;                                             // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            _data;                                             // 0x0030(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	ESCSentryLevel                                Level;                                             // 0x0080(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SCSentry_AddBreadcrumbWithParams;

// Function SCSentry.SCSentry.CaptureMessage
// 0x0028 (0x0028 - 0x0000)
struct SCSentry_CaptureMessage final
{
public:
	class FString                                 _message;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 _logCategory;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESCSentryLevel                                _level;                                            // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SCSentry_CaptureMessage;

// Function SCSentry.SCSentry.RemoveTag
// 0x0010 (0x0010 - 0x0000)
struct SCSentry_RemoveTag final
{
public:
	class FString                                 _key;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SCSentry_RemoveTag;

// Function SCSentry.SCSentry.SetTag
// 0x0020 (0x0020 - 0x0000)
struct SCSentry_SetTag final
{
public:
	class FString                                 _key;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SCSentry_SetTag;

}

