#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SEQ_VictoryMood_Sound

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function SEQ_VictoryMood_Sound.SEQ_VictoryMood_Sound_DirectorBP_C.ExecuteUbergraph_SEQ_VictoryMood_Sound_DirectorBP
// 0x0030 (0x0030 - 0x0000)
struct SEQ_VictoryMood_Sound_DirectorBP_C_ExecuteUbergraph_SEQ_VictoryMood_Sound_DirectorBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0010(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          K2Node_CustomEvent_EventToPlay;                    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SEQ_VictoryMood_Sound_DirectorBP_C_ExecuteUbergraph_SEQ_VictoryMood_Sound_DirectorBP;

// Function SEQ_VictoryMood_Sound.SEQ_VictoryMood_Sound_DirectorBP_C.PostEventOnCam
// 0x0008 (0x0008 - 0x0000)
struct SEQ_VictoryMood_Sound_DirectorBP_C_PostEventOnCam final
{
public:
	class UAkAudioEvent*                          EventToPlay;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SEQ_VictoryMood_Sound_DirectorBP_C_PostEventOnCam;

}

