#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SingleTurnInPlaceSettings

#include "Basic.hpp"

#include "SCCore_structs.hpp"


namespace SDK
{

// UserDefinedStruct SingleTurnInPlaceSettings.SingleTurnInPlaceSettings
// 0x04D0 (0x04D0 - 0x0000)
struct FSingleTurnInPlaceSettings final
{
public:
	double                                        RotationAngle_11_9322F6044404F057D5F701ABE5684114; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSequencePlayInfos                 FromNeutralIdleToLeft_2_9A94124A4A61FFCD1F2E7CAE863FE1CB; // 0x0010(0x0130)(Edit, BlueprintVisible)
	struct FAnimSequencePlayInfos                 FromNeutralIdleToRight_4_6696A1E14D4E8532A543E39E59F3AFC1; // 0x0140(0x0130)(Edit, BlueprintVisible)
	struct FAnimSequencePlayInfos                 FromMirroredIdleToLeft_6_E921AB6D4E2ADFF45D73D7830433DC4D; // 0x0270(0x0130)(Edit, BlueprintVisible)
	struct FAnimSequencePlayInfos                 FromMirroredIdleToRight_8_C40D21AF439DAB174EF75B91D74F6539; // 0x03A0(0x0130)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_FSingleTurnInPlaceSettings;

}

