#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SOS

#include "Basic.hpp"

#include "SOS_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SOS.SOSActorComponent.BPF_SetSquadRematchType
// 0x0001 (0x0001 - 0x0000)
struct SOSActorComponent_BPF_SetSquadRematchType final
{
public:
	ESOSRematchType                               _eRematchType;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SOSActorComponent_BPF_SetSquadRematchType;

// Function SOS.SOSActorComponent.ClientJoinMatchVoiceChannel
// 0x0020 (0x0020 - 0x0000)
struct SOSActorComponent_ClientJoinMatchVoiceChannel final
{
public:
	class FString                                 _inChannelName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 _inChannelCredentials;                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SOSActorComponent_ClientJoinMatchVoiceChannel;

// Function SOS.SOSActorComponent.ClientUpdateFirstPartyRecentPlayers
// 0x0010 (0x0010 - 0x0000)
struct SOSActorComponent_ClientUpdateFirstPartyRecentPlayers final
{
public:
	TArray<class FString>                         _firstPartyUniqueIDs;                              // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SOSActorComponent_ClientUpdateFirstPartyRecentPlayers;

// Function SOS.SOSActorComponent.OnMatchResultReceived
// 0x00D8 (0x00D8 - 0x0000)
struct SOSActorComponent_OnMatchResultReceived final
{
public:
	struct FSOSRPCPlayerProgressUpdate            _progress;                                         // 0x0000(0x0060)(ConstParm, Parm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FSOSRPCPlayerRankingUpdate             _ranking;                                          // 0x0060(0x0074)(ConstParm, Parm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SOSActorComponent_OnMatchResultReceived;

// Function SOS.SOSActorComponent.RematchTicketID
// 0x0020 (0x0020 - 0x0000)
struct SOSActorComponent_RematchTicketID final
{
public:
	class FString                                 _ticketID;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              _ticketCreationTime;                               // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bIsSuccess;                                       // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bIscustomMatch;                                   // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SOSActorComponent_RematchTicketID;

// Function SOS.SOSActorComponent.ServerDebugMatchStatusOperation
// 0x0004 (0x0004 - 0x0000)
struct SOSActorComponent_ServerDebugMatchStatusOperation final
{
public:
	ESOSDebugMatchStatusOperation                 _eOperation;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SOSActorComponent_ServerDebugMatchStatusOperation;

// Function SOS.SOSActorComponent.ServerDebugSendMatchResults
// 0x0028 (0x0028 - 0x0000)
struct SOSActorComponent_ServerDebugSendMatchResults final
{
public:
	class FString                                 _gamemode;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 _playerId;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bHasWon;                                          // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        _uiExpGain;                                        // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SOSActorComponent_ServerDebugSendMatchResults;

// Function SOS.SOSActorComponent.ServerSetClientNetworkAnalytics
// 0x0038 (0x0038 - 0x0000)
struct SOSActorComponent_ServerSetClientNetworkAnalytics final
{
public:
	struct FSOSAnalyticsPlayerNetworkStats        _analytics;                                        // 0x0000(0x0038)(ConstParm, Parm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SOSActorComponent_ServerSetClientNetworkAnalytics;

// Function SOS.SOSActorComponent.ServerSetWantRematchForPlayers
// 0x0018 (0x0018 - 0x0000)
struct SOSActorComponent_ServerSetWantRematchForPlayers final
{
public:
	TArray<class FString>                         _players;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	ESOSRematchType                               _eRematchType;                                     // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SOSActorComponent_ServerSetWantRematchForPlayers;

// Function SOS.SOSActorComponent.BPF_CanControlRematch
// 0x0001 (0x0001 - 0x0000)
struct SOSActorComponent_BPF_CanControlRematch final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SOSActorComponent_BPF_CanControlRematch;

// Function SOS.SOSActorComponent.BPF_ShouldWarnAfkPlayer
// 0x0001 (0x0001 - 0x0000)
struct SOSActorComponent_BPF_ShouldWarnAfkPlayer final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SOSActorComponent_BPF_ShouldWarnAfkPlayer;

// Function SOS.SOSActorComponent.GetRematchType
// 0x0001 (0x0001 - 0x0000)
struct SOSActorComponent_GetRematchType final
{
public:
	ESOSRematchType                               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SOSActorComponent_GetRematchType;

}

