#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SOSBindings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SOS_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "StructUtils_structs.hpp"
#include "SOSBindings_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SOSBindings.AuthenticationViewImGui.OnSOSAuthenticationFinishedResult
// 0x0038 (0x0038 - 0x0000)
struct AuthenticationViewImGui_OnSOSAuthenticationFinishedResult final
{
public:
	bool                                          _bSuccess;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSOSErrorInfos                         _errorInfos;                                       // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuthenticationViewImGui_OnSOSAuthenticationFinishedResult;

// Function SOSBindings.CustomMatchProxy.BPF_AsyncCreateCustomMatch
// 0x0020 (0x0020 - 0x0000)
struct CustomMatchProxy_BPF_AsyncCreateCustomMatch final
{
public:
	struct FLatentActionInfo                      _inLatentInfo;                                     // 0x0000(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          _bOutSuccess;                                      // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CustomMatchProxy_BPF_AsyncCreateCustomMatch;

// Function SOSBindings.CustomMatchProxy.BPF_AsyncJoinCustomMatchFromPresence
// 0x0030 (0x0030 - 0x0000)
struct CustomMatchProxy_BPF_AsyncJoinCustomMatchFromPresence final
{
public:
	class FString                                 _cmInfo;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      _inLatentInfo;                                     // 0x0010(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          _bOutSuccess;                                      // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CustomMatchProxy_BPF_AsyncJoinCustomMatchFromPresence;

// Function SOSBindings.CustomMatchProxy.BPF_AsyncJoinThroughCode
// 0x0030 (0x0030 - 0x0000)
struct CustomMatchProxy_BPF_AsyncJoinThroughCode final
{
public:
	class FString                                 _code;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      _inLatentInfo;                                     // 0x0010(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          _bOutSuccess;                                      // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CustomMatchProxy_BPF_AsyncJoinThroughCode;

// Function SOSBindings.CustomMatchProxy.BPF_ChangeTeamEnum
// 0x0001 (0x0001 - 0x0000)
struct CustomMatchProxy_BPF_ChangeTeamEnum final
{
public:
	ESOSCustomMatchTeamId                         _teamId;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomMatchProxy_BPF_ChangeTeamEnum;

// Function SOSBindings.CustomMatchProxy.BPF_DebugForceJoinableState
// 0x0001 (0x0001 - 0x0000)
struct CustomMatchProxy_BPF_DebugForceJoinableState final
{
public:
	bool                                          _bIsJoinable;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomMatchProxy_BPF_DebugForceJoinableState;

// Function SOSBindings.CustomMatchProxy.BPF_InviteToCustomMatch
// 0x0030 (0x0030 - 0x0000)
struct CustomMatchProxy_BPF_InviteToCustomMatch final
{
public:
	struct FUniqueNetIdRepl                       _friendId;                                         // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomMatchProxy_BPF_InviteToCustomMatch;

// Function SOSBindings.CustomMatchProxy.BPF_KickPlayer
// 0x0030 (0x0030 - 0x0000)
struct CustomMatchProxy_BPF_KickPlayer final
{
public:
	struct FUniqueNetIdRepl                       _playerId;                                         // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomMatchProxy_BPF_KickPlayer;

// Function SOSBindings.CustomMatchProxy.BPF_PromotePlayer
// 0x0030 (0x0030 - 0x0000)
struct CustomMatchProxy_BPF_PromotePlayer final
{
public:
	struct FUniqueNetIdRepl                       _playerId;                                         // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomMatchProxy_BPF_PromotePlayer;

// Function SOSBindings.CustomMatchProxy.BPF_UpdateMaxSpectators
// 0x0004 (0x0004 - 0x0000)
struct CustomMatchProxy_BPF_UpdateMaxSpectators final
{
public:
	int32                                         _iMaxSpectators;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomMatchProxy_BPF_UpdateMaxSpectators;

// Function SOSBindings.CustomMatchProxy.BPF_UpdateTeamSize
// 0x0004 (0x0004 - 0x0000)
struct CustomMatchProxy_BPF_UpdateTeamSize final
{
public:
	int32                                         _iTeamSize;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomMatchProxy_BPF_UpdateTeamSize;

// Function SOSBindings.CustomMatchTeamViewModel.GetPlayerCount
// 0x0004 (0x0004 - 0x0000)
struct CustomMatchTeamViewModel_GetPlayerCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomMatchTeamViewModel_GetPlayerCount;

// Function SOSBindings.CustomMatchTeamViewModel.GetPlayerViewModel
// 0x0010 (0x0010 - 0x0000)
struct CustomMatchTeamViewModel_GetPlayerViewModel final
{
public:
	int32                                         _idx;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomMatchPlayerViewModel*            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomMatchTeamViewModel_GetPlayerViewModel;

// Function SOSBindings.CustomMatchParametersViewModel.BPE_UpdateFromMatchParams
// 0x0010 (0x0010 - 0x0000)
struct CustomMatchParametersViewModel_BPE_UpdateFromMatchParams final
{
public:
	struct FInstancedStruct                       _matchParams;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomMatchParametersViewModel_BPE_UpdateFromMatchParams;

// Function SOSBindings.CustomMatchParametersViewModel.BPE_GenerateMatchParams
// 0x0010 (0x0010 - 0x0000)
struct CustomMatchParametersViewModel_BPE_GenerateMatchParams final
{
public:
	struct FInstancedStruct                       ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomMatchParametersViewModel_BPE_GenerateMatchParams;

// Function SOSBindings.FriendsProxy.BPF_AcceptCrossPlayFriendInvite
// 0x0030 (0x0030 - 0x0000)
struct FriendsProxy_BPF_AcceptCrossPlayFriendInvite final
{
public:
	struct FUniqueNetIdRepl                       _playerId;                                         // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FriendsProxy_BPF_AcceptCrossPlayFriendInvite;

// Function SOSBindings.FriendsProxy.BPF_AddFriend
// 0x0030 (0x0030 - 0x0000)
struct FriendsProxy_BPF_AddFriend final
{
public:
	struct FUniqueNetIdRepl                       _playerId;                                         // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FriendsProxy_BPF_AddFriend;

// Function SOSBindings.FriendsProxy.BPF_AsyncReportPlayer
// 0x0060 (0x0060 - 0x0000)
struct FriendsProxy_BPF_AsyncReportPlayer final
{
public:
	struct FUniqueNetIdRepl                       _playerId;                                         // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<ESOSPlayerReportReason>                _reasons;                                          // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      _inLatentInfo;                                     // 0x0040(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          _bOutSuccess;                                      // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FriendsProxy_BPF_AsyncReportPlayer;

// Function SOSBindings.FriendsProxy.BPF_BlockPlayer
// 0x0030 (0x0030 - 0x0000)
struct FriendsProxy_BPF_BlockPlayer final
{
public:
	struct FUniqueNetIdRepl                       _playerId;                                         // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FriendsProxy_BPF_BlockPlayer;

// Function SOSBindings.FriendsProxy.BPF_IsFriend
// 0x0038 (0x0038 - 0x0000)
struct FriendsProxy_BPF_IsFriend final
{
public:
	struct FUniqueNetIdRepl                       _playerId;                                         // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FriendsProxy_BPF_IsFriend;

// Function SOSBindings.FriendsProxy.BPF_IsPlayerBlocked
// 0x0038 (0x0038 - 0x0000)
struct FriendsProxy_BPF_IsPlayerBlocked final
{
public:
	struct FUniqueNetIdRepl                       _playerId;                                         // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FriendsProxy_BPF_IsPlayerBlocked;

// Function SOSBindings.FriendsProxy.BPF_RejectCrossPlayFriendInvite
// 0x0030 (0x0030 - 0x0000)
struct FriendsProxy_BPF_RejectCrossPlayFriendInvite final
{
public:
	struct FUniqueNetIdRepl                       _playerId;                                         // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FriendsProxy_BPF_RejectCrossPlayFriendInvite;

// Function SOSBindings.FriendsProxy.BPF_RemoveFriend
// 0x0030 (0x0030 - 0x0000)
struct FriendsProxy_BPF_RemoveFriend final
{
public:
	struct FUniqueNetIdRepl                       _playerId;                                         // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FriendsProxy_BPF_RemoveFriend;

// Function SOSBindings.FriendsProxy.BPF_SendCrossplayFriendInviteFromCode
// 0x0030 (0x0030 - 0x0000)
struct FriendsProxy_BPF_SendCrossplayFriendInviteFromCode final
{
public:
	class FString                                 _code;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      _inLatentInfo;                                     // 0x0010(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          _bOutSuccess;                                      // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FriendsProxy_BPF_SendCrossplayFriendInviteFromCode;

// Function SOSBindings.FriendsProxy.BPF_SetFriendsPanelOpen
// 0x0001 (0x0001 - 0x0000)
struct FriendsProxy_BPF_SetFriendsPanelOpen final
{
public:
	bool                                          _bOpen;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FriendsProxy_BPF_SetFriendsPanelOpen;

// Function SOSBindings.FriendsProxy.BPF_ShowUserProfile
// 0x0030 (0x0030 - 0x0000)
struct FriendsProxy_BPF_ShowUserProfile final
{
public:
	struct FUniqueNetIdRepl                       _playerId;                                         // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FriendsProxy_BPF_ShowUserProfile;

// Function SOSBindings.FriendsProxy.BPF_UnblockPlayer
// 0x0030 (0x0030 - 0x0000)
struct FriendsProxy_BPF_UnblockPlayer final
{
public:
	struct FUniqueNetIdRepl                       _playerId;                                         // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FriendsProxy_BPF_UnblockPlayer;

// Function SOSBindings.FriendsProxy.BPF_GetFriendAvatarItemId
// 0x0040 (0x0040 - 0x0000)
struct FriendsProxy_BPF_GetFriendAvatarItemId final
{
public:
	struct FUniqueNetIdRepl                       _playerId;                                         // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FriendsProxy_BPF_GetFriendAvatarItemId;

// Function SOSBindings.FriendSystemViewModel.GetFriendCount
// 0x0004 (0x0004 - 0x0000)
struct FriendSystemViewModel_GetFriendCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FriendSystemViewModel_GetFriendCount;

// Function SOSBindings.FriendSystemViewModel.GetFriendViewModel
// 0x0010 (0x0010 - 0x0000)
struct FriendSystemViewModel_GetFriendViewModel final
{
public:
	int32                                         _idx;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFriendViewModel*                       ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FriendSystemViewModel_GetFriendViewModel;

// Function SOSBindings.FriendSystemViewModel.GetInboundCrossplayFriendInviteViewModel
// 0x0010 (0x0010 - 0x0000)
struct FriendSystemViewModel_GetInboundCrossplayFriendInviteViewModel final
{
public:
	int32                                         _idx;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCrossplayFriendInviteViewModel*        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FriendSystemViewModel_GetInboundCrossplayFriendInviteViewModel;

// Function SOSBindings.FriendSystemViewModel.GetInboundFriendInviteCount
// 0x0004 (0x0004 - 0x0000)
struct FriendSystemViewModel_GetInboundFriendInviteCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FriendSystemViewModel_GetInboundFriendInviteCount;

// Function SOSBindings.PartyProxy.BPF_AcceptPartyInvite
// 0x0010 (0x0010 - 0x0000)
struct PartyProxy_BPF_AcceptPartyInvite final
{
public:
	struct FGuid                                  _inviteGuid;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PartyProxy_BPF_AcceptPartyInvite;

// Function SOSBindings.PartyProxy.BPF_DebugForceJoinableState
// 0x0001 (0x0001 - 0x0000)
struct PartyProxy_BPF_DebugForceJoinableState final
{
public:
	bool                                          _bIsJoinable;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PartyProxy_BPF_DebugForceJoinableState;

// Function SOSBindings.PartyProxy.BPF_GetBaseSocialUserViewModelFromEosId
// 0x0018 (0x0018 - 0x0000)
struct PartyProxy_BPF_GetBaseSocialUserViewModelFromEosId final
{
public:
	class FString                                 _eosId;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBaseSocialUserViewModel*               ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PartyProxy_BPF_GetBaseSocialUserViewModelFromEosId;

// Function SOSBindings.PartyProxy.BPF_GetCustomMatchPlayerViewModelFromEosId
// 0x0018 (0x0018 - 0x0000)
struct PartyProxy_BPF_GetCustomMatchPlayerViewModelFromEosId final
{
public:
	class FString                                 _eosId;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCustomMatchPlayerViewModel*            ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PartyProxy_BPF_GetCustomMatchPlayerViewModelFromEosId;

// Function SOSBindings.PartyProxy.BPF_GetFriendViewModelFromEosId
// 0x0018 (0x0018 - 0x0000)
struct PartyProxy_BPF_GetFriendViewModelFromEosId final
{
public:
	class FString                                 _eosId;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFriendViewModel*                       ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PartyProxy_BPF_GetFriendViewModelFromEosId;

// Function SOSBindings.PartyProxy.BPF_GetRecentPlayerViewModelFromEosId
// 0x0018 (0x0018 - 0x0000)
struct PartyProxy_BPF_GetRecentPlayerViewModelFromEosId final
{
public:
	class FString                                 _eosId;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URecentPlayerViewModel*                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PartyProxy_BPF_GetRecentPlayerViewModelFromEosId;

// Function SOSBindings.PartyProxy.BPF_InviteToParty
// 0x0030 (0x0030 - 0x0000)
struct PartyProxy_BPF_InviteToParty final
{
public:
	struct FUniqueNetIdRepl                       _playerId;                                         // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PartyProxy_BPF_InviteToParty;

// Function SOSBindings.PartyProxy.BPF_JoinPartyFromPresence
// 0x0010 (0x0010 - 0x0000)
struct PartyProxy_BPF_JoinPartyFromPresence final
{
public:
	class FString                                 _partyInfo;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PartyProxy_BPF_JoinPartyFromPresence;

// Function SOSBindings.PartyProxy.BPF_KickPartyMember
// 0x0030 (0x0030 - 0x0000)
struct PartyProxy_BPF_KickPartyMember final
{
public:
	struct FUniqueNetIdRepl                       _playerId;                                         // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PartyProxy_BPF_KickPartyMember;

// Function SOSBindings.PartyProxy.BPF_PromotePartyMember
// 0x0030 (0x0030 - 0x0000)
struct PartyProxy_BPF_PromotePartyMember final
{
public:
	struct FUniqueNetIdRepl                       _playerId;                                         // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PartyProxy_BPF_PromotePartyMember;

// Function SOSBindings.PartyProxy.BPF_RejectPartyInvite
// 0x0010 (0x0010 - 0x0000)
struct PartyProxy_BPF_RejectPartyInvite final
{
public:
	struct FGuid                                  _inviteGuid;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PartyProxy_BPF_RejectPartyInvite;

// Function SOSBindings.PartyProxy.BPF_SetTestFlag
// 0x0008 (0x0008 - 0x0000)
struct PartyProxy_BPF_SetTestFlag final
{
public:
	int32                                         _flag;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _Value;                                            // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PartyProxy_BPF_SetTestFlag;

// Function SOSBindings.PartySystemViewModel.GetInboundPartyInviteCount
// 0x0004 (0x0004 - 0x0000)
struct PartySystemViewModel_GetInboundPartyInviteCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PartySystemViewModel_GetInboundPartyInviteCount;

// Function SOSBindings.PartySystemViewModel.GetInboundPartyInviteViewModel
// 0x0010 (0x0010 - 0x0000)
struct PartySystemViewModel_GetInboundPartyInviteViewModel final
{
public:
	int32                                         _idx;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPartyInviteViewModel*                  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PartySystemViewModel_GetInboundPartyInviteViewModel;

// Function SOSBindings.PartySystemViewModel.GetPartyMemberCount
// 0x0004 (0x0004 - 0x0000)
struct PartySystemViewModel_GetPartyMemberCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PartySystemViewModel_GetPartyMemberCount;

// Function SOSBindings.PartySystemViewModel.GetPartyMemberViewModel
// 0x0010 (0x0010 - 0x0000)
struct PartySystemViewModel_GetPartyMemberViewModel final
{
public:
	int32                                         _idx;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPartyMemberViewModel*                  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PartySystemViewModel_GetPartyMemberViewModel;

// Function SOSBindings.PartySystemViewModel.IsInSquad
// 0x0001 (0x0001 - 0x0000)
struct PartySystemViewModel_IsInSquad final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PartySystemViewModel_IsInSquad;

// Function SOSBindings.PlayerProfileProxy.BPF_QueryFriendPublicPlayerProfile
// 0x0010 (0x0010 - 0x0000)
struct PlayerProfileProxy_BPF_QueryFriendPublicPlayerProfile final
{
public:
	class FString                                 _eosPlayerID;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayerProfileProxy_BPF_QueryFriendPublicPlayerProfile;

// Function SOSBindings.PlayerProfileProxy.BPF_QueryRecentPlayerPublicPlayerProfile
// 0x0010 (0x0010 - 0x0000)
struct PlayerProfileProxy_BPF_QueryRecentPlayerPublicPlayerProfile final
{
public:
	class FString                                 _eosPlayerID;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayerProfileProxy_BPF_QueryRecentPlayerPublicPlayerProfile;

// Function SOSBindings.PlayerProfileProxy.HandleSOSAuthenticated
// 0x0001 (0x0001 - 0x0000)
struct PlayerProfileProxy_HandleSOSAuthenticated final
{
public:
	bool                                          _bSuccess;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayerProfileProxy_HandleSOSAuthenticated;

// Function SOSBindings.QoSProxy.BPF_GetAvailableRegions
// 0x0010 (0x0010 - 0x0000)
struct QoSProxy_BPF_GetAvailableRegions final
{
public:
	TArray<class UQoSRegionViewModel*>            ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QoSProxy_BPF_GetAvailableRegions;

// Function SOSBindings.QoSProxy.BPF_SetChosenRegion
// 0x0010 (0x0010 - 0x0000)
struct QoSProxy_BPF_SetChosenRegion final
{
public:
	class FString                                 _regionId;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QoSProxy_BPF_SetChosenRegion;

// Function SOSBindings.QoSViewModel.GetRegionCount
// 0x0004 (0x0004 - 0x0000)
struct QoSViewModel_GetRegionCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QoSViewModel_GetRegionCount;

// Function SOSBindings.QoSViewModel.GetRegionViewModel
// 0x0010 (0x0010 - 0x0000)
struct QoSViewModel_GetRegionViewModel final
{
public:
	int32                                         _idx;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UQoSRegionViewModel*                    ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QoSViewModel_GetRegionViewModel;

// Function SOSBindings.RecentPlayersSystemViewModel.GetRecentPlayerCount
// 0x0004 (0x0004 - 0x0000)
struct RecentPlayersSystemViewModel_GetRecentPlayerCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RecentPlayersSystemViewModel_GetRecentPlayerCount;

// Function SOSBindings.RecentPlayersSystemViewModel.GetRecentPlayerViewModel
// 0x0010 (0x0010 - 0x0000)
struct RecentPlayersSystemViewModel_GetRecentPlayerViewModel final
{
public:
	int32                                         _iPlayerIndex;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URecentPlayerViewModel*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RecentPlayersSystemViewModel_GetRecentPlayerViewModel;

// Function SOSBindings.SOSAvailableFeaturesProxy.BPF_IsCrossplayEnabled
// 0x0001 (0x0001 - 0x0000)
struct SOSAvailableFeaturesProxy_BPF_IsCrossplayEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SOSAvailableFeaturesProxy_BPF_IsCrossplayEnabled;

// Function SOSBindings.SOSAvailableFeaturesProxy.BPF_MustDisplayCrossplayOptionInSettings
// 0x0001 (0x0001 - 0x0000)
struct SOSAvailableFeaturesProxy_BPF_MustDisplayCrossplayOptionInSettings final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SOSAvailableFeaturesProxy_BPF_MustDisplayCrossplayOptionInSettings;

// Function SOSBindings.SOSBindingsHelpersLibrary.BPF_IsLocalPlayer
// 0x0038 (0x0038 - 0x0000)
struct SOSBindingsHelpersLibrary_BPF_IsLocalPlayer final
{
public:
	struct FUniqueNetIdRepl                       _playerId;                                         // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SOSBindingsHelpersLibrary_BPF_IsLocalPlayer;

// Function SOSBindings.SOSBindingsSubsystem.BPF_GetServerCompatibilityKey
// 0x0010 (0x0010 - 0x0000)
struct SOSBindingsSubsystem_BPF_GetServerCompatibilityKey final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SOSBindingsSubsystem_BPF_GetServerCompatibilityKey;

// Function SOSBindings.SOSBindingsSubsystem.BPF_GetSOSVersion
// 0x0010 (0x0010 - 0x0000)
struct SOSBindingsSubsystem_BPF_GetSOSVersion final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SOSBindingsSubsystem_BPF_GetSOSVersion;

// Function SOSBindings.SOSBindingsSubsystem.BPF_GotoToMatchState
// 0x0004 (0x0004 - 0x0000)
struct SOSBindingsSubsystem_BPF_GotoToMatchState final
{
public:
	int32                                         _iLevelIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SOSBindingsSubsystem_BPF_GotoToMatchState;

// Function SOSBindings.SOSBindingsSubsystem.execTriggerSOSError
// 0x000C (0x000C - 0x0000)
struct SOSBindingsSubsystem_execTriggerSOSError final
{
public:
	class FName                                   _errorName;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bIsFatal;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SOSBindingsSubsystem_execTriggerSOSError;

// Function SOSBindings.SOSBindingsSubsystem.GetAvailableClientApiClass
// 0x0010 (0x0010 - 0x0000)
struct SOSBindingsSubsystem_GetAvailableClientApiClass final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SOSBindingsSubsystem_GetAvailableClientApiClass;

// Function SOSBindings.SOSBindingsSubsystem.GetAvailableServerApiClass
// 0x0010 (0x0010 - 0x0000)
struct SOSBindingsSubsystem_GetAvailableServerApiClass final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SOSBindingsSubsystem_GetAvailableServerApiClass;

// Function SOSBindings.SOSBindingsSubsystem.OnSOSAuthenticationFinishedResult
// 0x0038 (0x0038 - 0x0000)
struct SOSBindingsSubsystem_OnSOSAuthenticationFinishedResult final
{
public:
	bool                                          _bSuccess;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSOSErrorInfos                         _errorInfos;                                       // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SOSBindingsSubsystem_OnSOSAuthenticationFinishedResult;

// Function SOSBindings.SOSBindingsSubsystem.BPF_GetServicesViewModelProxy
// 0x0010 (0x0010 - 0x0000)
struct SOSBindingsSubsystem_BPF_GetServicesViewModelProxy final
{
public:
	ESOSService                                   _eType;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UModelProxy*                            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SOSBindingsSubsystem_BPF_GetServicesViewModelProxy;

// Function SOSBindings.SOSBindingsSubsystem.BPF_GetStateContainingMatchMap
// 0x0008 (0x0008 - 0x0000)
struct SOSBindingsSubsystem_BPF_GetStateContainingMatchMap final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SOSBindingsSubsystem_BPF_GetStateContainingMatchMap;

// Function SOSBindings.SOSBindingsSubsystem.BPF_HasPendingLogout
// 0x0001 (0x0001 - 0x0000)
struct SOSBindingsSubsystem_BPF_HasPendingLogout final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SOSBindingsSubsystem_BPF_HasPendingLogout;

// Function SOSBindings.StoreProxy.BPF_AddHardCurrency
// 0x0004 (0x0004 - 0x0000)
struct StoreProxy_BPF_AddHardCurrency final
{
public:
	int32                                         _amount;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StoreProxy_BPF_AddHardCurrency;

// Function SOSBindings.StoreProxy.BPF_AddPremiumSeasonPassToken
// 0x0004 (0x0004 - 0x0000)
struct StoreProxy_BPF_AddPremiumSeasonPassToken final
{
public:
	int32                                         _amount;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StoreProxy_BPF_AddPremiumSeasonPassToken;

// Function SOSBindings.StoreProxy.BPF_AddSeasonCurrency
// 0x0004 (0x0004 - 0x0000)
struct StoreProxy_BPF_AddSeasonCurrency final
{
public:
	int32                                         _amount;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StoreProxy_BPF_AddSeasonCurrency;

// Function SOSBindings.StoreProxy.BPF_AddSoftCurrency
// 0x0004 (0x0004 - 0x0000)
struct StoreProxy_BPF_AddSoftCurrency final
{
public:
	int32                                         _amount;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StoreProxy_BPF_AddSoftCurrency;

// Function SOSBindings.StoreProxy.BPF_BuyEntitlement
// 0x0010 (0x0010 - 0x0000)
struct StoreProxy_BPF_BuyEntitlement final
{
public:
	class FString                                 _entitlementID;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StoreProxy_BPF_BuyEntitlement;

// Function SOSBindings.StoreProxy.BPF_BuyItem
// 0x0010 (0x0010 - 0x0000)
struct StoreProxy_BPF_BuyItem final
{
public:
	class FString                                 _itemID;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StoreProxy_BPF_BuyItem;

// Function SOSBindings.StoreProxy.BPF_BuyItemHardCurrency
// 0x0010 (0x0010 - 0x0000)
struct StoreProxy_BPF_BuyItemHardCurrency final
{
public:
	class FString                                 _itemID;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StoreProxy_BPF_BuyItemHardCurrency;

// Function SOSBindings.StoreProxy.BPF_BuyItemSoftCurrency
// 0x0010 (0x0010 - 0x0000)
struct StoreProxy_BPF_BuyItemSoftCurrency final
{
public:
	class FString                                 _itemID;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StoreProxy_BPF_BuyItemSoftCurrency;

// Function SOSBindings.StoreProxy.BPF_BuySeasonPremium
// 0x0001 (0x0001 - 0x0000)
struct StoreProxy_BPF_BuySeasonPremium final
{
public:
	bool                                          _bUseDebug;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StoreProxy_BPF_BuySeasonPremium;

// Function SOSBindings.StoreProxy.BPF_BuySeasonPremiumUsingPremiumSeasonPassToken
// 0x0001 (0x0001 - 0x0000)
struct StoreProxy_BPF_BuySeasonPremiumUsingPremiumSeasonPassToken final
{
public:
	bool                                          _bUseDebug;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StoreProxy_BPF_BuySeasonPremiumUsingPremiumSeasonPassToken;

// Function SOSBindings.StoreProxy.BPF_BuySeasonSlot
// 0x0008 (0x0008 - 0x0000)
struct StoreProxy_BPF_BuySeasonSlot final
{
public:
	int32                                         _iTierID;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bUseDebug;                                        // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_StoreProxy_BPF_BuySeasonSlot;

// Function SOSBindings.StoreProxy.BPF_BuySeasonTier
// 0x0008 (0x0008 - 0x0000)
struct StoreProxy_BPF_BuySeasonTier final
{
public:
	int32                                         _iTierID;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _bUseDebug;                                        // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_StoreProxy_BPF_BuySeasonTier;

// Function SOSBindings.StoreProxy.BPF_ForceRefreshSeasonPass
// 0x0010 (0x0010 - 0x0000)
struct StoreProxy_BPF_ForceRefreshSeasonPass final
{
public:
	class FString                                 _seasonID;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StoreProxy_BPF_ForceRefreshSeasonPass;

// Function SOSBindings.StoreProxy.BPF_GetRankedRewardsForSpecificSeasonFilteredByRank
// 0x0030 (0x0030 - 0x0000)
struct StoreProxy_BPF_GetRankedRewardsForSpecificSeasonFilteredByRank final
{
public:
	class FString                                 _gamemode;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         _iSeasonID;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         _iLeagueIdx;                                       // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         _iDivIdx;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USOSRankedRewardViewModel*>      _outResult;                                        // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StoreProxy_BPF_GetRankedRewardsForSpecificSeasonFilteredByRank;

// Function SOSBindings.StoreProxy.HandleSOSAuthenticated
// 0x0001 (0x0001 - 0x0000)
struct StoreProxy_HandleSOSAuthenticated final
{
public:
	bool                                          _bSuccess;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StoreProxy_HandleSOSAuthenticated;

// Function SOSBindings.SOSBindingsStoreItemViewModel.IsAR
// 0x0001 (0x0001 - 0x0000)
struct SOSBindingsStoreItemViewModel_IsAR final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SOSBindingsStoreItemViewModel_IsAR;

// Function SOSBindings.StoreViewModel.GetAllItems
// 0x0010 (0x0010 - 0x0000)
struct StoreViewModel_GetAllItems final
{
public:
	TArray<class USOSBindingsStoreItemViewModel*> ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StoreViewModel_GetAllItems;

// Function SOSBindings.StoreViewModel.IsInInterSeason
// 0x0001 (0x0001 - 0x0000)
struct StoreViewModel_IsInInterSeason final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StoreViewModel_IsInInterSeason;

// Function SOSBindings.VoiceChatProxy.BPF_SetInputDevice
// 0x0010 (0x0010 - 0x0000)
struct VoiceChatProxy_BPF_SetInputDevice final
{
public:
	class FString                                 _deviceID;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatProxy_BPF_SetInputDevice;

// Function SOSBindings.VoiceChatProxy.BPF_SetOutputVolume
// 0x0004 (0x0004 - 0x0000)
struct VoiceChatProxy_BPF_SetOutputVolume final
{
public:
	float                                         _volume;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatProxy_BPF_SetOutputVolume;

// Function SOSBindings.VoiceChatProxy.BPF_ToggleMutePlayer
// 0x0030 (0x0030 - 0x0000)
struct VoiceChatProxy_BPF_ToggleMutePlayer final
{
public:
	struct FUniqueNetIdRepl                       _playerId;                                         // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatProxy_BPF_ToggleMutePlayer;

// Function SOSBindings.VoiceChannelViewModel.GetVoiceChannelMemberCount
// 0x0004 (0x0004 - 0x0000)
struct VoiceChannelViewModel_GetVoiceChannelMemberCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChannelViewModel_GetVoiceChannelMemberCount;

// Function SOSBindings.VoiceChannelViewModel.GetVoiceChannelMemberViewModel
// 0x0010 (0x0010 - 0x0000)
struct VoiceChannelViewModel_GetVoiceChannelMemberViewModel final
{
public:
	int32                                         _idx;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoiceChannelMemberViewModel*           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChannelViewModel_GetVoiceChannelMemberViewModel;

// Function SOSBindings.VoiceChannelViewModel.GetVoiceChannelMemberViewModelByUniqueID
// 0x0038 (0x0038 - 0x0000)
struct VoiceChannelViewModel_GetVoiceChannelMemberViewModelByUniqueID final
{
public:
	struct FUniqueNetIdRepl                       _uniqueID;                                         // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVoiceChannelMemberViewModel*           ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChannelViewModel_GetVoiceChannelMemberViewModelByUniqueID;

// Function SOSBindings.VoiceChatViewModel.GetJoinedChannelsCount
// 0x0004 (0x0004 - 0x0000)
struct VoiceChatViewModel_GetJoinedChannelsCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatViewModel_GetJoinedChannelsCount;

// Function SOSBindings.VoiceChatViewModel.GetJoinedChannelViewModel
// 0x0010 (0x0010 - 0x0000)
struct VoiceChatViewModel_GetJoinedChannelViewModel final
{
public:
	int32                                         _idx;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoiceChannelViewModel*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatViewModel_GetJoinedChannelViewModel;

// Function SOSBindings.VoiceChatViewModel.GetVoiceInputDeviceCount
// 0x0004 (0x0004 - 0x0000)
struct VoiceChatViewModel_GetVoiceInputDeviceCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatViewModel_GetVoiceInputDeviceCount;

// Function SOSBindings.VoiceChatViewModel.GetVoiceInputDeviceViewModel
// 0x0010 (0x0010 - 0x0000)
struct VoiceChatViewModel_GetVoiceInputDeviceViewModel final
{
public:
	int32                                         _idx;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoiceInputDeviceViewModel*             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatViewModel_GetVoiceInputDeviceViewModel;

// Function SOSBindings.VoiceChatViewModel.IsEnabled
// 0x0001 (0x0001 - 0x0000)
struct VoiceChatViewModel_IsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoiceChatViewModel_IsEnabled;

}

