#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SOSBindings

#include "Basic.hpp"

#include "SOSBindings_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "SOS_structs.hpp"
#include "SCCore_structs.hpp"
#include "SCCore_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class SOSBindings.ModelProxy
// 0x0018 (0x0040 - 0x0028)
class UModelProxy : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ModelProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ModelProxy")
	}
	static class UModelProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModelProxy>();
	}
};
DUMPER7_ASSERTS_UModelProxy;

// Class SOSBindings.AuthenticationProxy
// 0x0060 (0x00A0 - 0x0040)
class UAuthenticationProxy final : public UModelProxy
{
public:
	TMulticastInlineDelegate<void(bool _bSuccess)> OnAuthenticationFinished;                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool _bSucces, const struct FSOSErrorInfos& _errorInfos)> OnAuthenticationFinishedResult; // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x10];                                      // 0x0060(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool _bSuccess)> OnLogoutFinished;                                 // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_80[0x10];                                      // 0x0080(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UAuthenticationViewModel*               m_ViewModel;                                       // 0x0090(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USOSBindingsSubsystem*                  m_Subsystem;                                       // 0x0098(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void BPF_Authenticate();
	void BPF_Logout();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuthenticationProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuthenticationProxy")
	}
	static class UAuthenticationProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuthenticationProxy>();
	}
};
DUMPER7_ASSERTS_UAuthenticationProxy;

// Class SOSBindings.ViewImGuiBase
// 0x0000 (0x0028 - 0x0028)
class UViewImGuiBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ViewImGuiBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ViewImGuiBase")
	}
	static class UViewImGuiBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UViewImGuiBase>();
	}
};
DUMPER7_ASSERTS_UViewImGuiBase;

// Class SOSBindings.AuthenticationViewImGui
// 0x0010 (0x0038 - 0x0028)
class UAuthenticationViewImGui final : public UViewImGuiBase
{
public:
	class UAuthenticationProxy*                   m_ModelProxy;                                      // 0x0028(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAuthenticationViewModel*               m_ViewModel;                                       // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void OnSOSAuthenticationFinishedResult(bool _bSuccess, const struct FSOSErrorInfos& _errorInfos);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuthenticationViewImGui")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuthenticationViewImGui")
	}
	static class UAuthenticationViewImGui* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuthenticationViewImGui>();
	}
};
DUMPER7_ASSERTS_UAuthenticationViewImGui;

// Class SOSBindings.AuthenticationViewModel
// 0x0050 (0x00C0 - 0x0070)
class UAuthenticationViewModel : public USCViewModel
{
public:
	ESOSAuthenticationState                       m_eAuthenticationState;                            // 0x0070(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESOSFrontendConnectionState                   m_eFrontendConnectionState;                        // 0x0071(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bLoginFailed;                                    // 0x0072(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bConnectedToInventoryService;                    // 0x0073(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 m_CrossplayFriendCode;                             // 0x0078(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 m_FirstPartyUserID;                                // 0x0088(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 m_SOSPlayerIdID;                                   // 0x0098(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 m_SOSStage;                                        // 0x00A8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bMatchDisconnectIsPenalized;                     // 0x00B8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuthenticationViewModel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuthenticationViewModel")
	}
	static class UAuthenticationViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuthenticationViewModel>();
	}
};
DUMPER7_ASSERTS_UAuthenticationViewModel;

// Class SOSBindings.BaseSocialUserViewModel
// 0x0048 (0x00B8 - 0x0070)
class UBaseSocialUserViewModel : public USCViewModel
{
public:
	struct FUniqueNetIdRepl                       m_UniqueNetID;                                     // 0x0070(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 m_DisplayName;                                     // 0x00A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESOSFirstParty                                m_FirstParty;                                      // 0x00B0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bIsCrossplay;                                    // 0x00B1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseSocialUserViewModel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseSocialUserViewModel")
	}
	static class UBaseSocialUserViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseSocialUserViewModel>();
	}
};
DUMPER7_ASSERTS_UBaseSocialUserViewModel;

// Class SOSBindings.BlockedPlayersProxy
// 0x0028 (0x0068 - 0x0040)
class UBlockedPlayersProxy final : public UModelProxy
{
public:
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlockedPlayersSystemViewModel*         m_ViewModel;                                       // 0x0058(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USOSBindingsSubsystem*                  m_Subsystem;                                       // 0x0060(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BlockedPlayersProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BlockedPlayersProxy")
	}
	static class UBlockedPlayersProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlockedPlayersProxy>();
	}
};
DUMPER7_ASSERTS_UBlockedPlayersProxy;

// Class SOSBindings.BlockedPlayersSystemViewModel
// 0x0020 (0x0090 - 0x0070)
class UBlockedPlayersSystemViewModel : public USCViewModel
{
public:
	TArray<class UBaseSocialUserViewModel*>       m_CrossplayBlockedPlayers;                         // 0x0070(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)
	TArray<struct FUniqueNetIdRepl>               m_FirstPartyBlockedPlayers;                        // 0x0080(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BlockedPlayersSystemViewModel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BlockedPlayersSystemViewModel")
	}
	static class UBlockedPlayersSystemViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlockedPlayersSystemViewModel>();
	}
};
DUMPER7_ASSERTS_UBlockedPlayersSystemViewModel;

// Class SOSBindings.BlockedPlayersViewImGui
// 0x0018 (0x0040 - 0x0028)
class UBlockedPlayersViewImGui final : public UViewImGuiBase
{
public:
	class UBlockedPlayersProxy*                   m_ModelProxy;                                      // 0x0028(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBlockedPlayersSystemViewModel*         m_ViewModel;                                       // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFriendsProxy*                          m_FriendsProxy;                                    // 0x0038(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BlockedPlayersViewImGui")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BlockedPlayersViewImGui")
	}
	static class UBlockedPlayersViewImGui* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlockedPlayersViewImGui>();
	}
};
DUMPER7_ASSERTS_UBlockedPlayersViewImGui;

// Class SOSBindings.CustomMatchProxy
// 0x00A0 (0x00E0 - 0x0040)
class UCustomMatchProxy final : public UModelProxy
{
public:
	TMulticastInlineDelegate<void(const struct FGameSessionPlacementResult& placementResult)> OnGameSessionPlacementEvent; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x18];                                      // 0x0050(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomMatchSystemViewModel*            m_ViewModel;                                       // 0x0068(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USOSBindingsSubsystem*                  m_Subsystem;                                       // 0x0070(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x68];                                      // 0x0078(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BPF_AsyncCreateCustomMatch(const struct FLatentActionInfo& _inLatentInfo, bool* _bOutSuccess);
	void BPF_AsyncJoinCustomMatchFromPresence(const class FString& _cmInfo, const struct FLatentActionInfo& _inLatentInfo, bool* _bOutSuccess);
	void BPF_AsyncJoinThroughCode(const class FString& _code, const struct FLatentActionInfo& _inLatentInfo, bool* _bOutSuccess);
	void BPF_ChangeTeamEnum(ESOSCustomMatchTeamId _teamId);
	void BPF_CreateJoinCode();
	void BPF_DebugForceJoinableState(bool _bIsJoinable);
	void BPF_InviteToCustomMatch(const struct FUniqueNetIdRepl& _friendId);
	void BPF_KickPlayer(const struct FUniqueNetIdRepl& _playerId);
	void BPF_LeaveCustomMatch();
	void BPF_PromotePlayer(const struct FUniqueNetIdRepl& _playerId);
	void BPF_StartCustomMatch();
	void BPF_UpdateMaxSpectators(int32 _iMaxSpectators);
	void BPF_UpdateTeamSize(int32 _iTeamSize);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CustomMatchProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CustomMatchProxy")
	}
	static class UCustomMatchProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomMatchProxy>();
	}
};
DUMPER7_ASSERTS_UCustomMatchProxy;

// Class SOSBindings.CustomMatchPlayerViewModel
// 0x0060 (0x0118 - 0x00B8)
class UCustomMatchPlayerViewModel : public UBaseSocialUserViewModel
{
public:
	bool                                          m_bIsLobbyLeader;                                  // 0x00B8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 m_FirstPartyData;                                  // 0x00C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 m_FrontendConnectionMetadata;                      // 0x00D0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bIsInMatch;                                      // 0x00E0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bIsLeaver;                                       // 0x00E1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bIsReconnectingToRanked;                         // 0x00E2(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E3[0x5];                                       // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 m_AvatarItemId;                                    // 0x00E8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 m_BannerItemId;                                    // 0x00F8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 m_TitleItemId;                                     // 0x0108(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CustomMatchPlayerViewModel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CustomMatchPlayerViewModel")
	}
	static class UCustomMatchPlayerViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomMatchPlayerViewModel>();
	}
};
DUMPER7_ASSERTS_UCustomMatchPlayerViewModel;

// Class SOSBindings.CustomMatchTeamViewModel
// 0x0018 (0x0088 - 0x0070)
class UCustomMatchTeamViewModel : public USCViewModel
{
public:
	ESOSCustomMatchTeamId                         m_eTeamId;                                         // 0x0070(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCustomMatchPlayerViewModel*>    m_Players;                                         // 0x0078(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)

public:
	int32 GetPlayerCount() const;
	class UCustomMatchPlayerViewModel* GetPlayerViewModel(int32 _idx) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CustomMatchTeamViewModel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CustomMatchTeamViewModel")
	}
	static class UCustomMatchTeamViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomMatchTeamViewModel>();
	}
};
DUMPER7_ASSERTS_UCustomMatchTeamViewModel;

// Class SOSBindings.CustomMatchLobbySizeParametersViewModel
// 0x0028 (0x0098 - 0x0070)
class UCustomMatchLobbySizeParametersViewModel final : public USCViewModel
{
public:
	int32                                         m_iMaxSpectators;                                  // 0x0070(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FInt32Range                            m_ValidValuesMaxSpectators;                        // 0x0074(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         m_iTeamSize;                                       // 0x0084(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FInt32Range                            m_ValidValuesTeamSize;                             // 0x0088(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CustomMatchLobbySizeParametersViewModel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CustomMatchLobbySizeParametersViewModel")
	}
	static class UCustomMatchLobbySizeParametersViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomMatchLobbySizeParametersViewModel>();
	}
};
DUMPER7_ASSERTS_UCustomMatchLobbySizeParametersViewModel;

// Class SOSBindings.CustomMatchParametersViewModel
// 0x0000 (0x0070 - 0x0070)
class UCustomMatchParametersViewModel : public USCViewModel
{
public:
	void BPE_UpdateFromMatchParams(const struct FInstancedStruct& _matchParams);

	struct FInstancedStruct BPE_GenerateMatchParams() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CustomMatchParametersViewModel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CustomMatchParametersViewModel")
	}
	static class UCustomMatchParametersViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomMatchParametersViewModel>();
	}
};
DUMPER7_ASSERTS_UCustomMatchParametersViewModel;

// Class SOSBindings.CustomMatchSystemViewModel
// 0x00C0 (0x0130 - 0x0070)
class UCustomMatchSystemViewModel : public USCViewModel
{
public:
	class FString                                 m_JoinCode;                                        // 0x0070(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESOSClientCustomMatchState                    m_eStatus;                                         // 0x0080(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bCanCreate;                                      // 0x0081(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bCanJoin;                                        // 0x0082(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bCanLeave;                                       // 0x0083(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bCanInvite;                                      // 0x0084(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bCanKickFromCustomMatch;                         // 0x0085(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bCanPromote;                                     // 0x0086(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bLocalPlayerIsLeader;                            // 0x0087(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bLocalPlayerHasPendingTeamChange;                // 0x0088(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bIsWaitingForRematchServer;                      // 0x0089(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 m_LocalPlayerTeamId;                               // 0x0090(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESOSCustomMatchTeamId                         m_eLocalPlayerTeamId;                              // 0x00A0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       m_LeaderId;                                        // 0x00A8(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 m_LeaderDisplayName;                               // 0x00D8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCustomMatchParametersViewModel*        m_Parameters;                                      // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCustomMatchLobbySizeParametersViewModel* m_LobbySizeParameters;                           // 0x00F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCustomMatchTeamViewModel*              m_Team1;                                           // 0x00F8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCustomMatchTeamViewModel*              m_Team2;                                           // 0x0100(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCustomMatchTeamViewModel*              m_UnassignedPlayers;                               // 0x0108(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCustomMatchTeamViewModel*              m_Spectators;                                      // 0x0110(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UCustomMatchPlayerViewModel*>    m_Players;                                         // 0x0118(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)
	ESOSFeatureState                              m_eCustomMatchFeatureState;                        // 0x0128(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bIsAnyPlayerInMatch;                             // 0x0129(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CustomMatchSystemViewModel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CustomMatchSystemViewModel")
	}
	static class UCustomMatchSystemViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomMatchSystemViewModel>();
	}
};
DUMPER7_ASSERTS_UCustomMatchSystemViewModel;

// Class SOSBindings.CustomMatchViewImGui
// 0x0228 (0x0250 - 0x0028)
class UCustomMatchViewImGui final : public UViewImGuiBase
{
public:
	uint8                                         Pad_28[0x200];                                     // 0x0028(0x0200)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomMatchProxy*                      m_ModelProxy;                                      // 0x0228(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCustomMatchSystemViewModel*            m_ViewModel;                                       // 0x0230(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVoiceChatProxy*                        m_VoiceChatProxy;                                  // 0x0238(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAuthenticationViewModel*               m_AuthenticationViewModel;                         // 0x0240(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVoiceChatViewModel*                    m_VoiceChatViewModel;                              // 0x0248(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CustomMatchViewImGui")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CustomMatchViewImGui")
	}
	static class UCustomMatchViewImGui* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomMatchViewImGui>();
	}
};
DUMPER7_ASSERTS_UCustomMatchViewImGui;

// Class SOSBindings.FriendsProxy
// 0x0030 (0x0070 - 0x0040)
class UFriendsProxy final : public UModelProxy
{
public:
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UFriendSystemViewModel*                 m_ViewModel;                                       // 0x0060(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USOSBindingsSubsystem*                  m_Subsystem;                                       // 0x0068(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void BPF_AcceptCrossPlayFriendInvite(const struct FUniqueNetIdRepl& _playerId);
	void BPF_AddFriend(const struct FUniqueNetIdRepl& _playerId);
	void BPF_AsyncReportPlayer(const struct FUniqueNetIdRepl& _playerId, const TArray<ESOSPlayerReportReason>& _reasons, const struct FLatentActionInfo& _inLatentInfo, bool* _bOutSuccess);
	void BPF_BlockPlayer(const struct FUniqueNetIdRepl& _playerId);
	void BPF_EnableCrossplayOnBackend();
	bool BPF_IsFriend(const struct FUniqueNetIdRepl& _playerId);
	bool BPF_IsPlayerBlocked(const struct FUniqueNetIdRepl& _playerId);
	void BPF_RejectCrossPlayFriendInvite(const struct FUniqueNetIdRepl& _playerId);
	void BPF_RemoveFriend(const struct FUniqueNetIdRepl& _playerId);
	void BPF_SendCrossplayFriendInviteFromCode(const class FString& _code, const struct FLatentActionInfo& _inLatentInfo, bool* _bOutSuccess);
	void BPF_SetFriendsPanelOpen(bool _bOpen);
	void BPF_ShowUserProfile(const struct FUniqueNetIdRepl& _playerId);
	void BPF_UnblockPlayer(const struct FUniqueNetIdRepl& _playerId);

	class FString BPF_GetFriendAvatarItemId(const struct FUniqueNetIdRepl& _playerId) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FriendsProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FriendsProxy")
	}
	static class UFriendsProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFriendsProxy>();
	}
};
DUMPER7_ASSERTS_UFriendsProxy;

// Class SOSBindings.FriendsViewImGui
// 0x0040 (0x0068 - 0x0028)
class UFriendsViewImGui final : public UViewImGuiBase
{
public:
	class UFriendsProxy*                          m_ModelProxy;                                      // 0x0028(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFriendSystemViewModel*                 m_ViewModel;                                       // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPartyProxy*                            m_PartyProxy;                                      // 0x0038(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCustomMatchProxy*                      m_CustomMatchProxy;                                // 0x0040(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlayerProfileProxy*                    m_PlayerProfileProxy;                              // 0x0048(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAuthenticationViewModel*               m_AuthenticationViewModel;                         // 0x0050(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPartySystemViewModel*                  m_PartyViewModel;                                  // 0x0058(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCustomMatchSystemViewModel*            m_CustomMatchViewModel;                            // 0x0060(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FriendsViewImGui")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FriendsViewImGui")
	}
	static class UFriendsViewImGui* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFriendsViewImGui>();
	}
};
DUMPER7_ASSERTS_UFriendsViewImGui;

// Class SOSBindings.CrossplayFriendInviteViewModel
// 0x0000 (0x00B8 - 0x00B8)
class UCrossplayFriendInviteViewModel final : public UBaseSocialUserViewModel
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrossplayFriendInviteViewModel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrossplayFriendInviteViewModel")
	}
	static class UCrossplayFriendInviteViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrossplayFriendInviteViewModel>();
	}
};
DUMPER7_ASSERTS_UCrossplayFriendInviteViewModel;

// Class SOSBindings.FriendViewModel
// 0x00A8 (0x0160 - 0x00B8)
class UFriendViewModel : public UBaseSocialUserViewModel
{
public:
	bool                                          m_bIsOnline;                                       // 0x00B8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bIsPlayingThisGame;                              // 0x00B9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bIsJoinable;                                     // 0x00BA(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bIsInvitable;                                    // 0x00BB(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 m_FirstPartyUserID;                                // 0x00C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bHidden;                                         // 0x00D0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bIsInSquad;                                      // 0x00D1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bIsInCustomMatch;                                // 0x00D2(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bIsInMatch;                                      // 0x00D3(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 m_StatusStr;                                       // 0x00D8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 m_PartyJoinInfo;                                   // 0x00E8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 m_CustomMatchJoinInfo;                             // 0x00F8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 m_PlayerPartyCount;                                // 0x0108(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 m_MaxPlayerPartyCount;                             // 0x0118(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 m_AvatarItemId;                                    // 0x0128(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 m_BannerItemId;                                    // 0x0138(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 m_TitleItemId;                                     // 0x0148(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESOSCrossplayFriendshipStatus                 m_eCrossplayFriendshipStatus;                      // 0x0158(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FriendViewModel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FriendViewModel")
	}
	static class UFriendViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFriendViewModel>();
	}
};
DUMPER7_ASSERTS_UFriendViewModel;

// Class SOSBindings.FriendSystemViewModel
// 0x0028 (0x0098 - 0x0070)
class UFriendSystemViewModel : public USCViewModel
{
public:
	TArray<class UFriendViewModel*>               m_FriendList;                                      // 0x0070(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)
	TArray<class UCrossplayFriendInviteViewModel*> m_InboundCrossplayFriendInviteList;               // 0x0080(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_90[0x8];                                       // 0x0090(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 GetFriendCount() const;
	class UFriendViewModel* GetFriendViewModel(int32 _idx) const;
	class UCrossplayFriendInviteViewModel* GetInboundCrossplayFriendInviteViewModel(int32 _idx) const;
	int32 GetInboundFriendInviteCount() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FriendSystemViewModel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FriendSystemViewModel")
	}
	static class UFriendSystemViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFriendSystemViewModel>();
	}
};
DUMPER7_ASSERTS_UFriendSystemViewModel;

// Class SOSBindings.MatchmakingProxy
// 0x0060 (0x00A0 - 0x0040)
class UMatchmakingProxy final : public UModelProxy
{
public:
	TMulticastInlineDelegate<void(const struct FGameSessionPlacementResult& placementResult)> OnMatchmakingComplete; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x40];                                      // 0x0050(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchmakingViewModel*                  m_ViewModel;                                       // 0x0090(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USOSBindingsSubsystem*                  m_Subsystem;                                       // 0x0098(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void BPF_StartDebugQuickmatchMatchmaking();
	void BPF_StartDebugRankedMatchmaking();
	void BPF_StartQuickmatchMatchmaking();
	void BPF_StartQuickmatchMatchmaking3v3();
	void BPF_StartQuickmatchMatchmaking4v4();
	void BPF_StartRanked3v3Matchmaking();
	void BPF_StartRankedMatchmaking();
	void BPF_StopMatchmaking();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MatchmakingProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MatchmakingProxy")
	}
	static class UMatchmakingProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchmakingProxy>();
	}
};
DUMPER7_ASSERTS_UMatchmakingProxy;

// Class SOSBindings.MatchmakingViewImGui
// 0x0428 (0x0450 - 0x0028)
class UMatchmakingViewImGui final : public UViewImGuiBase
{
public:
	class UMatchmakingProxy*                      m_ModelProxy;                                      // 0x0028(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMatchmakingViewModel*                  m_ViewModel;                                       // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAuthenticationViewModel*               m_AuthenticationViewModel;                         // 0x0038(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPartySystemViewModel*                  m_PartyViewModel;                                  // 0x0040(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_48[0x408];                                     // 0x0048(0x0408)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MatchmakingViewImGui")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MatchmakingViewImGui")
	}
	static class UMatchmakingViewImGui* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchmakingViewImGui>();
	}
};
DUMPER7_ASSERTS_UMatchmakingViewImGui;

// Class SOSBindings.MatchmakingViewModel
// 0x0028 (0x0098 - 0x0070)
class UMatchmakingViewModel : public USCViewModel
{
public:
	ESOSClientMatchmakingStatus                   m_eMatchmakingStatus;                              // 0x0070(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              m_MatchmakingStartDate;                            // 0x0078(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         m_iMinimumLevelForRanked;                          // 0x0080(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bCanStartMatchmaking;                            // 0x0084(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESOSFeatureState                              m_eStateQuickMatch3v3;                             // 0x0085(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESOSFeatureState                              m_eStateQuickMatch4v4;                             // 0x0086(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESOSFeatureState                              m_eStateQuickMatch5v5;                             // 0x0087(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESOSFeatureState                              m_eStateRankedMatch;                               // 0x0088(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESOSFeatureState                              m_eStateRankedMatch3v3;                            // 0x0089(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bCanCancelMatchmaking;                           // 0x008A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_bCrossPlayEnabled;                               // 0x008B(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESOSGameType                                  m_lastSelectedGameType;                            // 0x008C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              m_LeaverPenaltyExpirationDate;                     // 0x0090(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MatchmakingViewModel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MatchmakingViewModel")
	}
	static class UMatchmakingViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchmakingViewModel>();
	}
};
DUMPER7_ASSERTS_UMatchmakingViewModel;

// Class SOSBindings.MatchResultProxy
// 0x0018 (0x0058 - 0x0040)
class UMatchResultProxy final : public UModelProxy
{
public:
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class USOSPlayerMatchResultViewModel*         m_MatchResult;                                     // 0x0050(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MatchResultProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MatchResultProxy")
	}
	static class UMatchResultProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchResultProxy>();
	}
};
DUMPER7_ASSERTS_UMatchResultProxy;

// Class SOSBindings.MatchResultViewImGui
// 0x0010 (0x0038 - 0x0028)
class UMatchResultViewImGui final : public UViewImGuiBase
{
public:
	class UMatchResultProxy*                      m_ModelProxy;                                      // 0x0028(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USOSPlayerMatchResultViewModel*         m_MatchResultViewModel;                            // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MatchResultViewImGui")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MatchResultViewImGui")
	}
	static class UMatchResultViewImGui* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchResultViewImGui>();
	}
};
DUMPER7_ASSERTS_UMatchResultViewImGui;

// Class SOSBindings.SOSBindingsPlayerProgressUpdate
// 0x0038 (0x00A8 - 0x0070)
class USOSBindingsPlayerProgressUpdate final : public USCViewModel
{
public:
	class USOSPlayerProfilePrivateProgression*    m_Progression;                                     // 0x0070(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USOSPlayerProfilePrivateProgression*    m_OldProgression;                                  // 0x0078(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USOSPlayerProfilePrivateSeasonProgression* m_SeasonProgression;                            // 0x0080(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USOSPlayerProfilePrivateSeasonProgression* m_OldSeasonProgression;                         // 0x0088(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         m_iSoftCurrencyGained;                             // 0x0090(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         m_iSeasonTokenGained;                              // 0x0094(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         m_iExpGained;                                      // 0x0098(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         m_iDailyWinExp;                                    // 0x009C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDateTime                              m_NextDailyWin;                                    // 0x00A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SOSBindingsPlayerProgressUpdate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SOSBindingsPlayerProgressUpdate")
	}
	static class USOSBindingsPlayerProgressUpdate* GetDefaultObj()
	{
		return GetDefaultObjImpl<USOSBindingsPlayerProgressUpdate>();
	}
};
DUMPER7_ASSERTS_USOSBindingsPlayerProgressUpdate;

// Class SOSBindings.SOSBindingsPlayerPromotionInfo
// 0x0010 (0x0080 - 0x0070)
class USOSBindingsPlayerPromotionInfo final : public USCViewModel
{
public:
	int32                                         m_uiNbWins;                                        // 0x0070(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         m_uiNbLosses;                                      // 0x0074(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         m_uiVictoryTokens;                                 // 0x0078(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         m_uiDemotionProtectionCounter;                     // 0x007C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SOSBindingsPlayerPromotionInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SOSBindingsPlayerPromotionInfo")
	}
	static class USOSBindingsPlayerPromotionInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<USOSBindingsPlayerPromotionInfo>();
	}
};
DUMPER7_ASSERTS_USOSBindingsPlayerPromotionInfo;

// Class SOSBindings.SOSBindingsPlayerRank
// 0x0018 (0x0088 - 0x0070)
class USOSBindingsPlayerRank final : public USCViewModel
{
public:
	int32                                         m_iDivIdx;                                         // 0x0070(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         m_iLeagueIdx;                                      // 0x0074(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         m_iRankPoints;                                     // 0x0078(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         m_iTotalRankPoints;                                // 0x007C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         m_iRankPointsLowerBound;                           // 0x0080(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         m_iRankPointsUpperBound;                           // 0x0084(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SOSBindingsPlayerRank")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SOSBindingsPlayerRank")
	}
	static class USOSBindingsPlayerRank* GetDefaultObj()
	{
		return GetDefaultObjImpl<USOSBindingsPlayerRank>();
	}
};
DUMPER7_ASSERTS_USOSBindingsPlayerRank;
