#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SOSBindings

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum SOSBindings.EMatchDataState
// NumValues: 0x0006
enum class EMatchDataState : uint8
{
	Owner                                    = 0,
	RegisteredIn                             = 1,
	Open                                     = 2,
	InGame                                   = 3,
	CreatingGame                             = 4,
	EMatchDataState_MAX                      = 5,
};

// Enum SOSBindings.ESOSQualityTier
// NumValues: 0x0007
enum class ESOSQualityTier : uint8
{
	QualityTier1                             = 0,
	QualityTier2                             = 1,
	QualityTier3                             = 2,
	QualityTier4                             = 3,
	QualityTier5                             = 4,
	Unknown                                  = 5,
	ESOSQualityTier_MAX                      = 6,
};

// ScriptStruct SOSBindings.MatchData
// 0x0050 (0x0050 - 0x0000)
struct FMatchData final
{
public:
	class FString                                 m_LobbyId;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 m_DgsAllocationID;                                 // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 m_Ruler;                                           // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         m_iPlayersCapacity;                                // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         m_iNbPlayers;                                      // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMatchDataState                               m_State;                                           // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         m_PlayerNames;                                     // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMatchData;

// ScriptStruct SOSBindings.GameSessionPlacementResult
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FGameSessionPlacementResult final
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGameSessionPlacementResult;

// ScriptStruct SOSBindings.SOSErrorMessageContent
// 0x0048 (0x0048 - 0x0000)
struct FSOSErrorMessageContent final
{
public:
	class FText                                   m_Title;                                           // 0x0000(0x0010)(Edit, BlueprintVisible, Config, NativeAccessSpecifierPublic)
	class FText                                   m_Message;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, Config, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  m_AdditionalTags;                                  // 0x0020(0x0020)(Edit, BlueprintVisible, Config, NativeAccessSpecifierPublic)
	struct FGameplayTag                           m_PopupTemplateTag;                                // 0x0040(0x0008)(Edit, BlueprintVisible, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSOSErrorMessageContent;

// ScriptStruct SOSBindings.SOSBindingsApiConfig
// 0x0030 (0x0030 - 0x0000)
struct FSOSBindingsApiConfig final
{
public:
	class FString                                 m_ClientApiClass;                                  // 0x0000(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 m_ServerApiClass;                                  // 0x0010(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 m_ServerCompatibilityKeyOverride;                  // 0x0020(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSOSBindingsApiConfig;

// ScriptStruct SOSBindings.SOSViewModelInstance
// 0x0010 (0x0010 - 0x0000)
struct FSOSViewModelInstance final
{
public:
	class UModelProxy*                            m_ModelProxy;                                      // 0x0000(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UViewImGuiBase*                         m_ViewImgui;                                       // 0x0008(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSOSViewModelInstance;

}

