#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_ControlDisplay

#include "Basic.hpp"

#include "SCCore_structs.hpp"
#include "BPE_ControlDisplayCategory_structs.hpp"
#include "BPE_ControlDisplayLayout_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_ControlDisplay.Struct_ControlDisplay
// 0x00F8 (0x00F8 - 0x0000)
struct FStruct_ControlDisplay final
{
public:
	class FText                                   InputText_7_DA1C458F4283F178446DBD82F9204953;      // 0x0000(0x0010)(Edit, BlueprintVisible)
	EBPE_ControlDisplayCategory                   DisplaySide_24_D1FD2449498329AAB9F10581DE162D62;   // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMappingID                             MappingID_40_9B787F4C460FB936521406B9B7200C7D;     // 0x0018(0x00D0)(Edit, BlueprintVisible)
	EBPE_ControlDisplayLayout                     LayoutColumn_37_A9C1ABED40CE0DB4D0298BBF47C5A887;  // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EControllerIconAxisTypes                      AxisType_43_2551CDD0400867BDDFC26EA906C322A4;      // 0x00E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHideInControlsDisplay_50_156753D34DE200B07467D1BE3254556D; // 0x00EA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EB[0x5];                                       // 0x00EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 TextStyleOverride_49_5C4750F84FB77BA503290DB17B368C3E; // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_ControlDisplay;

}

