#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_ThumbnailSceneParams

#include "Basic.hpp"

#include "SCCharacterCustomization_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ThumbnailSceneMode_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_ThumbnailSceneParams.Struct_ThumbnailSceneParams
// 0x0138 (0x0138 - 0x0000)
struct FStruct_ThumbnailSceneParams final
{
public:
	class UObject*                                DataAsset_26_E735F375427C843317D9E88F0383CC4D;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelSequence*                         ViewSequence_9_8856736A49AC6B6C53668DB7D908D386;   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          AnimSequence_10_632BA5A9485121FCCFCB98A79DC4EB44;  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        AnimTime_11_2ECD91FA4F513FB4076852BB8766AB0F;      // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSCCharacterCustomizationDescription   Customization_17_79668AD04AB4CD2D1624FC85DCB239AB; // 0x0020(0x00F0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	EThumbnailSceneMode                           SceneMode_25_485731D84B2995F974F8C4A4BE79A3C8;     // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MainWorldContext_30_8FA2F0EE45E98DC27FD650AFC7339F4E; // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             SceneBackground_33_2C6C73A24E1F3012E9C143B25FA0B873; // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MannequinColor_40_EC0B909442D040AB9DB2EE889B4F658B; // 0x0128(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_ThumbnailSceneParams;

}

