#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_ShootAtLocation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Runtime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "StateTreeModule_classes.hpp"
#include "SCCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass STT_ShootAtLocation.STT_ShootAtLocation_C
// 0x0068 (0x00B0 - 0x0048)
class USTT_ShootAtLocation_C final : public UStateTreeTaskBlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0048(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABall*                                  Ball;                                              // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FVector                                Impact_Point;                                      // 0x0058(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARuntimeCharacter*                      RuntimeChar;                                       // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGA_BaseShoot_C>            In_Ability_to_Activate;                            // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FAITestGameplayAbilityTargetData       Dummy;                                             // 0x0080(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FShootForceComputationInstance         Force_Computation;                                 // 0x0090(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, ContainsInstancedReference)
	struct FShootDirectionComputationInstance     Direction_Computation;                             // 0x00A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, ContainsInstancedReference)

public:
	void ExecuteUbergraph_STT_ShootAtLocation(int32 EntryPoint);
	void ReceiveLatentEnterState(const struct FStateTreeTransitionResult& TRANSITION);
	void Removed_0BB1FDF04159A170BBF085B305BA5531();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("STT_ShootAtLocation_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"STT_ShootAtLocation_C")
	}
	static class USTT_ShootAtLocation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTT_ShootAtLocation_C>();
	}
};
DUMPER7_ASSERTS_USTT_ShootAtLocation_C;

}

