#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_InitInfiniteMoveTo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "StateTreeModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass STT_InitInfiniteMoveTo.STT_InitInfiniteMoveTo_C
// 0x0020 (0x0068 - 0x0048)
class USTT_InitInfiniteMoveTo_C final : public UStateTreeTaskBlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0048(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ARuntimeAIController*                   Runtime_AI_Controller;                             // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          Movement_Started_Here;                             // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Move_To_Target;                                    // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_STT_InitInfiniteMoveTo(int32 EntryPoint);
	void ReceiveExitState(const struct FStateTreeTransitionResult& TRANSITION);
	void ReceiveLatentEnterState(const struct FStateTreeTransitionResult& TRANSITION);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("STT_InitInfiniteMoveTo_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"STT_InitInfiniteMoveTo_C")
	}
	static class USTT_InitInfiniteMoveTo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTT_InitInfiniteMoveTo_C>();
	}
};
DUMPER7_ASSERTS_USTT_InitInfiniteMoveTo_C;

}

