#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_Pass

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EAbilityShootType_structs.hpp"
#include "SCCore_structs.hpp"
#include "StateTreeModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass STT_Pass.STT_Pass_C
// 0x0038 (0x0080 - 0x0048)
class USTT_Pass_C final : public UStateTreeTaskBlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0048(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bIsPlayerTarget_;                                  // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityShootType                             Shoot_Type;                                        // 0x0051(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ForwardOffset;                                     // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 PassTarget;                                        // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ARuntimeCharacter*                      RuntimeAI;                                         // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ActorTarget;                                       // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	double                                        PowerRatio;                                        // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CalculatePowerRatio();
	void ExecuteUbergraph_STT_Pass(int32 EntryPoint);
	void ReceiveLatentEnterState(const struct FStateTreeTransitionResult& TRANSITION);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("STT_Pass_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"STT_Pass_C")
	}
	static class USTT_Pass_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTT_Pass_C>();
	}
};
DUMPER7_ASSERTS_USTT_Pass_C;

}

