#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_DefenseMode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "StateTreeModule_classes.hpp"
#include "SCCore_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass STT_DefenseMode.STT_DefenseMode_C
// 0x00A8 (0x00F0 - 0x0048)
class USTT_DefenseMode_C final : public UStateTreeTaskBlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0048(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ARuntimeCharacter*                      Runtime_Character;                                 // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Ball_Owner;                                        // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilitySpecHandle             Defense_Mode_Ability_Handle;                       // 0x0060(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARuntimeAIController*                   AI_Runtime_Controller;                             // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FAITestGameplayAbilityTargetData       Dummy;                                             // 0x0070(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AActor*                                 Previous_Ball_Owner;                               // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ABall*                                  Ball;                                              // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class FName                                   Tag;                                               // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AbilityTriggered;                                  // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   GALockMoveSoftClassRef;                            // 0x00A0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   GALockMoveGoalKeeperSoftClassRef;                  // 0x00C8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)

public:
	void CheckSoftClassRefsValidity(bool* AreGAClassesValid);
	void ExecuteUbergraph_STT_DefenseMode(int32 EntryPoint);
	void Manage_Focus();
	void ReceiveExitState(const struct FStateTreeTransitionResult& TRANSITION);
	void ReceiveLatentEnterState(const struct FStateTreeTransitionResult& TRANSITION);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("STT_DefenseMode_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"STT_DefenseMode_C")
	}
	static class USTT_DefenseMode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTT_DefenseMode_C>();
	}
};
DUMPER7_ASSERTS_USTT_DefenseMode_C;

}

