#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_PassAfterBallCall

#include "Basic.hpp"

#include "Runtime_structs.hpp"
#include "Engine_structs.hpp"
#include "EAbilityShootType_structs.hpp"
#include "StateTreeModule_classes.hpp"
#include "SCCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass STT_PassAfterBallCall.STT_PassAfterBallCall_C
// 0x00A8 (0x00F0 - 0x0048)
class USTT_PassAfterBallCall_C final : public UStateTreeTaskBlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0048(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ARuntimeCharacter*                      RuntimeChar;                                       // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ARuntimeCharacter*                      Next_Ball_Owner;                                   // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	EAbilityShootType                             Shoot_Type;                                        // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABall*                                  Ball;                                              // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	double                                        DistanceToShoot_;                                  // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            Distance_Forward_Next_Owner;                       // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Distance_Squared__between_sender_and_receiver;     // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ForwardShootV2SpeedMultiplier;                     // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ForwardShootV3SpeedMultiplier;                     // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UShootAbilityData*                      Shoot_Ability_Data;                                // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Shoot_Ability_Data_class;                          // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Box_Trace_HalfSize;                                // 0x00A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAITestGameplayAbilityTargetData       Dummy;                                             // 0x00C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FShootForceComputationInstance         Force_Computation;                                 // 0x00D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, ContainsInstancedReference)
	struct FShootDirectionComputationInstance     ImpactPointShootDirection;                         // 0x00E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, ContainsInstancedReference)

public:
	void Calculate_best_impact_point_for_shoot(struct FVector* Best_Impact_Point);
	void ExecuteUbergraph_STT_PassAfterBallCall(int32 EntryPoint);
	void ReceiveLatentEnterState(const struct FStateTreeTransitionResult& TRANSITION);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("STT_PassAfterBallCall_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"STT_PassAfterBallCall_C")
	}
	static class USTT_PassAfterBallCall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTT_PassAfterBallCall_C>();
	}
};
DUMPER7_ASSERTS_USTT_PassAfterBallCall_C;

}

