#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_BallSteal

#include "Basic.hpp"

#include "SCCore_structs.hpp"
#include "StateTreeModule_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function STT_BallSteal.STT_BallSteal_C.ExecuteUbergraph_STT_BallSteal
// 0x01C0 (0x01C0 - 0x0000)
struct STT_BallSteal_C_ExecuteUbergraph_STT_BallSteal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStateTreeTransitionResult             K2Node_Event_Transition;                           // 0x0008(0x0030)(ConstParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle;          // 0x0048(0x0028)()
	TScriptInterface<class IGameplayTaskOwnerInterface> CallFunc_BPF_TaskWaitGameplayTagRemoved__container_CastInput; // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UGameplayTask_WaitGameplayTagRemoved*   CallFunc_BPF_TaskWaitGameplayTagRemoved_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector_NetQuantizeNormal              CallFunc_MakeVector_NetQuantizeNormal_ReturnValue; // 0x00D8(0x0018)(NoDestructor, HasGetValueTypeHash)
	struct FInputGameplayAbilityTargetData        K2Node_MakeStruct_InputGameplayAbilityTargetData;  // 0x00F0(0x0058)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_MakeTargetDataHandle__outHandle_1;        // 0x0148(0x0028)()
	TArray<struct FGameplayAbilityTargetDataHandle> K2Node_MakeArray_Array;                          // 0x0170(0x0010)(ConstParm, ReferenceParm)
	struct FGameplayAbilityTargetDataHandle       CallFunc_BPF_CombineTargetDatas_ReturnValue;       // 0x0180(0x0028)()
	struct FGameplayAbilitySpecHandle             CallFunc_BPF_TriggerAbilityFromTargetDataHandle__outAbilityHandle; // 0x01A8(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayAbility*                       CallFunc_BPF_TriggerAbilityFromTargetDataHandle__abilityInstanceCreated; // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPF_TriggerAbilityFromTargetDataHandle_ReturnValue; // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_STT_BallSteal_C_ExecuteUbergraph_STT_BallSteal;

// Function STT_BallSteal.STT_BallSteal_C.ReceiveLatentEnterState
// 0x0030 (0x0030 - 0x0000)
struct STT_BallSteal_C_ReceiveLatentEnterState final
{
public:
	struct FStateTreeTransitionResult             TRANSITION;                                        // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_STT_BallSteal_C_ReceiveLatentEnterState;

}

