#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_InitInfiniteMoveTo

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"


namespace SDK::Params
{

// Function STT_InitInfiniteMoveTo.STT_InitInfiniteMoveTo_C.ExecuteUbergraph_STT_InitInfiniteMoveTo
// 0x0070 (0x0070 - 0x0000)
struct STT_InitInfiniteMoveTo_C_ExecuteUbergraph_STT_InitInfiniteMoveTo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStateTreeTransitionResult             K2Node_Event_Transition_1;                         // 0x0008(0x0030)(ConstParm)
	struct FStateTreeTransitionResult             K2Node_Event_Transition;                           // 0x0038(0x0030)(ConstParm)
	bool                                          CallFunc_BPF_StartMovement_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPF_HasStartedMovement_ReturnValue;       // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_STT_InitInfiniteMoveTo_C_ExecuteUbergraph_STT_InitInfiniteMoveTo;

// Function STT_InitInfiniteMoveTo.STT_InitInfiniteMoveTo_C.ReceiveExitState
// 0x0030 (0x0030 - 0x0000)
struct STT_InitInfiniteMoveTo_C_ReceiveExitState final
{
public:
	struct FStateTreeTransitionResult             TRANSITION;                                        // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_STT_InitInfiniteMoveTo_C_ReceiveExitState;

// Function STT_InitInfiniteMoveTo.STT_InitInfiniteMoveTo_C.ReceiveLatentEnterState
// 0x0030 (0x0030 - 0x0000)
struct STT_InitInfiniteMoveTo_C_ReceiveLatentEnterState final
{
public:
	struct FStateTreeTransitionResult             TRANSITION;                                        // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_STT_InitInfiniteMoveTo_C_ReceiveLatentEnterState;

}

