#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STT_BallSteal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "StateTreeModule_classes.hpp"
#include "SCCore_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass STT_BallSteal.STT_BallSteal_C
// 0x0048 (0x0090 - 0x0048)
class USTT_BallSteal_C final : public UStateTreeTaskBlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0048(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAITestGameplayAbilityTargetData       Dummy;                                             // 0x0050(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ARuntimeCharacter*                      AI;                                                // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Ball_Owner_Loc;                                    // 0x0068(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Ball_Steal_Tag;                                    // 0x0080(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayAbility>           In_Ability_to_Activate;                            // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_STT_BallSteal(int32 EntryPoint);
	void ReceiveLatentEnterState(const struct FStateTreeTransitionResult& TRANSITION);
	void Removed_79EF847C4AC37F1459BEC28B4E337D98();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("STT_BallSteal_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"STT_BallSteal_C")
	}
	static class USTT_BallSteal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTT_BallSteal_C>();
	}
};
DUMPER7_ASSERTS_USTT_BallSteal_C;

}

