#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TackleDataRow

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct TackleDataRow.TackleDataRow
// 0x0020 (0x0020 - 0x0000)
struct FTackleDataRow final
{
public:
	struct FGameplayTag                           AttackTag_23_02DD725A4A6DE6ADB0DE889A36C91370;     // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	int32                                         StartupFrames_15_7EEBC19E4BB5FDBB1A8A0B966791A8EF; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RecoveryFrames_17_398B990B4A882899FAFF159B9D018E94; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HitActiveDuration_33_5519E0B54D4127EF03138C91737DBB3C; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ScaleSpeed_36_9B11AC824D9796F89D3015B4914A0F78;    // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FTackleDataRow;

}

