#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIRankedLeagues

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct UIRankedLeagues.UIRankedLeagues
// 0x0050 (0x0050 - 0x0000)
struct FUIRankedLeagues final
{
public:
	int32                                         LeagueIndex_20_1C12962046E6FEAD87A038AAE9B68588;   // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LeagueDivisionIndex_21_A5208FE2489A238C2072D69EF453521F; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   LeagueName_3_6618A34D4B8D6D725BE20A8F7AD589CC;     // 0x0008(0x0010)(Edit, BlueprintVisible)
	class FText                                   LeagueDivisionName_6_4B5AEDE24CC363B74F78E0BACC40F5BD; // 0x0018(0x0010)(Edit, BlueprintVisible)
	struct FLinearColor                           LeagueMainColor_16_2FAD8EA54F34FF325E374188EE68A27A; // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             LeagueTexture_28_080F770C421EF579B8E337909C2D19F7; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             LeagueMask_26_F42AF6A84538DAB2481D1CA5EB3833BA;    // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             LeagueGlowMask_27_D90EF0714E57F0EA21ED1CB5039D8D2B; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FUIRankedLeagues;

}

