#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UpscalingBasedGameOptions

#include "Basic.hpp"

#include "UpscalingBasedGameOptions_structs.hpp"


namespace SDK::Params
{

// Function UpscalingBasedGameOptions.DLSSSuperResolutionQualityMode.GetAvailableDLSSModes
// 0x0010 (0x0010 - 0x0000)
struct DLSSSuperResolutionQualityMode_GetAvailableDLSSModes final
{
public:
	TArray<EOrderedDLSSMode>                      ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DLSSSuperResolutionQualityMode_GetAvailableDLSSModes;

// Function UpscalingBasedGameOptions.UpscalerFeaturesBlueprintLibrary.CheckUpscalingFeatureAvailability
// 0x0008 (0x0008 - 0x0000)
struct UpscalerFeaturesBlueprintLibrary_CheckUpscalingFeatureAvailability final
{
public:
	int32                                         UpscalingFeaturesBitFlag;                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNeedsTechnoEnabled;                               // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UpscalerFeaturesBlueprintLibrary_CheckUpscalingFeatureAvailability;

// Function UpscalingBasedGameOptions.UpscalerFeaturesBlueprintLibrary.GetCurrentUpscalingMethod
// 0x0001 (0x0001 - 0x0000)
struct UpscalerFeaturesBlueprintLibrary_GetCurrentUpscalingMethod final
{
public:
	EUpscaler                                     ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UpscalerFeaturesBlueprintLibrary_GetCurrentUpscalingMethod;

// Function UpscalingBasedGameOptions.UpscalerFeaturesBlueprintLibrary.IsThirdPartyUpscalerSelected
// 0x0001 (0x0001 - 0x0000)
struct UpscalerFeaturesBlueprintLibrary_IsThirdPartyUpscalerSelected final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UpscalerFeaturesBlueprintLibrary_IsThirdPartyUpscalerSelected;

// Function UpscalingBasedGameOptions.UpscalingMethodOption.GetAvailableUpscalers
// 0x0010 (0x0010 - 0x0000)
struct UpscalingMethodOption_GetAvailableUpscalers final
{
public:
	TArray<EUpscaler>                             ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UpscalingMethodOption_GetAvailableUpscalers;

}

