#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ValuesAIInterface

#include "Basic.hpp"

#include "Runtime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SCCore_structs.hpp"
#include "EAbilityShootType_structs.hpp"


namespace SDK::Params
{

// Function ValuesAIInterface.ValuesAIInterface_C.GetAbilityToUse
// 0x0001 (0x0001 - 0x0000)
struct ValuesAIInterface_C_GetAbilityToUse final
{
public:
	EAbilityShootType                             OutAbilityToUse;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ValuesAIInterface_C_GetAbilityToUse;

// Function ValuesAIInterface.ValuesAIInterface_C.GetAimedDirection
// 0x0018 (0x0018 - 0x0000)
struct ValuesAIInterface_C_GetAimedDirection final
{
public:
	struct FVector                                Direction;                                         // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ValuesAIInterface_C_GetAimedDirection;

// Function ValuesAIInterface.ValuesAIInterface_C.GetAimingPlayer
// 0x0001 (0x0001 - 0x0000)
struct ValuesAIInterface_C_GetAimingPlayer final
{
public:
	bool                                          IsAimingPlayer;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ValuesAIInterface_C_GetAimingPlayer;

// Function ValuesAIInterface.ValuesAIInterface_C.GetCardinalOffset
// 0x0001 (0x0001 - 0x0000)
struct ValuesAIInterface_C_GetCardinalOffset final
{
public:
	ESCCardinalPoints                             OutCardinalOffset;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ValuesAIInterface_C_GetCardinalOffset;

// Function ValuesAIInterface.ValuesAIInterface_C.GetHeight
// 0x0008 (0x0008 - 0x0000)
struct ValuesAIInterface_C_GetHeight final
{
public:
	double                                        OutHeight;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ValuesAIInterface_C_GetHeight;

// Function ValuesAIInterface.ValuesAIInterface_C.GetOffset
// 0x0008 (0x0008 - 0x0000)
struct ValuesAIInterface_C_GetOffset final
{
public:
	double                                        OutOffset;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ValuesAIInterface_C_GetOffset;

// Function ValuesAIInterface.ValuesAIInterface_C.GetOriginalPosition
// 0x0018 (0x0018 - 0x0000)
struct ValuesAIInterface_C_GetOriginalPosition final
{
public:
	struct FVector                                OutOriginPosition;                                 // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ValuesAIInterface_C_GetOriginalPosition;

// Function ValuesAIInterface.ValuesAIInterface_C.GetOriginalRotation
// 0x0018 (0x0018 - 0x0000)
struct ValuesAIInterface_C_GetOriginalRotation final
{
public:
	struct FRotator                               OutRotation;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ValuesAIInterface_C_GetOriginalRotation;

// Function ValuesAIInterface.ValuesAIInterface_C.GetShootAnimNetDelay
// 0x0008 (0x0008 - 0x0000)
struct ValuesAIInterface_C_GetShootAnimNetDelay final
{
public:
	double                                        OutShootAnimNetDelay;                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ValuesAIInterface_C_GetShootAnimNetDelay;

// Function ValuesAIInterface.ValuesAIInterface_C.GetShootForce
// 0x0010 (0x0010 - 0x0000)
struct ValuesAIInterface_C_GetShootForce final
{
public:
	struct FShootForceComputationInstance         OutForce;                                          // 0x0000(0x0010)(Parm, OutParm, NoDestructor, ContainsInstancedReference)
};
DUMPER7_ASSERTS_ValuesAIInterface_C_GetShootForce;

}

