#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VolleyTapDataRow

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct VolleyTapDataRow.VolleyTapDataRow
// 0x0018 (0x0018 - 0x0000)
struct FVolleyTapDataRow final
{
public:
	int32                                         SnapNotifyFrameStart_8_A17361FA4C4CED96C2A3DBB441361D6A; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SnapNotifyFrameEnd_10_0C32DD1547CEED5DE4C6EEAAB5DFB2A6; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ShootFrame_12_7694E2A94385B5BD2595309578DC1D67;    // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AvailabilityLayerFrameStart_13_758ADB3D4E48EB6DEB091186EDD04CA9; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MovementModeFrameStart_20_B28C637C46AE1A00863BDEBC585A31F9; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MovementModeFrameEnd_21_A5DC69DB4BCE1050BE486FBB6303ADCE; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FVolleyTapDataRow;

}

