#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Store_Item_Btn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCCore_structs.hpp"
#include "WBP_StoreBtn_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Store_Item_Btn.WBP_Store_Item_Btn_C
// 0x0040 (0x0E10 - 0x0DD0)
class UWBP_Store_Item_Btn_C final : public UWBP_StoreBtn_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_Store_Item_Btn_C;               // 0x0DD0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               FocusBorder;                                       // 0x0DD8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Item;                                      // 0x0DE0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BtnSelector_C*                     WBP_BtnSelecton;                                   // 0x0DE8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Store_Item_C*                      WBP_Store_Item;                                    // 0x0DF0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USOSBindingsStoreItemViewModel*         Item_VM;                                           // 0x0DF8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UBP_StoreViewModel_C*                   Global_StoreViewModel;                             // 0x0E00(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	bool                                          HideStoreItemInfos;                                // 0x0E08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPreviewItems;                                     // 0x0E09(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPE_OnClicked();
	void BPE_OnDeselected();
	void BPE_OnSelected();
	void ExecuteUbergraph_WBP_Store_Item_Btn(int32 EntryPoint);
	void FocusButton(bool ButtonFocused);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void PreConstruct(bool IsDesignTime);
	void SetItem_VM(class USOSBindingsStoreItemViewModel* viewModel);

	void GetStoreItem(class UWBP_Store_Item_C** WBP_Store_Item_0) const;
	void IsLinkedToSet(bool* LinkedToSet) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Store_Item_Btn_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Store_Item_Btn_C")
	}
	static class UWBP_Store_Item_Btn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Store_Item_Btn_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Store_Item_Btn_C;

}

