#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RadarPlayer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_RadarPlayer.WBP_RadarPlayer_C.ExecuteUbergraph_WBP_RadarPlayer
// 0x0008 (0x0008 - 0x0000)
struct WBP_RadarPlayer_C_ExecuteUbergraph_WBP_RadarPlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_RadarPlayer_C_ExecuteUbergraph_WBP_RadarPlayer;

// Function WBP_RadarPlayer.WBP_RadarPlayer_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_RadarPlayer_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_RadarPlayer_C_PreConstruct;

// Function WBP_RadarPlayer.WBP_RadarPlayer_C.SetPlayerColor
// 0x0018 (0x0018 - 0x0000)
struct WBP_RadarPlayer_C_SetPlayerColor final
{
public:
	struct FLinearColor                           Color_and_Opacity;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_RadarPlayer_C_SetPlayerColor;

// Function WBP_RadarPlayer.WBP_RadarPlayer_C.SetPlayerTexture
// 0x0018 (0x0018 - 0x0000)
struct WBP_RadarPlayer_C_SetPlayerTexture final
{
public:
	bool                                          IsEnnemy;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_RadarPlayer_C_SetPlayerTexture;

}

