#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Common_Generic_Warning

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "WBP_Abstract_Common_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Common_Generic_Warning.WBP_Common_Generic_Warning_C
// 0x0170 (0x0D70 - 0x0C00)
class UWBP_Common_Generic_Warning_C final : public UWBP_Abstract_Common_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_Common_Generic_Warning_C;       // 0x0C00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_WarningHeader;                              // 0x0C08(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconImage;                                         // 0x0C10(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_BottomLine;                                    // 0x0C18(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ListView_C*                        ListView_PageInputs;                               // 0x0C20(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x0C28(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TXT_WarningDescription;                            // 0x0C30(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TXT_WarningTitle;                                  // 0x0C38(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Various_Container;                                 // 0x0C40(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   WarningTitle;                                      // 0x0C48(0x0010)(Edit, BlueprintVisible)
	class FText                                   WarningDescription;                                // 0x0C58(0x0010)(Edit, BlueprintVisible)
	float                                         Sizebox_Width;                                     // 0x0C68(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0C6C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C7C[0x4];                                      // 0x0C7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            Icon;                                              // 0x0C80(0x00D0)(Edit, BlueprintVisible)
	bool                                          DarkMode;                                          // 0x0D50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D51[0x7];                                      // 0x0D51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetContextViewModel*                WidgetContextViewModel;                            // 0x0D58(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class ULocalWidgetContextViewModel*           LocalWidgetContextViewModel;                       // 0x0D60(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Common_Generic_Warning(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetDescription(const class FText& Description);
	void SetLocalWidgetContextViewModel(class ULocalWidgetContextViewModel* viewModel);
	void SetSourcesToActionsListView(TArray<class UMenuActionViewModel*>& ActionsVMs);
	void SetTitle(const class FText& Title);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Common_Generic_Warning_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Common_Generic_Warning_C")
	}
	static class UWBP_Common_Generic_Warning_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Common_Generic_Warning_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Common_Generic_Warning_C;

}

