#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MenuPage_Home

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SOS_structs.hpp"
#include "SCCore_structs.hpp"
#include "Runtime_structs.hpp"


namespace SDK::Params
{

// Function WBP_MenuPage_Home.WBP_MenuPage_Home_C.__Setter_CurrentPlayerLevel
// 0x0008 (0x0008 - 0x0000)
struct WBP_MenuPage_Home_C___Setter_CurrentPlayerLevel final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_MenuPage_Home_C___Setter_CurrentPlayerLevel;

// Function WBP_MenuPage_Home.WBP_MenuPage_Home_C.BndEvt__WBP_MenuPage_Home_Btn_News_K2Node_ComponentBoundEvent_0_ButtonUserWidgetClickDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_MenuPage_Home_C_BndEvt__WBP_MenuPage_Home_Btn_News_K2Node_ComponentBoundEvent_0_ButtonUserWidgetClickDelegate__DelegateSignature final
{
public:
	class USCButtonUserWidget*                    _button;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          _bWithMouse;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_MenuPage_Home_C_BndEvt__WBP_MenuPage_Home_Btn_News_K2Node_ComponentBoundEvent_0_ButtonUserWidgetClickDelegate__DelegateSignature;

// Function WBP_MenuPage_Home.WBP_MenuPage_Home_C.BPE_OnActionPressed
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_MenuPage_Home_C_BPE_OnActionPressed final
{
public:
	const class USCInputAction*                   _action;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionState                      _listenerState;                                    // 0x0008(0x0098)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_WBP_MenuPage_Home_C_BPE_OnActionPressed;

// Function WBP_MenuPage_Home.WBP_MenuPage_Home_C.BPE_OnMenuTransitionIn
// 0x0010 (0x0010 - 0x0000)
struct WBP_MenuPage_Home_C_BPE_OnMenuTransitionIn final
{
public:
	EMenuTransitions                              _eTransition;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class USCMenuWidget>              _ePrevMenu;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_MenuPage_Home_C_BPE_OnMenuTransitionIn;

// Function WBP_MenuPage_Home.WBP_MenuPage_Home_C.BPE_OnMenuTransitionOut
// 0x0010 (0x0010 - 0x0000)
struct WBP_MenuPage_Home_C_BPE_OnMenuTransitionOut final
{
public:
	EMenuTransitions                              _eTransition;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class USCMenuWidget>              _eNewMenu;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_MenuPage_Home_C_BPE_OnMenuTransitionOut;

// Function WBP_MenuPage_Home.WBP_MenuPage_Home_C.ExecuteUbergraph_WBP_MenuPage_Home
// 0x0210 (0x0210 - 0x0000)
struct WBP_MenuPage_Home_C_ExecuteUbergraph_WBP_MenuPage_Home final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class URuntimeSOSBindingsSubsystem*           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URuntimeWelcomeFlowSubsystem*           CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UModelProxy*                            CallFunc_BPF_GetServicesViewModelProxy_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStoreProxy*                            K2Node_DynamicCast_AsStore_Proxy;                  // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URuntimeSOSBindingsSubsystem*           CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UModelProxy*                            CallFunc_BPF_GetServicesViewModelProxy_ReturnValue_1; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class USCInputAction*                   K2Node_Event__action;                              // 0x0058(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionState                      K2Node_Event__listenerState;                       // 0x0060(0x0098)(ConstParm)
	class UStoreProxy*                            K2Node_DynamicCast_AsStore_Proxy_1;                // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASCBasePlayerController*                K2Node_DynamicCast_AsSCBase_Player_Controller;     // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class URuntimeGameSettings*             CallFunc_BPF_GetRuntimeMainSettings_ReturnValue;   // 0x0120(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class USCViewModel*>        Temp_name_Variable;                                // 0x0130(0x0050)(ConstParm)
	EMenuTransitions                              K2Node_Event__eTransition_1;                       // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class USCMenuWidget>              K2Node_Event__ePrevMenu;                           // 0x0188(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EWelcomeFlowStep                              Temp_byte_Variable_2;                              // 0x0190(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USCButtonUserWidget*                    K2Node_ComponentBoundEvent__button;                // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent__bWithMouse;            // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URuntimeWelcomeFlowSubsystem*           CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASCBasePlayerController*                CallFunc_BPF_GetPlayerController_ReturnValue;      // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Map_Find_Value;                           // 0x01B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_BPF_ShowPopupByTemplate__outSelectedOptionTag; // 0x01C4(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USCInputAction*                         CallFunc_BPF_ShowPopupByTemplate__outSelectedAction; // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URuntimeSaveSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPF_GetFirstLaunchPassed_ReturnValue;     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URuntimeGameFlowSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x01F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESCFFlowGraphError                            CallFunc_BPF_GotoStateByTransitionName_ReturnValue; // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuTransitions                              K2Node_Event__eTransition;                         // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_202[0x6];                                      // 0x0202(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class USCMenuWidget>              K2Node_Event__eNewMenu;                            // 0x0208(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_MenuPage_Home_C_ExecuteUbergraph_WBP_MenuPage_Home;

// Function WBP_MenuPage_Home.WBP_MenuPage_Home_C.OnAnyOnlineBoolChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_MenuPage_Home_C_OnAnyOnlineBoolChanged final
{
public:
	bool                                          _bAnyBool;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_MenuPage_Home_C_OnAnyOnlineBoolChanged;

// Function WBP_MenuPage_Home.WBP_MenuPage_Home_C.OnAnyOnlineInfoChanged
// 0x0002 (0x0002 - 0x0000)
struct WBP_MenuPage_Home_C_OnAnyOnlineInfoChanged final
{
public:
	bool                                          CallFunc_IsAnyPlayerReconnectToRanked_IsAnyPlayerReconnectToRanked; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConnectedToFrontend_IsConnected;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_MenuPage_Home_C_OnAnyOnlineInfoChanged;

// Function WBP_MenuPage_Home.WBP_MenuPage_Home_C.OnCustomMatchStatusChange
// 0x0058 (0x0058 - 0x0000)
struct WBP_MenuPage_Home_C_OnCustomMatchStatusChange final
{
public:
	ESOSClientCustomMatchState                    CustomMatchState;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0018(0x0010)()
	bool                                          Temp_bool_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0030(0x0010)()
	class FName                                   Temp_name_Variable;                                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default_1;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_MenuPage_Home_C_OnCustomMatchStatusChange;

// Function WBP_MenuPage_Home.WBP_MenuPage_Home_C.OnMatchmakingStatusChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_MenuPage_Home_C_OnMatchmakingStatusChanged final
{
public:
	ESOSClientMatchmakingStatus                   Status;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_MenuPage_Home_C_OnMatchmakingStatusChanged;

// Function WBP_MenuPage_Home.WBP_MenuPage_Home_C.OnPlayerLevelChange
// 0x0004 (0x0004 - 0x0000)
struct WBP_MenuPage_Home_C_OnPlayerLevelChange final
{
public:
	int32                                         PlayerLevel;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_MenuPage_Home_C_OnPlayerLevelChange;

// Function WBP_MenuPage_Home.WBP_MenuPage_Home_C.RefreshFocusIfRankedMatchIsEnabled
// 0x0018 (0x0018 - 0x0000)
struct WBP_MenuPage_Home_C_RefreshFocusIfRankedMatchIsEnabled final
{
public:
	bool                                          IsEnabledRefresh;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASCBasePlayerController*                CallFunc_BPF_GetPlayerController_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_MenuPage_Home_C_RefreshFocusIfRankedMatchIsEnabled;

// Function WBP_MenuPage_Home.WBP_MenuPage_Home_C.SetUUQrCodeVisibility
// 0x0020 (0x0020 - 0x0000)
struct WBP_MenuPage_Home_C_SetUUQrCodeVisibility final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentCulture_ReturnValue;            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_MenuPage_Home_C_SetUUQrCodeVisibility;

// Function WBP_MenuPage_Home.WBP_MenuPage_Home_C.UpdateCustomMatchButtonAvailability
// 0x000A (0x000A - 0x0000)
struct WBP_MenuPage_Home_C_UpdateCustomMatchButtonAvailability final
{
public:
	bool                                          bIsConnectedToFronted;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInLobby;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPartyOwner;                                     // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESOSClientMatchmakingStatus                   InMatchMakingStatus;                               // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAnyPlayerReconnectToRanked;                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableButton;                                     // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_MenuPage_Home_C_UpdateCustomMatchButtonAvailability;

// Function WBP_MenuPage_Home.WBP_MenuPage_Home_C.UpdateMMBtnText
// 0x0028 (0x0028 - 0x0000)
struct WBP_MenuPage_Home_C_UpdateMMBtnText final
{
public:
	class FText                                   btnSubText;                                        // 0x0000(0x0010)(Edit, BlueprintVisible)
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0010(0x0010)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConnectedToFrontend_IsConnected;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_MenuPage_Home_C_UpdateMMBtnText;

// Function WBP_MenuPage_Home.WBP_MenuPage_Home_C.UpdateRankedMatchmakingState
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_MenuPage_Home_C_UpdateRankedMatchmakingState final
{
public:
	class FText                                   btnSubTextRanked;                                  // 0x0000(0x0010)(Edit, BlueprintVisible)
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0010(0x0010)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConnectedToFrontend_IsConnected;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0010)()
};
DUMPER7_ASSERTS_WBP_MenuPage_Home_C_UpdateRankedMatchmakingState;

// Function WBP_MenuPage_Home.WBP_MenuPage_Home_C.__67acbcfc-4cde-cba5-1331-7fbb13c67d0e_SourceToDest
// 0x0005 (0x0005 - 0x0000)
struct WBP_MenuPage_Home_C___67acbcfc_4cde_cba5_1331_7fbb13c67d0e_SourceToDest final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConnectedToFrontend_IsConnected;        // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Ranked_Match_Entry_Available_IsEnabled; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_MenuPage_Home_C___67acbcfc_4cde_cba5_1331_7fbb13c67d0e_SourceToDest;

// Function WBP_MenuPage_Home.WBP_MenuPage_Home_C.__e8d1c78a-457e-61e5-2838-8b8711ad3ab5_SourceToDest
// 0x0006 (0x0006 - 0x0000)
struct WBP_MenuPage_Home_C___e8d1c78a_457e_61e5_2838_8b8711ad3ab5_SourceToDest final
{
public:
	bool                                          IsVisible_0;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConnectedToFrontend_IsConnected;        // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Features_State_Feedback_Visibility_IsFeedbackVisible; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetAvailabilityFeedbackDetailsButtonVisibility_isVisible; // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_MenuPage_Home_C___e8d1c78a_457e_61e5_2838_8b8711ad3ab5_SourceToDest;

// Function WBP_MenuPage_Home.WBP_MenuPage_Home_C.BP_GetDesiredFocusTarget
// 0x0050 (0x0050 - 0x0000)
struct WBP_MenuPage_Home_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        Buttons;                                           // 0x0008(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_MenuPage_Home_C_BP_GetDesiredFocusTarget;

// Function WBP_MenuPage_Home.WBP_MenuPage_Home_C.SetAvailabilityFeedbackDetailsButtonVisibility
// 0x0004 (0x0004 - 0x0000)
struct WBP_MenuPage_Home_C_SetAvailabilityFeedbackDetailsButtonVisibility final
{
public:
	bool                                          isConnectedFrontend;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isFeaturesStatesFeedbackVisible;                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsVisible_0;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_MenuPage_Home_C_SetAvailabilityFeedbackDetailsButtonVisibility;

}

