#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Store_Item

#include "Basic.hpp"

#include "SOSBindings_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EFrameType_structs.hpp"
#include "Runtime_structs.hpp"
#include "UMG_structs.hpp"
#include "Struct_QualityTier_structs.hpp"


namespace SDK::Params
{

// Function WBP_Store_Item.WBP_Store_Item_C.ExecuteUbergraph_WBP_Store_Item
// 0x000C (0x000C - 0x0000)
struct WBP_Store_Item_C_ExecuteUbergraph_WBP_Store_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Store_Item_C_ExecuteUbergraph_WBP_Store_Item;

// Function WBP_Store_Item.WBP_Store_Item_C.IsInfosHidden
// 0x0001 (0x0001 - 0x0000)
struct WBP_Store_Item_C_IsInfosHidden final
{
public:
	bool                                          IsHidden;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Store_Item_C_IsInfosHidden;

// Function WBP_Store_Item.WBP_Store_Item_C.PlayVideoSequence
// 0x0088 (0x0088 - 0x0000)
struct WBP_Store_Item_C_PlayVideoSequence final
{
public:
	bool                                          VideoFound;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPrimaryAssetType>              K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FShopItem                              CallFunc_Get_Item_from_SOSID_Output;               // 0x0020(0x0060)()
	bool                                          CallFunc_Get_Item_from_SOSID_Found;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPF_DoesPrimaryAssetTypesContain_ReturnValue; // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Store_Item_C_PlayVideoSequence;

// Function WBP_Store_Item.WBP_Store_Item_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Store_Item_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Store_Item_C_PreConstruct;

// Function WBP_Store_Item.WBP_Store_Item_C.SetFrameType
// 0x0001 (0x0001 - 0x0000)
struct WBP_Store_Item_C_SetFrameType final
{
public:
	EFrameType                                    FrameType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Store_Item_C_SetFrameType;

// Function WBP_Store_Item.WBP_Store_Item_C.SetItemName
// 0x0048 (0x0048 - 0x0000)
struct WBP_Store_Item_C_SetItemName final
{
public:
	TSoftObjectPtr<class UObject>                 Asset;                                             // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, UObjectWrapper, HasGetValueTypeHash)
	class FText                                   CallFunc_GetItemNameFromSoftAssetRef_Display_Name; // 0x0028(0x0010)()
	class FText                                   CallFunc_GetItemNameFromSoftAssetRef_Description;  // 0x0038(0x0010)()
};
DUMPER7_ASSERTS_WBP_Store_Item_C_SetItemName;

// Function WBP_Store_Item.WBP_Store_Item_C.SetItemNameBorderColor
// 0x0098 (0x0098 - 0x0000)
struct WBP_Store_Item_C_SetItemNameBorderColor final
{
public:
	ESOSQualityTier                               QualityTier;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonTextStyle>           Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_QualityTier                    CallFunc_GetQualityTierDataFromEnum_ReturnValue;   // 0x0018(0x0068)(HasGetValueTypeHash)
	TSubclassOf<class UCommonTextStyle>           Temp_class_Variable_1;                             // 0x0080(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonTextStyle>           K2Node_Select_Default;                             // 0x0090(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Store_Item_C_SetItemNameBorderColor;

// Function WBP_Store_Item.WBP_Store_Item_C.SetQualityTier
// 0x0001 (0x0001 - 0x0000)
struct WBP_Store_Item_C_SetQualityTier final
{
public:
	ESOSQualityTier                               QualityTier;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Store_Item_C_SetQualityTier;

// Function WBP_Store_Item.WBP_Store_Item_C.SetSOSBindingsStoreItemViewModel
// 0x0028 (0x0028 - 0x0000)
struct WBP_Store_Item_C_SetSOSBindingsStoreItemViewModel final
{
public:
	class USOSBindingsStoreItemViewModel*         viewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Store_Item_C_SetSOSBindingsStoreItemViewModel;

// Function WBP_Store_Item.WBP_Store_Item_C.SetThumbnailFromSOSId
// 0x0148 (0x0148 - 0x0000)
struct WBP_Store_Item_C_SetThumbnailFromSOSId final
{
public:
	class FString                                 SOSID;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FShopItem                              Asset;                                             // 0x0010(0x0060)(Edit, BlueprintVisible)
	struct FShopItem                              CallFunc_Get_Item_from_SOSID_Output;               // 0x0070(0x0060)()
	bool                                          CallFunc_Get_Item_from_SOSID_Found;                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_BPF_ResolveObject_ReturnValue;            // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UColorPaletteDataAsset*                 K2Node_DynamicCast_AsColor_Palette_Data_Asset;     // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLinearColor>                   CallFunc_BPF_GetPaletteColorArray__outColors;      // 0x00F0(0x0010)(ReferenceParm)
	class UPlayerProfileSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 CallFunc_BPF_GetAssetFromSosId_ReturnValue;        // 0x0108(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_BPF_ResolveObject_ReturnValue_1;          // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USCCharacterPartDataAsset*              K2Node_DynamicCast_AsSCCharacter_Part_Data_Asset;  // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Store_Item_C_SetThumbnailFromSOSId;

// Function WBP_Store_Item.WBP_Store_Item_C.SetupFromAssetOnly
// 0x0068 (0x0068 - 0x0000)
struct WBP_Store_Item_C_SetupFromAssetOnly final
{
public:
	TSoftObjectPtr<class UObject>                 Asset;                                             // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
	ESOSQualityTier                               QualityTier;                                       // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_BPF_ResolveObject_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UColorPaletteDataAsset*                 K2Node_DynamicCast_AsColor_Palette_Data_Asset;     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USCCharacterPartDataAsset*              K2Node_DynamicCast_AsSCCharacter_Part_Data_Asset;  // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLinearColor>                   CallFunc_BPF_GetPaletteColorArray__outColors;      // 0x0058(0x0010)(ReferenceParm)
};
DUMPER7_ASSERTS_WBP_Store_Item_C_SetupFromAssetOnly;

// Function WBP_Store_Item.WBP_Store_Item_C.__e72274fe-46b2-7c89-4def-01b6761ed6d8_SourceToDest
// 0x000C (0x000C - 0x0000)
struct WBP_Store_Item_C___e72274fe_46b2_7c89_4def_01b6761ed6d8_SourceToDest final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Store_Item_C___e72274fe_46b2_7c89_4def_01b6761ed6d8_SourceToDest;

// Function WBP_Store_Item.WBP_Store_Item_C.IsPalette
// 0x0002 (0x0002 - 0x0000)
struct WBP_Store_Item_C_IsPalette final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Store_Item_C_IsPalette;

}

