#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Store_Item_AssociateBundle

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Store_Item_AssociateBundle.WBP_Store_Item_AssociateBundle_C.ExecuteUbergraph_WBP_Store_Item_AssociateBundle
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_Store_Item_AssociateBundle_C_ExecuteUbergraph_WBP_Store_Item_AssociateBundle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_BundleDataAsset_C*                  K2Node_DynamicCast_AsBP_Bundle_Data_Asset;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0028(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0038(0x0010)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0050(0x0010)()
	class FString                                 K2Node_CustomEvent_RowName;                        // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UBP_BundleDataAsset_C>   CallFunc_GetBundleDataAssetFromFriendlyName_Out_Row; // 0x0078(0x0028)(HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x00A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Store_Item_AssociateBundle_C_ExecuteUbergraph_WBP_Store_Item_AssociateBundle;

// Function WBP_Store_Item_AssociateBundle.WBP_Store_Item_AssociateBundle_C.OnBundleVMFound
// 0x0010 (0x0010 - 0x0000)
struct WBP_Store_Item_AssociateBundle_C_OnBundleVMFound final
{
public:
	class USOSBindingsStoreBundleViewModel*       BundleVM;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStoreFeatureEnabled_IsStoreEnabled;    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Store_Item_AssociateBundle_C_OnBundleVMFound;

// Function WBP_Store_Item_AssociateBundle.WBP_Store_Item_AssociateBundle_C.OnFriendlyName
// 0x0010 (0x0010 - 0x0000)
struct WBP_Store_Item_AssociateBundle_C_OnFriendlyName final
{
public:
	class FString                                 RowName;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Store_Item_AssociateBundle_C_OnFriendlyName;

// Function WBP_Store_Item_AssociateBundle.WBP_Store_Item_AssociateBundle_C.OnLoaded_12055FFB4036042CA6E9D2BD96D74A66
// 0x0008 (0x0008 - 0x0000)
struct WBP_Store_Item_AssociateBundle_C_OnLoaded_12055FFB4036042CA6E9D2BD96D74A66 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Store_Item_AssociateBundle_C_OnLoaded_12055FFB4036042CA6E9D2BD96D74A66;

// Function WBP_Store_Item_AssociateBundle.WBP_Store_Item_AssociateBundle_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Store_Item_AssociateBundle_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Store_Item_AssociateBundle_C_PreConstruct;

// Function WBP_Store_Item_AssociateBundle.WBP_Store_Item_AssociateBundle_C.SetBundleVisible
// 0x0020 (0x0020 - 0x0000)
struct WBP_Store_Item_AssociateBundle_C_SetBundleVisible final
{
public:
	bool                                          BundleVisible;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USOSBindingsStoreBundleViewModel*       FoundBundleVM;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USOSBindingsStoreBundleViewModel*       CallFunc_GetCatalogBundleFromID_BundleVM;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Store_Item_AssociateBundle_C_SetBundleVisible;

// Function WBP_Store_Item_AssociateBundle.WBP_Store_Item_AssociateBundle_C.SetSOSBindingsStoreBundleViewModel
// 0x0028 (0x0028 - 0x0000)
struct WBP_Store_Item_AssociateBundle_C_SetSOSBindingsStoreBundleViewModel final
{
public:
	class USOSBindingsStoreBundleViewModel*       viewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Store_Item_AssociateBundle_C_SetSOSBindingsStoreBundleViewModel;

// Function WBP_Store_Item_AssociateBundle.WBP_Store_Item_AssociateBundle_C.SetupWidgetFromBundleDataAsset
// 0x0030 (0x0030 - 0x0000)
struct WBP_Store_Item_AssociateBundle_C_SetupWidgetFromBundleDataAsset final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default;                             // 0x0008(0x0028)(UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Store_Item_AssociateBundle_C_SetupWidgetFromBundleDataAsset;

// Function WBP_Store_Item_AssociateBundle.WBP_Store_Item_AssociateBundle_C.__8667be57-4122-7f8e-f940-6ab548d811ad_SourceToDest
// 0x0010 (0x0010 - 0x0000)
struct WBP_Store_Item_AssociateBundle_C___8667be57_4122_7f8e_f940_6ab548d811ad_SourceToDest final
{
public:
	class USOSBindingsStoreBundleViewModel*       BundleVM;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USOSBindingsStoreBundleViewModel*       CallFunc_GetCatalogBundleFromID_BundleVM;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Store_Item_AssociateBundle_C___8667be57_4122_7f8e_f940_6ab548d811ad_SourceToDest;

}

