#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CamLockBallToggleIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCCore_structs.hpp"
#include "SCCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CamLockBallToggleIcon.WBP_CamLockBallToggleIcon_C
// 0x0040 (0x0C30 - 0x0BF0)
class UWBP_CamLockBallToggleIcon_C final : public USCUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Sleeping_Anim;                                     // 0x0BF8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Inactive_Anim;                                     // 0x0C00(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Active_Anim;                                       // 0x0C08(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             Description_OnOrOFF;                               // 0x0C10(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LockImage_Active;                                  // 0x0C18(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCameraLockBallService*                 LockBallCameraService;                             // 0x0C20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BindActivationToCharacter(class APawn* OldPawn, class APawn* NewPawn);
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_CamLockBallToggleIcon(int32 EntryPoint);
	void OnLockBallStateUpdate(EServiceStateUpdate eStateUpdate);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_CamLockBallToggleIcon_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_CamLockBallToggleIcon_C")
	}
	static class UWBP_CamLockBallToggleIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CamLockBallToggleIcon_C>();
	}
};
DUMPER7_ASSERTS_UWBP_CamLockBallToggleIcon_C;

}

