#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Control_MappingConflict

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Control_MappingConflict.WBP_Control_MappingConflict_C
// 0x0030 (0x0C20 - 0x0BF0)
class UWBP_Control_MappingConflict_C final : public USCUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_InputAction_Data_C*                 BP_InputAction;                                    // 0x0BF8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Description;                                       // 0x0C00(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_90;                                  // 0x0C08(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UActionMappingViewModel*                ActionMappingViewModel;                            // 0x0C10(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Control_MappingConflict(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetActionMappingViewModel(class UActionMappingViewModel* viewModel);
	void SetMappingID(const struct FMappingID& MappingID);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Control_MappingConflict_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Control_MappingConflict_C")
	}
	static class UWBP_Control_MappingConflict_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Control_MappingConflict_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Control_MappingConflict_C;

}

