#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerBanner_Indicators

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCCore_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlayerBanner_Indicators.WBP_PlayerBanner_Indicators_C
// 0x0080 (0x0C70 - 0x0BF0)
class UWBP_PlayerBanner_Indicators_C final : public USCUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Icon_SquadLeader;                                  // 0x0BF8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_SquadMember;                                  // 0x0C00(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CaptainIcon_C*                     WBP_CaptainIcon;                                   // 0x0C08(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ARuntimeCharacter*                      As_Runtime_Character;                              // 0x0C10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        CharacterUpOffset;                                 // 0x0C18(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_MVP;                                       // 0x0C20(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_VM_Match_C*                         BP_VM_Match;                                       // 0x0C28(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class ARuntimePlayerState*                    RuntimePlayerState;                                // 0x0C30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMatchPlayerViewModel*                  Match_Player_VM;                                   // 0x0C38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchPlayerViewModel*                  MatchPlayerViewModel;                              // 0x0C40(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_PlayerScoreViewModel_C*             BP_PlayerScoreViewModel;                           // 0x0C48(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAlly;                                            // 0x0C50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C51[0x7];                                      // 0x0C51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARuntimePlayerState*                    As_Runtime_Player_State;                           // 0x0C58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCaptain;                                         // 0x0C60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSquadMember;                                     // 0x0C61(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSquadLeader;                                     // 0x0C62(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_PlayerBanner_Indicators(int32 EntryPoint);
	void OnMatchViewModelSet(class UBP_VM_Match_C* MatchViewModel);
	void OnPlayerStateSet(class ARuntimePlayerState* PlayerState);
	void PreConstruct(bool IsDesignTime);
	void SetBP_PlayerScoreViewModel(class UBP_PlayerScoreViewModel_C* viewModel);
	void SetCaptainVisibility(bool IsCaptain_0);
	void SetMatchPlayerViewModel(class UMatchPlayerViewModel* viewModel);
	void SetSquadLeaderVisibility(bool IsSquadLeader_0);
	void SetSquadMemberVisibility(bool IsSquadMember_0);
	void SetTeam(int32 TeamIndex);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_PlayerBanner_Indicators_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_PlayerBanner_Indicators_C")
	}
	static class UWBP_PlayerBanner_Indicators_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlayerBanner_Indicators_C>();
	}
};
DUMPER7_ASSERTS_UWBP_PlayerBanner_Indicators_C;

}

