#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TabNavigation_Tab

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "WBP_TabAbstract_Parent_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TabNavigation_Tab.WBP_TabNavigation_Tab_C
// 0x00B0 (0x0EA0 - 0x0DF0)
class UWBP_TabNavigation_Tab_C final : public UWBP_TabAbstract_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_TabNavigation_Tab_C;            // 0x0DE8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FocusAnim;                                         // 0x0DF0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                BorderBG;                                          // 0x0DF8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_BottomLine;                                    // 0x0E00(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               TabContent;                                        // 0x0E08(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TabText;                                           // 0x0E10(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   TabTitle;                                          // 0x0E18(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)
	struct FSlateFontInfo                         TextFont;                                          // 0x0E28(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWBP_TabNavigation_Tab_C* TabWidget)> OnTabClicked;          // 0x0E88(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BPE_OnClicked();
	void Construct();
	void ExecuteUbergraph_WBP_TabNavigation_Tab(int32 EntryPoint);
	void FocusButton(bool ButtonFocused);
	void GotoStateTransitionFlow();
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_TabNavigation_Tab_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_TabNavigation_Tab_C")
	}
	static class UWBP_TabNavigation_Tab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TabNavigation_Tab_C>();
	}
};
DUMPER7_ASSERTS_UWBP_TabNavigation_Tab_C;

}

