#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Popup_SP_PremiumReview

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Popup_SP_PremiumReview.WBP_Popup_SP_PremiumReview_C
// 0x0090 (0x0CF0 - 0x0C60)
class UWBP_Popup_SP_PremiumReview_C final : public USCPopupWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BG;                                                // 0x0C68(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Corners;                                        // 0x0C70(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Gradient;                                       // 0x0C78(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ListView_C*                        ListViewOptions;                                   // 0x0C80(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ListView_C*                        LV_PremiumItems;                                   // 0x0C88(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Common_BackgoundPopup_C*           WBP_Common_BackgoundPopup;                         // 0x0C90(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Store_MoreToSee_C*                 WBP_Store_MoreToSee;                               // 0x0C98(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USCPopupViewModel*                      SCPopupViewModel;                                  // 0x0CA0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_Store_Item_C*>              ItemWidgets;                                       // 0x0CA8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UCommonTextBlock*                       PopupTitle;                                        // 0x0CB8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_StoreViewModel_C*                   BP_StoreViewModel;                                 // 0x0CC0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_SeasonPassViewModel_C*              BP_SeasonPassViewModel;                            // 0x0CC8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_SeasonPassTierViewModel_C*>  TiersArrayToDisplay;                               // 0x0CD0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         TotalSurplusItemAmount;                            // 0x0CE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Popup_SP_PremiumReview_LV_PremiumItems_K2Node_ComponentBoundEvent_0_SCDynamicMulticast__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_Popup_SP_PremiumReview(int32 EntryPoint);
	void On_Options_ListView_Changed();
	void PreConstruct(bool IsDesignTime);
	void RevealContent();
	void RevealMoreToSeeWidget();
	void SequenceEvent();
	void SequenceEvent__ENTRYPOINTWBP_Popup_SP_PremiumReview();
	void SetBP_SeasonPassViewModel(class UBP_SeasonPassViewModel_C* viewModel);
	void SetBPSeasonPassVM(class UBP_SeasonPassViewModel_C* BPSeasonPassVM);
	void SetSCPopupViewModel(class USCPopupViewModel* viewModel);
	void UpdateFocusColor(const struct FLinearColor& Override);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Popup_SP_PremiumReview_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Popup_SP_PremiumReview_C")
	}
	static class UWBP_Popup_SP_PremiumReview_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Popup_SP_PremiumReview_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Popup_SP_PremiumReview_C;

}

