#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SeasonEnd_Page

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "SOS_structs.hpp"
#include "UIRankedLeagues_structs.hpp"


namespace SDK::Params
{

// Function WBP_SeasonEnd_Page.WBP_SeasonEnd_Page_C.ExecuteUbergraph_WBP_SeasonEnd_Page
// 0x0030 (0x0030 - 0x0000)
struct WBP_SeasonEnd_Page_C_ExecuteUbergraph_WBP_SeasonEnd_Page final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0008(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          K2Node_CustomEvent_AkEvent;                        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetOwningPlayerCameraManager_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_SeasonEnd_Page_C_ExecuteUbergraph_WBP_SeasonEnd_Page;

// Function WBP_SeasonEnd_Page.WBP_SeasonEnd_Page_C.OnPlayerProfileViewModelChanged
// 0x0078 (0x0078 - 0x0000)
struct WBP_SeasonEnd_Page_C_OnPlayerProfileViewModelChanged final
{
public:
	class UBP_PlayerPrivateProfileViewModel_C*    VM;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0008(0x0010)()
	ESOSGameType                                  CallFunc_GetSeasonEndStatsGameMode_GameMode;       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIRankedLeagues                       CallFunc_GetCurrentRankUIData_LeagueUIData;        // 0x0020(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_SeasonEnd_Page_C_OnPlayerProfileViewModelChanged;

// Function WBP_SeasonEnd_Page.WBP_SeasonEnd_Page_C.OnStoreViewModelChanged
// 0x0040 (0x0040 - 0x0000)
struct WBP_SeasonEnd_Page_C_OnStoreViewModelChanged final
{
public:
	class UBP_StoreViewModel_C*                   VM;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInInterSeason_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetPreviousSeasonName_Name;               // 0x0010(0x0010)()
	class FText                                   CallFunc_GetCurrentSeasonName_Name;                // 0x0020(0x0010)()
	class FText                                   CallFunc_SelectText_ReturnValue;                   // 0x0030(0x0010)()
};
DUMPER7_ASSERTS_WBP_SeasonEnd_Page_C_OnStoreViewModelChanged;

// Function WBP_SeasonEnd_Page.WBP_SeasonEnd_Page_C.Post Event
// 0x0008 (0x0008 - 0x0000)
struct WBP_SeasonEnd_Page_C_Post_Event final
{
public:
	class UAkAudioEvent*                          AkEvent;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_SeasonEnd_Page_C_Post_Event;

// Function WBP_SeasonEnd_Page.WBP_SeasonEnd_Page_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_SeasonEnd_Page_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_SeasonEnd_Page_C_PreConstruct;

}

