#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CustoKit_ColorDisplay

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_CustoKit_ColorDisplay.WBP_CustoKit_ColorDisplay_C.ExecuteUbergraph_WBP_CustoKit_ColorDisplay
// 0x0008 (0x0008 - 0x0000)
struct WBP_CustoKit_ColorDisplay_C_ExecuteUbergraph_WBP_CustoKit_ColorDisplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CustoKit_ColorDisplay_C_ExecuteUbergraph_WBP_CustoKit_ColorDisplay;

// Function WBP_CustoKit_ColorDisplay.WBP_CustoKit_ColorDisplay_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CustoKit_ColorDisplay_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CustoKit_ColorDisplay_C_PreConstruct;

// Function WBP_CustoKit_ColorDisplay.WBP_CustoKit_ColorDisplay_C.SetColors
// 0x0034 (0x0034 - 0x0000)
struct WBP_CustoKit_ColorDisplay_C_SetColors final
{
public:
	struct FLinearColor                           Color1;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color2;                                            // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color3;                                            // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ColorCountClamped;                                 // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CustoKit_ColorDisplay_C_SetColors;

// Function WBP_CustoKit_ColorDisplay.WBP_CustoKit_ColorDisplay_C.SetColorsFromArray
// 0x0018 (0x0018 - 0x0000)
struct WBP_CustoKit_ColorDisplay_C_SetColorsFromArray final
{
public:
	TArray<struct FLinearColor>                   Colors;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CustoKit_ColorDisplay_C_SetColorsFromArray;

// Function WBP_CustoKit_ColorDisplay.WBP_CustoKit_ColorDisplay_C.SetOneColor
// 0x0010 (0x0010 - 0x0000)
struct WBP_CustoKit_ColorDisplay_C_SetOneColor final
{
public:
	struct FLinearColor                           MainColor;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CustoKit_ColorDisplay_C_SetOneColor;

}

