#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TabAbstract_Parent

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_TabAbstract_Parent.WBP_TabAbstract_Parent_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_TabAbstract_Parent_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TabAbstract_Parent_C_PreConstruct;

// Function WBP_TabAbstract_Parent.WBP_TabAbstract_Parent_C.FocusButton
// 0x0002 (0x0002 - 0x0000)
struct WBP_TabAbstract_Parent_C_FocusButton final
{
public:
	bool                                          ButtonFocused;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TabAbstract_Parent_C_FocusButton;

// Function WBP_TabAbstract_Parent.WBP_TabAbstract_Parent_C.ExecuteUbergraph_WBP_TabAbstract_Parent
// 0x0008 (0x0008 - 0x0000)
struct WBP_TabAbstract_Parent_C_ExecuteUbergraph_WBP_TabAbstract_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TabAbstract_Parent_C_ExecuteUbergraph_WBP_TabAbstract_Parent;

}

