#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MenuPage_Home

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_MenuPage_Parent_classes.hpp"
#include "UMG_structs.hpp"
#include "SOS_structs.hpp"
#include "SCCore_structs.hpp"
#include "Runtime_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MenuPage_Home.WBP_MenuPage_Home_C
// 0x00D0 (0x0D50 - 0x0C80)
class UWBP_MenuPage_Home_C final : public UWBP_MenuPage_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_MenuPage_Home_C;                // 0x0C78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetSwitcher*                        BetaQRCodeSwitcher;                                // 0x0C80(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GenericButton_InfoWarning_C*       BTN_AvailableFeaturesDetails;                      // 0x0C88(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_ButtonFlow_C*                 Btn_CustomMatch;                                   // 0x0C90(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_ButtonFlow_C*                 Btn_News;                                          // 0x0C98(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_ButtonFlow_C*                 Btn_Parameter;                                     // 0x0CA0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_ButtonFlow_C*                 Btn_PlayableIntro;                                 // 0x0CA8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_ButtonFlow_C*                 Btn_Practice;                                      // 0x0CB0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_ButtonFlow_C*                 Btn_QuickMatch;                                    // 0x0CB8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_ButtonFlow_C*                 Btn_RankedMatch;                                   // 0x0CC0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Buttons_VB;                                        // 0x0CC8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BetaQRCode_C*                      WBP_BetaQRCode_71;                                 // 0x0CD0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BetaWarning_Notification_C*        WBP_BetaWarning_Notification_58;                   // 0x0CD8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Challenges_Daily_C*                WBP_Challenges_Daily_66;                           // 0x0CE0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_Home_LiveFeed_C*              WBP_Menu_Home_LiveFeed;                            // 0x0CE8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menus_LigibilityBackground_C*      WBP_Menus_LigibilityBackground;                    // 0x0CF0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UU_QrCode_C*                       WBP_UU_QrCode;                                     // 0x0CF8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_VM_CustomPartySystem_C*             BP_VM_CustomPartySystem;                           // 0x0D00(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_VM_CustomAuthentification_C*        BP_VM_CustomAuthentification;                      // 0x0D08(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_MatchmakingViewModel_C*             BP_MatchmakingViewModel;                           // 0x0D10(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_CustomMatchSystemViewModel_C*       BP_CustomMatchSystemViewModel;                     // 0x0D18(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentPlayerLevel;                                // 0x0D20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D24[0x4];                                      // 0x0D24(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PlayerPrivateProfileViewModel_C*    BP_PlayerPrivateProfileViewModel;                  // 0x0D28(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_AvailableFeaturesViewmodel_C*       BP_AvailableFeaturesViewmodel;                     // 0x0D30(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_PlayerProgression;                         // 0x0D38(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGlobalMenuContextViewModel*            GlobalMenuContextViewModel;                        // 0x0D40(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWelcomeFlowViewModel*                  WelcomeFlowViewModel;                              // 0x0D48(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void __Setter_CurrentPlayerLevel(int32 NewValue);
	void BndEvt__WBP_MenuPage_Home_Btn_News_K2Node_ComponentBoundEvent_0_ButtonUserWidgetClickDelegate__DelegateSignature(class USCButtonUserWidget* _button, bool _bWithMouse);
	void BPE_OnActionPressed(const class USCInputAction* _action, const struct FInputActionState& _listenerState);
	void BPE_OnMenuTransitionIn(EMenuTransitions _eTransition, TSubclassOf<class USCMenuWidget> _ePrevMenu);
	void BPE_OnMenuTransitionOut(EMenuTransitions _eTransition, TSubclassOf<class USCMenuWidget> _eNewMenu);
	void Construct();
	void ExecuteUbergraph_WBP_MenuPage_Home(int32 EntryPoint);
	void OnAnyOnlineBoolChanged(bool _bAnyBool);
	void OnAnyOnlineInfoChanged();
	void OnCustomMatchStatusChange(ESOSClientCustomMatchState CustomMatchState);
	void OnMatchmakingStatusChanged(ESOSClientMatchmakingStatus Status);
	void OnPlayerLevelChange(int32 PlayerLevel);
	void OnSeasonDeadlineReached();
	void RefreshFocusIfRankedMatchIsEnabled(bool IsEnabledRefresh);
	void SetUUQrCodeVisibility();
	void UpdateCustomMatchButtonAvailability(bool bIsConnectedToFronted, bool bIsInLobby, bool bIsPartyOwner, ESOSClientMatchmakingStatus InMatchMakingStatus, bool IsAnyPlayerReconnectToRanked);
	void UpdateMMBtnText();
	void UpdateRankedMatchmakingState();

	void __67acbcfc_4cde_cba5_1331_7fbb13c67d0e_SourceToDest(bool* IsEnabled) const;
	void __e8d1c78a_457e_61e5_2838_8b8711ad3ab5_SourceToDest(bool* IsVisible_0) const;
	class UWidget* BP_GetDesiredFocusTarget() const;
	void SetAvailabilityFeedbackDetailsButtonVisibility(bool isConnectedFrontend, bool isFeaturesStatesFeedbackVisible, bool* IsVisible_0) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_MenuPage_Home_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_MenuPage_Home_C")
	}
	static class UWBP_MenuPage_Home_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MenuPage_Home_C>();
	}
};
DUMPER7_ASSERTS_UWBP_MenuPage_Home_C;

}

