#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SocialPanel_PartyMemberButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "WBP_Abstract_GenericButton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SocialPanel_PartyMemberButton.WBP_SocialPanel_PartyMemberButton_C
// 0x0080 (0x0E40 - 0x0DC0)
class UWBP_SocialPanel_PartyMemberButton_C final : public UWBP_Abstract_GenericButton_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_SocialPanel_PartyMemberButton_C; // 0x0DC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BG_BtnEmpty;                                       // 0x0DC8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Parent;                                     // 0x0DD0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Icon_Add;                                      // 0x0DD8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Icon_Captain;                                  // 0x0DE0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_ProfilePic;                                    // 0x0DE8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_SupremeParent;                             // 0x0DF0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Filled;                                   // 0x0DF8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BtnSelector_C*                     WBP_BTNSelector_Empty;                             // 0x0E00(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BtnSelector_C*                     WBP_BTNSelector_Filled;                            // 0x0E08(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerBanner_Sound_C*              WBP_PlayerBanner_Sound;                            // 0x0E10(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsEmpty;                                           // 0x0E18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E19[0x7];                                      // 0x0E19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_VM_CustomPartyMember_C*             BP_VM_CustomPartyMember;                           // 0x0E20(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsInSocialPanel;                                   // 0x0E28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E29[0x7];                                      // 0x0E29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_VM_CustomVoiceChat_C*               BP_VM_CustomVoiceChat;                             // 0x0E30(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVoiceChannelMemberViewModel*           VoiceChannelMemberViewModel;                       // 0x0E38(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateVoiceChannelMember();
	void SetVoiceChannelMemberViewModel(class UVoiceChannelMemberViewModel* viewModel);
	void SetSelectedStyle(bool Selected);
	void SetEmptyState(bool IsEmpty_0);
	void SetBP_VM_CustomPartyMember(class UBP_VM_CustomPartyMember_C* viewModel);
	void SetAvatarFromItemId(const class FString& SOSID);
	void PreConstruct(bool IsDesignTime);
	void OnVoiceChannelMembersChanged(TArray<class UVoiceChannelMemberViewModel*>& VoiceChannelMemberVM);
	void OnVoiceChannelChanged(class UVoiceChannelViewModel* VoiceChannelVM);
	void OnSquadPlayerChanged(class UBP_VM_CustomPartyMember_C* CustomPartyMemberVM);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void FocusButton(bool ButtonFocused);
	void ExecuteUbergraph_WBP_SocialPanel_PartyMemberButton(int32 EntryPoint);

	void __49f0ca95_4783_e875_621a_68a9fb10336c_SourceToDest(bool* _isLocalPlayerDeafen) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_SocialPanel_PartyMemberButton_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_SocialPanel_PartyMemberButton_C")
	}
	static class UWBP_SocialPanel_PartyMemberButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SocialPanel_PartyMemberButton_C>();
	}
};
DUMPER7_ASSERTS_UWBP_SocialPanel_PartyMemberButton_C;

}

