#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Customization_Item_Thumbnail

#include "Basic.hpp"

#include "SCCharacterCustomization_structs.hpp"
#include "ThumbnailAssetMode_structs.hpp"
#include "Engine_structs.hpp"
#include "StructUtilsEngine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "WBP_Abstract_Common_classes.hpp"
#include "ECustoExtraInfo_structs.hpp"
#include "ThumbnailSceneMode_structs.hpp"
#include "UMG_structs.hpp"
#include "SOSBindings_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Customization_Item_Thumbnail.WBP_Customization_Item_Thumbnail_C
// 0x0420 (0x1020 - 0x0C00)
class UWBP_Customization_Item_Thumbnail_C final : public UWBP_Abstract_Common_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_Customization_Item_Thumbnail_C; // 0x0C00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BKG;                                               // 0x0C08(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                DebugOverlay;                                      // 0x0C10(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DebugOverlay_Text;                                 // 0x0C18(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Item;                                          // 0x0C20(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemThumbnailComponent*                ItemThumbnailComponent;                            // 0x0C28(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_IMG;                                      // 0x0C30(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         BaseScale;                                         // 0x0C38(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           UICategoryTagSubMenu;                              // 0x0C3C(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C44[0x4];                                      // 0x0C44(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         ThumbnailRenderSequence;                           // 0x0C48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UObject*                                LoadedItem;                                        // 0x0C50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UObject>>         EmptyAssets;                                       // 0x0C58(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAnimSequence*                          Thumbnail_Anim_Sequence;                           // 0x0C68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        ThumbnailAnimTime;                                 // 0x0C70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasLoadedAnimation;                                // 0x0C78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C79[0x7];                                      // 0x0C79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UThumbnailCustomizationIds*             BodyPartsTable;                                    // 0x0C80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EThumbnailAssetMode                           AssetMode;                                         // 0x0C88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C89[0x7];                                      // 0x0C89(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSCCharacterCustomizationDescription   PresetCusto;                                       // 0x0C90(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class ULevelSequence>          PresetViewSequence;                                // 0x0D80(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           PresetAnimSequence;                                // 0x0DA8(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	float                                         PresetAnimTime;                                    // 0x0DD0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD4[0x4];                                      // 0x0DD4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              PresetDefaultTexture;                              // 0x0DD8(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	class UTexture*                               ThumbnailImage;                                    // 0x0E00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              IconNone;                                          // 0x0E08(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Icon_Error;                                        // 0x0E30(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bIsFocused;                                        // 0x0E58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E59[0x7];                                      // 0x0E59(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSCCustomizationId                     EmptyPartId;                                       // 0x0E60(0x0120)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture>                EmptyImage;                                        // 0x0F80(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	class UTexture2D*                             ThumbnailBackground;                               // 0x0FA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MannequinColor;                                    // 0x0FB0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 ItemReference;                                     // 0x0FC0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture>                Icon_Title;                                        // 0x0FE8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	bool                                          RetryVideoWhenAssetLoaded;                         // 0x1010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1011[0x3];                                     // 0x1011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LastRenderedView;                                  // 0x1014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_Customization_Item_Thumbnail(int32 EntryPoint);
	class FText Get_DebugOverlay_Text();
	ESlateVisibility Get_DebugOverlay_Visibility();
	const struct FSCCharacterCustomizationDescription GetCurrentPlayerCusto();
	class FString GetDebugText();
	void GetQualityTierBackground(ESOSQualityTier _qualityTier, class UTexture2D** ThumbnailBackground_0, struct FLinearColor* Color);
	void GetThumbnailSetup(TSoftObjectPtr<class ULevelSequence>* _viewSequence, TSoftObjectPtr<class UAnimSequence>* _animSequence, float* Anim_Time, TSoftObjectPtr<class UTexture>* Image, EThumbnailSceneMode* _sceneMode, class FString* _errorMessage);
	double GetVideoTime();
	void LoadAssets();
	void OnAssetUpdated(TSoftObjectPtr<class UObject> _asset);
	void OnBindAsset(ESOSQualityTier _qualityTier);
	void OnBindEmptyImage(TSoftObjectPtr<class UTexture> Image);
	void OnBindEmptyPart(const struct FSCCustomizationId& EmptyPartId_0);
	void OnBindPreset(const struct FSCCharacterCustomizationDescription& PresetCusto_0);
	void OnBindSlot(const TSoftObjectPtr<class UObject>& _asset, const struct FSCCustomizationId& _partID, ESOSQualityTier _qualityTier);
	void OnFocusChanged(bool bIsFocused_0);
	void OnLoaded_6B0B367741DAF66161E93795596A7E5C(class UObject* Loaded);
	void OnLoaded_D5E9B53F4321C2F289F3C9961B06F993(class UObject* Loaded);
	void OnLoaded_D5E9B53F4321C2F289F3C996596932F9(class UObject* Loaded);
	void OnLoaded_D5E9B53F4321C2F289F3C9966EA53E30(class UObject* Loaded);
	int32 OnSetupView(class UItemThumbnailScene* Scene);
	void OverrideExtraInfo(const TArray<struct FInstancedStruct>& Target, const TArray<struct FInstancedStruct>& Source, ECustoExtraInfo ExtraInfo);
	void RetryPlayVideo();
	void SetSoftImage();
	void TryPlayVideo();
	void UpdatePlaybackState();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Customization_Item_Thumbnail_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Customization_Item_Thumbnail_C")
	}
	static class UWBP_Customization_Item_Thumbnail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Customization_Item_Thumbnail_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Customization_Item_Thumbnail_C;

}

