#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Common_Generic_Warning

#include "Basic.hpp"

#include "UIBaseColors_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Common_Generic_Warning.WBP_Common_Generic_Warning_C.ExecuteUbergraph_WBP_Common_Generic_Warning
// 0x0300 (0x0300 - 0x0000)
struct WBP_Common_Generic_Warning_C_ExecuteUbergraph_WBP_Common_Generic_Warning final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUIBaseColors                          CallFunc_GetUIColors_UI_BaseColors;                // 0x0004(0x0154)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIBaseColors                          CallFunc_GetUIColors_UI_BaseColors_1;              // 0x015C(0x0154)(HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x02B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x02C0(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x02D4(0x0014)()
	struct FSlateColor                            CallFunc_SelectSlateColor_ReturnValue;             // 0x02E8(0x0014)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Common_Generic_Warning_C_ExecuteUbergraph_WBP_Common_Generic_Warning;

// Function WBP_Common_Generic_Warning.WBP_Common_Generic_Warning_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Common_Generic_Warning_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Common_Generic_Warning_C_PreConstruct;

// Function WBP_Common_Generic_Warning.WBP_Common_Generic_Warning_C.SetDescription
// 0x0010 (0x0010 - 0x0000)
struct WBP_Common_Generic_Warning_C_SetDescription final
{
public:
	class FText                                   Description;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WBP_Common_Generic_Warning_C_SetDescription;

// Function WBP_Common_Generic_Warning.WBP_Common_Generic_Warning_C.SetLocalWidgetContextViewModel
// 0x0028 (0x0028 - 0x0000)
struct WBP_Common_Generic_Warning_C_SetLocalWidgetContextViewModel final
{
public:
	class ULocalWidgetContextViewModel*           viewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Common_Generic_Warning_C_SetLocalWidgetContextViewModel;

// Function WBP_Common_Generic_Warning.WBP_Common_Generic_Warning_C.SetSourcesToActionsListView
// 0x0010 (0x0010 - 0x0000)
struct WBP_Common_Generic_Warning_C_SetSourcesToActionsListView final
{
public:
	TArray<class UMenuActionViewModel*>           ActionsVMs;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_WBP_Common_Generic_Warning_C_SetSourcesToActionsListView;

// Function WBP_Common_Generic_Warning.WBP_Common_Generic_Warning_C.SetTitle
// 0x0010 (0x0010 - 0x0000)
struct WBP_Common_Generic_Warning_C_SetTitle final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WBP_Common_Generic_Warning_C_SetTitle;

}

