#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MatchmakingIndicator

#include "Basic.hpp"

#include "WBP_Abstract_Common_classes.hpp"
#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "SOS_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MatchmakingIndicator.WBP_MatchmakingIndicator_C
// 0x0150 (0x0D50 - 0x0C00)
class UWBP_MatchmakingIndicator_C final : public UWBP_Abstract_Common_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_MatchmakingIndicator_C;         // 0x0C00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut_Line_Anim;                                 // 0x0C08(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn_Line_Anim;                                  // 0x0C10(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOut_Box_Anim;                                  // 0x0C18(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn_Box_Anim;                                   // 0x0C20(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_InputAction_Data_Clickable_C*       BP_ToggleConnection_InputAction;                   // 0x0C28(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       COUNTDOWN;                                         // 0x0C30(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       COUNTDOWN_1;                                       // 0x0C38(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ElapsedTime_Minutes;                               // 0x0C40(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ElapsedTime_Minutes_1;                             // 0x0C48(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ElapsedTime_Seconds;                               // 0x0C50(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ElapsedTime_Seconds_1;                             // 0x0C58(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ElapsedTimeContainerLine;                          // 0x0C60(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_ElapsedTime;                                    // 0x0C68(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ListView_C*                        ListView_HoldMenuAction;                           // 0x0C70(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ListView_C*                        ListView_HoldMenuAction_Line;                      // 0x0C78(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                MatchmakingInProgress;                             // 0x0C80(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MatchmakingInProgress_Box;                         // 0x0C88(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MatchmakingInProgress_Line;                        // 0x0C90(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MatchWidgets;                                      // 0x0C98(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OfflineMode;                                       // 0x0CA0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        OfflineStatesSwitcher;                             // 0x0CA8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CustomMatch_PlayerCounter_C*       PlayerCounter_Box;                                 // 0x0CB0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_MatchType;                                    // 0x0CB8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_MatchType_1;                                  // 0x0CC0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_StatusInformation;                            // 0x0CC8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_StatusInformation_1;                          // 0x0CD0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WaitForUserValidation_C*           WBP_WaitForUserValidation;                         // 0x0CD8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_MatchmakingViewModel_C*             BP_MatchmakingViewModel;                           // 0x0CE0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_VM_CustomPartySystem_C*             BP_VM_CustomPartySystem;                           // 0x0CE8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	bool                                          MatchmakingCompleted;                              // 0x0CF0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CF1[0x7];                                      // 0x0CF1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_VM_CustomAuthentification_C*        BP_VM_CustomAuthentification;                      // 0x0CF8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  BigBoxTags;                                        // 0x0D00(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UBP_CustomMatchSystemViewModel_C*       BP_CustomMatchSystemViewModel;                     // 0x0D20(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	float                                         ElapsedTime;                                       // 0x0D28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2C[0x4];                                      // 0x0D2C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalWidgetContextViewModel*           LocalWidgetContextViewModel;                       // 0x0D30(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UReconnectViewModel*                    ReconnectViewModel;                                // 0x0D38(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           CustomMatch_WaitingForRematchServer;               // 0x0D40(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_TabNavigation_MenuMain_BP_ToggleConnection_InputAction_K2Node_ComponentBoundEvent_0_ButtonUserWidgetClickDelegate__DelegateSignature(class USCButtonUserWidget* _button, bool _bWithMouse);
	void BP_OnActivated();
	void BPE_OnActionPressed(const class USCInputAction* _action, const struct FInputActionState& _listenerState);
	void CancelMatchmaking();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_MatchmakingIndicator(int32 EntryPoint);
	bool IsBigBoxState(const struct FGameplayTag& TagOne);
	void OnAuthenticationStateChanged(ESOSAuthenticationState InAuthenticationState);
	void OnCustomMatchStatusChange(ESOSClientCustomMatchState MatchmakingStatus);
	void OnFrontendConnnectionStateChanged(ESOSFrontendConnectionState InFrontendConnectionState);
	void OnGameStateChange(const struct FGameplayTag& _previous, const struct FGameplayTag& _current);
	void OnMatchFound();
	void OnMatchmakingComplete(const struct FGameSessionPlacementResult& placementResult);
	void OnMatchmakingStatusChange(ESOSClientMatchmakingStatus MatchmakingStatus);
	void OnMaxPlayersChange(int32 MaxPlayers);
	void OnPlayerCountChange(int32 PlayerCount);
	void OnReauthentication(bool _bSuccess);
	void OnWaitForCMRematchServer(bool IsWaiting);
	void PreConstruct(bool IsDesignTime);
	void Refresh_Match_Widget_on_Reconnect_Available_Changed(bool AnyBool);
	void SetGameType(ESOSGameType GameType);
	void SetLocalWidgetContextViewModel(class ULocalWidgetContextViewModel* viewModel);
	void SetStatusText(const class FText& InText);
	void ShowHideActions(bool Show);
	void ShowMatchWidgets();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void TryAuthentication();

	int32 __5ef0d068_46af_a2d1_5c34_068b892cf0f8_SourceToDest() const;
	class FText BPE_GetMenuActionNameOverride(const class USCInputAction* _action) const;
	bool CanCancelMatchmaking() const;
	class FText GetHoldInputText() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_MatchmakingIndicator_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_MatchmakingIndicator_C")
	}
	static class UWBP_MatchmakingIndicator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MatchmakingIndicator_C>();
	}
};
DUMPER7_ASSERTS_UWBP_MatchmakingIndicator_C;

}

