#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TabNavigation_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SCCore_structs.hpp"
#include "SCCore_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TabNavigation_Parent.WBP_TabNavigation_Parent_C
// 0x00C0 (0x0D20 - 0x0C60)
#pragma pack(push, 0x1)
class alignas(0x10) UWBP_TabNavigation_Parent_C : public USCMenuWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_InputActionKey_Data_C*              ActionKey_Next;                                    // 0x0C68(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InputActionKey_Data_C*              ActionKey_Previous;                                // 0x0C70(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderTabs;                                        // 0x0C78(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot_NextToTabSpace;                          // 0x0C80(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot_Overlay;                                 // 0x0C88(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot_Tabs;                                    // 0x0C90(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TabContainer;                                      // 0x0C98(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USCInputAction*                         NextInputAction;                                   // 0x0CA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USCInputAction*                         PreviousInputAction;                               // 0x0CA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CurrentTabState;                                   // 0x0CB0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_TabNavigation_Tab_C*>       TabList;                                           // 0x0CB8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         CurrentTabIndex;                                   // 0x0CC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CCC[0x4];                                      // 0x0CCC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  StatesToHideTabs;                                  // 0x0CD0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FGameplayTagContainer                  StatesToDisableTabs;                               // 0x0CF0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                          IsTabsMenuAvailableInCurrentState;                 // 0x0D10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSubHeader;                                       // 0x0D11(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateTabStates();
	void UpdateTabsAvailabilityWithCurrentFlowStep(const struct FGameplayTag& _previous, const struct FGameplayTag& _current);
	void UpdateCurrentTabFromTransitionName(const struct FGameplayTag& _previous, const struct FGameplayTag& _current, const class FName& _transition);
	void SetTabsAvailability(bool Available, bool HideHeader);
	void RecursiveCreateTabListFromNamedSlot(class UPanelWidget* WidgetPanel);
	void PreConstruct(bool IsDesignTime);
	void OnTabClicked(class UWBP_TabNavigation_Tab_C* TabWidget);
	void OnPrevious();
	void OnNext();
	void HighlightOnlyCurrentTab(bool HighlightCurrent);
	int32 GetPreviousAvailableIndex();
	int32 GetNextAvailableIndex();
	void GetCurrentTransitionName(class FName* Output_Get);
	void ExecuteUbergraph_WBP_TabNavigation_Parent(int32 EntryPoint);
	void BPE_OnMenuTransitionIn(EMenuTransitions _eTransition, TSubclassOf<class USCMenuWidget> _ePrevMenu);

	void IsTabIndexValid(int32 Index_0, bool* bValid) const;
	void GetTransitionNameIndex(class FName TRANSITION, int32* Index_0) const;
	void GetTransitionNameAtIndex(int32 Index_0, class FName* TRANSITION) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_TabNavigation_Parent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_TabNavigation_Parent_C")
	}
	static class UWBP_TabNavigation_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TabNavigation_Parent_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UWBP_TabNavigation_Parent_C;

}

