#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StoreBtn

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Enum_StoreBtnSize_structs.hpp"


namespace SDK::Params
{

// Function WBP_StoreBtn.WBP_StoreBtn_C.ExecuteUbergraph_WBP_StoreBtn
// 0x0004 (0x0004 - 0x0000)
struct WBP_StoreBtn_C_ExecuteUbergraph_WBP_StoreBtn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_StoreBtn_C_ExecuteUbergraph_WBP_StoreBtn;

// Function WBP_StoreBtn.WBP_StoreBtn_C.GetBtnSize
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_StoreBtn_C_GetBtnSize final
{
public:
	struct FVector2D                              Value;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<Enum_StoreBtnSize, struct FVector2D>     BtnSizeMap;                                        // 0x0010(0x0050)(Edit, BlueprintVisible)
	TMap<Enum_StoreBtnSize, struct FVector2D>     K2Node_MakeVariable_MakeVariableOutput;            // 0x0060(0x0050)()
	struct FVector2D                              CallFunc_Map_Find_Value;                           // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_StoreBtn_C_GetBtnSize;

}

