#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GenericMenusFooter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_Abstract_Common_classes.hpp"
#include "SOS_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GenericMenusFooter.WBP_GenericMenusFooter_C
// 0x0060 (0x0C60 - 0x0C00)
class UWBP_GenericMenusFooter_C final : public UWBP_Abstract_Common_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_GenericMenusFooter_C;           // 0x0C00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ResetAnim;                                         // 0x0C08(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ActiveAnim;                                        // 0x0C10(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_0;                                          // 0x0C18(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FX;                                                // 0x0C20(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ListView_C*                        ListView_PageInputs;                               // 0x0C28(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             TopSlot;                                           // 0x0C30(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGlobalMenuContextViewModel*            GlobalMenuContextViewModel;                        // 0x0C38(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_MatchmakingViewModel_C*             BP_MatchmakingViewModel;                           // 0x0C40(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_CustomMatchSystemViewModel_C*       BP_CustomMatchSystemViewModel;                     // 0x0C48(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	bool                                          InActiveState;                                     // 0x0C50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Activate_Effect_from_Waiting_for_Rematch_Server(bool IsWaitingForServer);
	void ActivateEffectFromCustomMatch(ESOSClientCustomMatchState CustomMatchStatus);
	void ActivateEffectFromMatchmaking(ESOSClientMatchmakingStatus MatchmakingStatus);
	void ActivateFooterEffect(bool Activate);
	void BP_OnActivated();
	void ChangeInputsColorFromState(bool FooterActiveState);
	void ExecuteUbergraph_WBP_GenericMenusFooter(int32 EntryPoint);
	void SetBackgroundVisibility(bool bBackgroundIsVisible);
	void SetSourcesToActionsListView(TArray<class UMenuActionViewModel*>& ActionsVMs);

	bool BPE_ShouldHideMenuAction(const class USCInputAction* _action) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_GenericMenusFooter_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_GenericMenusFooter_C")
	}
	static class UWBP_GenericMenusFooter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GenericMenusFooter_C>();
	}
};
DUMPER7_ASSERTS_UWBP_GenericMenusFooter_C;

}

