#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Popup_Remapping

#include "Basic.hpp"

#include "SCCore_structs.hpp"
#include "SCCore_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Popup_Remapping.WBP_Popup_Remapping_C
// 0x02C0 (0x0F20 - 0x0C60)
class UWBP_Popup_Remapping_C final : public USCPopupWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BG;                                                // 0x0C68(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Corners;                                        // 0x0C70(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ListView_C*                        ListViewOptions;                                   // 0x0C78(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Common_BackgoundPopup_C*           WBP_Common_BackgoundPopup;                         // 0x0C80(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Remapping_PopUpContent_C*          WBP_Remapping_PopUpContent;                        // 0x0C88(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USCPopupViewModel*                      SCPopupViewModel;                                  // 0x0C90(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       PopupDescription;                                  // 0x0C98(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       PopupTitle;                                        // 0x0CA0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UMenuActionViewModel*                   MenuActionViewModel;                               // 0x0CA8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UInputMappingWidgetData*                MappingWidgetData;                                 // 0x0CB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Break_Dependency;                                  // 0x0CB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Analog;                                            // 0x0CB9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Invert_Mouse_Vertical_Axis;                        // 0x0CBA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CBB[0x5];                                      // 0x0CBB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMappingID                             MappingID;                                         // 0x0CC0(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UActionMappingViewModel*                ActionMappingViewModel;                            // 0x0D90(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGlobalMenuContextViewModel*            GlobalMenuContextViewModel;                        // 0x0D98(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	struct FInputMappingProfileData               MappingContext;                                    // 0x0DA0(0x00F8)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FInputMappingData                      PreviousMappingData;                               // 0x0E98(0x0068)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UDataTable*                             DT_ControlsDisplay;                                // 0x0F00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             DT_InputCaptureSteps;                              // 0x0F08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsRemappingGamepad;                               // 0x0F10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRemappingActionStarted;                           // 0x0F11(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AbortRemapping();
	void ApplyMapping(const struct FInputMappingData& MappingData);
	void BP_OnActivated();
	class UWidgetData* BPE_CreateData();
	void BPE_NotifyWidgetEvent(const struct FGameplayTag& _tag, const struct FGameplayAbilityTargetDataHandle& _dataHandle);
	void Construct();
	void ControllerTypeChanged(bool bGamepad);
	void ExecuteUbergraph_WBP_Popup_Remapping(int32 EntryPoint);
	void MappingConflictsChanged(TArray<class UActionMappingViewModel*>& ConflictVMs);
	void On_Options_ListView_Changed();
	void OnCancel_BA8016C44255A93DCC268DB17BE9C5C1();
	void OnStepStarted_BA8016C44255A93DCC268DB17BE9C5C1(const struct FInputMappingData& _result, ECaptureInputStep _newStep);
	void OnSuccess_BA8016C44255A93DCC268DB17BE9C5C1(const struct FInputMappingData& _result, ECaptureInputStep _newStep);
	void OnUpdate_BA8016C44255A93DCC268DB17BE9C5C1(const struct FInputMappingData& _result, ECaptureInputStep _newStep);
	void RemapInput();
	void SetSCPopupViewModel(class USCPopupViewModel* viewModel);
	void UpdateFocusColor(const struct FLinearColor& Override);
	void UpdateRemappingStep(ECaptureInputStep Step);

	ESlateVisibility __0ca68c52_476c_beee_d5c2_1fa9bba70ac9_SourceToDest() const;
	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Popup_Remapping_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Popup_Remapping_C")
	}
	static class UWBP_Popup_Remapping_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Popup_Remapping_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Popup_Remapping_C;

}

