#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Radar

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "PredictionMarkerData_structs.hpp"
#include "Engine_structs.hpp"
#include "Runtime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SCCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Radar.WBP_Radar_C
// 0x01F8 (0x0580 - 0x0388)
class UWBP_Radar_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_Ball;                                  // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Players;                               // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BackgroundMain;                              // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LocalPlayer;                                 // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_BallCall;                                  // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Scene;                                     // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsPlayerAttackingTowardY;                          // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APawn*>                          Pawns;                                             // 0x03C8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	TArray<class UWBP_RadarPlayer_C*>             PlayersWidgets;                                    // 0x03D8(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference)
	double                                        CurrentRadarRadius;                                // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RadarVisionRadiusOutfield;                         // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RadarVisionRadiusGK;                               // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RadarVisionRadiusSweeper;                          // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OuterBallMaxPosition;                              // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OuterPlayersMaxPosition;                           // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RadarSizeInItsImage;                               // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AllowRadarRotation;                                // 0x0420(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               BackgroundMaterial;                                // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LocalPlayerWorldPosition;                          // 0x0430(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PawnZRotation;                                     // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FieldRotation;                                     // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseTeamColors;                                     // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_451[0x3];                                      // 0x0451(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   FrustrumRotationName;                              // 0x0454(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RadarVisionRadiusName;                             // 0x045C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           AllyColor;                                         // 0x0464(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EnemyColor;                                        // 0x0474(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_484[0x4];                                      // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_RadarBounce_C*>             BounceWidgets;                                     // 0x0488(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<struct FPredictionMarkerData>          PredictionMarkerData;                              // 0x0498(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class ABall*, class UWBP_RadarBall_C*>   BallToWidget;                                      // 0x04A8(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)
	class UWBP_RadarBall_C*                       BallWidget;                                        // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxPlayers;                                        // 0x0500(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_504[0x4];                                      // 0x0504(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FVector2D, TSoftObjectPtr<class UTexture>> LinesTextures;                            // 0x0508(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UWBP_RadarBallCallLine_C*>       AvailableBallCallWidgets;                          // 0x0558(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          RadarHasBeenInitialized;                           // 0x0568(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_569[0x7];                                      // 0x0569(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBaseActorTargetConditionInstance      ShowBallCallLineCondition;                         // 0x0570(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, ContainsInstancedReference)

public:
	void AddAllPlayers(class APlayerState* _PlayerStateRemoved);
	void AddPlayerPawn(class APlayerState* Player, class APawn* NewPawn, class APawn* OldPawn);
	void AssignBallCallLineWidget(class UWBP_RadarPlayer_C* PlayerWidget);
	void ClearBounces();
	void ComputeWidgetPosition(const struct FVector2D& In, struct FVector2D* WidgetPosition, struct FVector2D* LocalVector);
	void ConvertRadarPosToCanvasPos(const struct FVector2D& InPos, double* ReturnValue_X, double* ReturnValue_Y);
	void CreateBallCallWidget(class UWBP_RadarBallCallLine_C** NewWidget);
	class UWBP_RadarBall_C* CreateBallWidget();
	void CreateBounceWidget(class UWBP_RadarBounce_C** BounceWidget);
	void CreatePlayerWidget();
	void ExecuteUbergraph_WBP_Radar(int32 EntryPoint);
	void InitializeRadar();
	void InitNewBall(class ABall* InBall);
	bool IsBounceWidgetAvailable(class UWBP_RadarBounce_C* Target);
	void OnBallUnregistered(class ABall* _ball);
	void OnInitialized();
	void OnLoaded_B6B0786E4ED71AF25BDB26B035322340(class UObject* Loaded);
	void OnOwnershipChanged(class UBallPlayersInteractionComponent* _ballPlayerInteraction);
	void OnShoot(const class ABall* _ball, const struct FShootParams& _shootParams);
	void OnTeamChanged(class ARuntimePlayerState* _playerState, uint8 _uiNewTeam, int32 _iNumberInTeam);
	void OnTeamColorChanged();
	void PlayBallCallOnRadar(class APawn* PingingPawn, bool PlayBallCallLines);
	void PreConstruct(bool IsDesignTime);
	void ReleaseBallCallLineWidget(class UWBP_RadarPlayer_C* InputPin);
	void SetAllowRadarRotation(bool AllowRadarRotation_0);
	void SetAllyAndEnemyColors();
	void SetBackgroundTexture(TSoftObjectPtr<class UTexture> Texture);
	void SetFieldOrientation();
	void SetFieldTexture();
	void SetGoalsColor();
	void SetIsRadarFliped();
	void SetRadarVisionRadius();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void TryAddPlayerState(class APlayerState* _PlayerStateAdded);
	void UpdateAllPlayersColor();
	void UpdateBackground();
	void UpdateBall();
	void UpdateBounces();
	void UpdateLocalPlayer();
	void UpdatePlayerColor(class UWBP_RadarPlayer_C* WBP_RadarPlayer, class APawn* A, class APawn* B);
	void UpdatePlayers();
	void UpdateWidgetsForAllies();

	void GetCameraComponent(class USceneComponent** OutCameraComponent) const;
	void GetRefActor(class AActor** OutActor) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Radar_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Radar_C")
	}
	static class UWBP_Radar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Radar_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Radar_C;

}

