#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InputTips_Freeplay

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function WBP_InputTips_Freeplay.WBP_InputTips_Freeplay_C.AnimationTransitionIN
// 0x0028 (0x0028 - 0x0000)
struct WBP_InputTips_Freeplay_C_AnimationTransitionIN final
{
public:
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0000(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetOwningPlayerCameraManager_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_InputTips_Freeplay_C_AnimationTransitionIN;

// Function WBP_InputTips_Freeplay.WBP_InputTips_Freeplay_C.ExecuteUbergraph_WBP_InputTips_Freeplay
// 0x0018 (0x0018 - 0x0000)
struct WBP_InputTips_Freeplay_C_ExecuteUbergraph_WBP_InputTips_Freeplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Condition;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0008(0x0010)(ConstParm)
};
DUMPER7_ASSERTS_WBP_InputTips_Freeplay_C_ExecuteUbergraph_WBP_InputTips_Freeplay;

// Function WBP_InputTips_Freeplay.WBP_InputTips_Freeplay_C.Show Input Tips
// 0x0020 (0x0020 - 0x0000)
struct WBP_InputTips_Freeplay_C_Show_Input_Tips final
{
public:
	class FText                                   InstructionText;                                   // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   InstructionInput;                                  // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WBP_InputTips_Freeplay_C_Show_Input_Tips;

// Function WBP_InputTips_Freeplay.WBP_InputTips_Freeplay_C.ToggleInputTips
// 0x0018 (0x0018 - 0x0000)
struct WBP_InputTips_Freeplay_C_ToggleInputTips final
{
public:
	bool                                          Condition;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   InText;                                            // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WBP_InputTips_Freeplay_C_ToggleInputTips;

}

