#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TriggerDebug

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TriggerDebug.WBP_TriggerDebug_C
// 0x0058 (0x03E0 - 0x0388)
class UWBP_TriggerDebug_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UProgressBar*                           Progress_Value;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                Text_Value;                                        // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            Color_Inactive;                                    // 0x03A0(0x0014)(Edit, BlueprintVisible)
	struct FLinearColor                           Color_Active;                                      // 0x03B4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   Axis;                                              // 0x03C8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_TriggerDebug(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetValue(double Value);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_TriggerDebug_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_TriggerDebug_C")
	}
	static class UWBP_TriggerDebug_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TriggerDebug_C>();
	}
};
DUMPER7_ASSERTS_UWBP_TriggerDebug_C;

}

