#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemSpecList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCCore_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ItemSpecList.WBP_ItemSpecList_C
// 0x0030 (0x0C20 - 0x0BF0)
class UWBP_ItemSpecList_C final : public USCUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_ItemSpecIcon_C*                    WBP_ItemSpecIcon_Color;                            // 0x0BF8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemSpecIcon_C*                    WBP_ItemSpecIcon_Flocking;                         // 0x0C00(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemSpecIcon_C*                    WBP_ItemSpecIcon_LinkedToSet;                      // 0x0C08(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemSpecIcon_C*                    WBP_ItemSpecIcon_Pattern;                          // 0x0C10(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemSpecIcon_C*                    WBP_ItemSpecIcon_VFX;                              // 0x0C18(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_ItemSpecList(int32 EntryPoint);
	void SetupAvailableSpecs(class USCCharacterPartDataAsset* CharaPartDataAsset);
	void ShowCustomSpec(bool Color, bool Pattern, bool Flocking, bool Vfx, bool LinkedToSet);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_ItemSpecList_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_ItemSpecList_C")
	}
	static class UWBP_ItemSpecList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ItemSpecList_C>();
	}
};
DUMPER7_ASSERTS_UWBP_ItemSpecList_C;

}

