#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Control

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCCore_structs.hpp"
#include "SCCore_classes.hpp"
#include "InputCore_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Control.WBP_Control_C
// 0x01C0 (0x0DB0 - 0x0BF0)
class UWBP_Control_C final : public USCUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_InputAction_Data_C*                 BP_InputAction_Left;                               // 0x0BF8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Description;                                       // 0x0C00(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_90;                                  // 0x0C08(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bOverrideWithKeys;                                 // 0x0C10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_C11[0x7];                                      // 0x0C11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKey>                           OverridingKeys;                                    // 0x0C18(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FMappingID                             MappingID;                                         // 0x0C28(0x00D0)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)
	class FText                                   DescriptionText;                                   // 0x0CF8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)
	struct FSlateColor                            RegularColor;                                      // 0x0D08(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            DeactivatedColor;                                  // 0x0D1C(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Is_in_Conflict;                                    // 0x0D30(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_D31[0x7];                                      // 0x0D31(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputPresetsEnumHandler               Preset_ID;                                         // 0x0D38(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          Is_Left_Aligned;                                   // 0x0D88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D89[0x3];                                      // 0x0D89(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            ConflictColor;                                     // 0x0D8C(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 TextStyleOverride;                                 // 0x0DA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Control(int32 EntryPoint);
	void OnActionPressed(const class USCInputAction* _inputAction, const struct FInputActionState& _listenerState);
	void OnActionReleased(const class USCInputAction* _inputAction, const struct FInputActionState& _listenerState);
	void PreConstruct(bool IsDesignTime);
	void SetAlignement(bool IsLeftAligned);
	void SetDeactivatedColor(bool bIsDeactivated);
	void SetPressedColor(bool bInIsPressed);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Control_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Control_C")
	}
	static class UWBP_Control_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Control_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Control_C;

}

