#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainMenusFooter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCCore_classes.hpp"
#include "UMG_structs.hpp"
#include "SOS_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MainMenusFooter.WBP_MainMenusFooter_C
// 0x0080 (0x0C70 - 0x0BF0)
class UWBP_MainMenusFooter_C final : public USCUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Common_Generic_Warning_C*          Warning_CantStartMatchmaking;                      // 0x0BF8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Common_Generic_Warning_C*          Warning_CantStartWithoutPlayersInTeam;             // 0x0C00(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menus_LeaverPenaltiesWarning_C*    Warning_LeaverPenalties;                           // 0x0C08(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Common_Generic_Warning_C*          Warning_ReconnectAvailable;                        // 0x0C10(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GenericMenusFooter_C*              WBP_GenericMenusFooter;                            // 0x0C18(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MatchmakingIndicator_C*            WBP_MatchmakingIndicator;                          // 0x0C20(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UReconnectViewModel*                    ReconnectViewModel;                                // 0x0C28(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_VM_CustomAuthentification_C*        BP_VM_CustomAuthentification;                      // 0x0C30(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_VM_CustomPartySystem_C*             BP_VM_CustomPartySystem;                           // 0x0C38(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetContextViewModel*                WidgetContextViewModel;                            // 0x0C40(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_MatchmakingViewModel_C*             BP_MatchmakingViewModel;                           // 0x0C48(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_CustomMatchSystemViewModel_C*       BP_CustomMatchSystemViewModel;                     // 0x0C50(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           WarningMessages_Parent;                            // 0x0C58(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USCGameFlowViewModel*                   SCGameFlowViewModel;                               // 0x0C60(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_MainMenusFooter_Warning_ReconnectAvailable_K2Node_ComponentBoundEvent_0_UserWidgetInputActionDelegate__DelegateSignature(class USCUserWidget* _widget, const class USCInputAction* _inputAction, const struct FInputActionState& _listenerState);
	void BPE_OnActionPressed(const class USCInputAction* _action, const struct FInputActionState& _listenerState);
	void ExecuteUbergraph_WBP_MainMenusFooter(int32 EntryPoint);
	void OnAuthenticationStateChanged(ESOSAuthenticationState InAuthenticationState);
	void OnFrontendConnnectionStateChanged(ESOSFrontendConnectionState InFrontendConnectionState);
	void OnGameFlowStateChanged(const struct FGameplayTag& TagOne);
	void OnReconnectAvailableChanged(bool isReconnectAvailable);
	void SetWarningMessageText(bool IsAnyPlayerInMatch);

	void __3c855250_4e90_eb44_36dc_058fe45f3889_SourceToDest(bool* IsDescriptionVisible) const;
	void __a3f8b975_4da5_3dca_1909_04b2703a586b_SourceToDest(bool* IsVisible_0) const;
	void __b898a8c7_49d0_3517_1923_2bb8e46f94c6_SourceToDest(bool* IsVisible_0) const;
	void __d9039c7a_43bf_af85_a9fe_a2a608119d60_SourceToDest(bool* IsVisible_0) const;
	bool __e0992b82_484b_22ec_c676_288f9e3de9d9_SourceToDest() const;
	void HideReconnectInput(ESOSClientCustomMatchState CustomMatchStatus, ESOSClientMatchmakingStatus MatchmakingStatus, bool RefreshWithReconnect, bool* IsVisible_0) const;
	void Set_Warning_Cant_Start_CMVisibility(bool IsAllTeamEmpty, ESOSClientCustomMatchState CustomMatchStatus, const struct FGameplayTag& TagOne, bool* IsVisible_0) const;
	void Set_Warning_Message_Visibility(ESOSClientCustomMatchState CustomMatchStatus, bool IsAnyPlayerInMatch_InLobbyCM_, bool IsAnyPlayerInMatch, bool IsAnyPlayerReconnectToRanked, bool IsAnyCustomPlayerReconnectToRanked, bool IsLocalPlayerReconnectToRanked, bool IsLocalCustomPlayerReconnectToRanked, bool* IsVisible_0) const;
	void SetLeaverPenaltiesNotifShortVersion(bool IsLocalPlayerPenaltyLeaver, bool Reconnect, bool IsAnyPlayerPenaltyLeaver, bool IsAnyPlayerInMatch, bool IsAnyPlayerInMatch_InLobbyCM_, bool IsAnyPlayerReconnectToRanked, bool IsAnyCustomPlayerReconnectToRanked, bool* IsDescriptionVisible) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_MainMenusFooter_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_MainMenusFooter_C")
	}
	static class UWBP_MainMenusFooter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MainMenusFooter_C>();
	}
};
DUMPER7_ASSERTS_UWBP_MainMenusFooter_C;

}

