#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_Home_LiveFeed

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Menu_Home_LiveFeed.WBP_Menu_Home_LiveFeed_C.ExecuteUbergraph_WBP_Menu_Home_LiveFeed
// 0x0020 (0x0020 - 0x0000)
struct WBP_Menu_Home_LiveFeed_C_ExecuteUbergraph_WBP_Menu_Home_LiveFeed final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Menu_Home_LiveFeed_C_ExecuteUbergraph_WBP_Menu_Home_LiveFeed;

// Function WBP_Menu_Home_LiveFeed.WBP_Menu_Home_LiveFeed_C.OnStoreViewModelChanged
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_Home_LiveFeed_C_OnStoreViewModelChanged final
{
public:
	class UBP_StoreViewModel_C*                   VM;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCurrentSeasonName_Name;                // 0x0008(0x0010)()
};
DUMPER7_ASSERTS_WBP_Menu_Home_LiveFeed_C_OnStoreViewModelChanged;

}

