#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ControlsDisplay

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Runtime_classes.hpp"
#include "Engine_structs.hpp"
#include "Slate_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BPE_ControlDisplayCategory_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ControlsDisplay.WBP_ControlsDisplay_C
// 0x0230 (0x0E20 - 0x0BF0)
class UWBP_ControlsDisplay_C final : public UHUD_Widget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn_Anim;                                       // 0x0BF8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           CenterVerticalBox;                                 // 0x0C00(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           InputsPanel_parent;                                // 0x0C08(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LeftTitle;                                         // 0x0C10(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           LeftVerticalBox;                                   // 0x0C18(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RightTitle;                                        // 0x0C20(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           RightVerticalBox;                                  // 0x0C28(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ShowInputsPanel;                                   // 0x0C30(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VignetteCenter;                                    // 0x0C38(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VignetteLeft;                                      // 0x0C40(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VignetteRight;                                     // 0x0C48(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CamLockBallToggleIcon_C*           WBP_CamLockBallToggleIcon;                         // 0x0C50(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Control_C*                         WBP_Control;                                       // 0x0C58(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Control_C*                         WBP_Control_LockCamera;                            // 0x0C60(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FMargin                                ControlPadding;                                    // 0x0C68(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TMap<class UUserWidget*, struct FGameplayTagContainer> ShowOnTagMap;                             // 0x0C78(0x0050)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class UUserWidget*, struct FGameplayTagContainer> HideOnTagMap;                             // 0x0CC8(0x0050)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference)
	class USCAbilitySystemComponent*              LocalPlayerASC;                                    // 0x0D18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMap<class UUserWidget*, struct FGameplayTagContainer> GreyOutOnTagMap;                          // 0x0D20(0x0050)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference)
	struct FLinearColor                           RegularColor;                                      // 0x0D70(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           GreyedOutColor;                                    // 0x0D80(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class UUserWidget*, struct FGameplayTagContainer> WhiteOnTagMap;                            // 0x0D90(0x0050)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference)
	class USCInputAction*                         ToggleInputTipsAction;                             // 0x0DE0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   LeftControlsTitle;                                 // 0x0DE8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)
	class FText                                   RightControlsTitle;                                // 0x0DF8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)
	struct FGameplayTag                           ShowToggleGameplayTipsTag;                         // 0x0E08(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash)
	bool                                          bRequestedVisibility;                              // 0x0E10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bForceVisible;                                     // 0x0E11(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHideHeader;                                       // 0x0E12(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddAction(class UClass* Class_0, const class FText& DescriptionText, class USCInputAction* Action, const struct FGameplayTagContainer& ShowOnTag, const struct FGameplayTagContainer& HideOnTag, const struct FGameplayTagContainer& WhiteOnTag, const struct FGameplayTagContainer& GreyOutOnTag, EBPE_ControlDisplayCategory Side, class UWBP_Control_C** Widget);
	void AddCenterWidget(class UWidget* InWidget);
	void AddKeys(class UClass* Class_0, const class FText& DescriptionText, TArray<struct FKey>& OverridingKeys, const struct FGameplayTagContainer& ShowOnTag, const struct FGameplayTagContainer& HideOnTag, EBPE_ControlDisplayCategory Side, class UWBP_Control_C** Widget);
	void AddLeftWidget(class UWBP_Control_C* InWidget);
	void AddRightWidget(class UWBP_Control_C* InWidget);
	void BindWidgetsVisibility();
	void BindWidgetsVisibilityOnTagContainers(TArray<struct FGameplayTagContainer>& Array, class USCAbilitySystemComponent* Target);
	void ClearAllKeys();
	void Construct();
	void EmptyContainerCheck(class UVerticalBox* BoxToCheck, class UWidget* BoxTitle);
	void ExecuteUbergraph_WBP_ControlsDisplay(int32 EntryPoint);
	class UWBP_Control_C* GenerateControl(class APlayerController* OwningPlayer, class UClass* Class_0, const class FText& DescriptionText, class USCInputAction* Action, bool bOverrideWithKeys, TArray<struct FKey>& OverridingKeys, const struct FGameplayTagContainer& ShowOnTag, const struct FGameplayTagContainer& HideOnTag, const struct FGameplayTagContainer& WhiteOnTag, const struct FGameplayTagContainer& GreyOutOnTag);
	void Initialize();
	void On_Show_Toggle_Gameplay_Tips_Tag_Count_Changed(const class USCAbilitySystemComponent* _abilitySystem, const struct FGameplayTag& _gameplayTag, int32 _iCount);
	void OnPossessedPawnChanged(class APawn* OldPawn, class APawn* NewPawn);
	void OnTagCountChanged(const class USCAbilitySystemComponent* _abilitySystem, const struct FGameplayTag& _gameplayTag, int32 _iCount);
	void PreConstruct(bool IsDesignTime);
	void RemoveKey(ETextJustify Side, class UWBP_Control_C* Widget_Control);
	void SetVisibilityForcedFromTags(bool bForced);
	void ToggleVisibilityHeaders(bool HideHeader);
	void Update_Widgets_Visibility();
	void UpdateInputsVisibility(bool Show);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_ControlsDisplay_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_ControlsDisplay_C")
	}
	static class UWBP_ControlsDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ControlsDisplay_C>();
	}
};
DUMPER7_ASSERTS_UWBP_ControlsDisplay_C;

}

