#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GenericButton_Entry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_Abstract_GenericButton_GameFlow_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GenericButton_Entry.WBP_GenericButton_Entry_C
// 0x0070 (0x0E40 - 0x0DD0)
class UWBP_GenericButton_Entry_C final : public UWBP_Abstract_GenericButton_GameFlow_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_GenericButton_Entry_C;          // 0x0DD0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ResetAnim;                                         // 0x0DD8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0DE0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                BorderBG;                                          // 0x0DE8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Background;                                    // 0x0DF0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Txt_Subtitle;                                      // 0x0DF8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TXT_Title;                                         // 0x0E00(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0E08(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   Subtext;                                           // 0x0E18(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FLinearColor                           FocusColorOverride;                                // 0x0E28(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ChangeSubtext(const class FText& Subtext_0);
	void ChangeText(const class FText& Text_0);
	void ExecuteUbergraph_WBP_GenericButton_Entry(int32 EntryPoint);
	void FocusButton(bool ButtonFocused);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_GenericButton_Entry_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_GenericButton_Entry_C")
	}
	static class UWBP_GenericButton_Entry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GenericButton_Entry_C>();
	}
};
DUMPER7_ASSERTS_UWBP_GenericButton_Entry_C;

}

