#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TabNavigation_MenuMain

#include "Basic.hpp"

#include "SOS_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "WBP_TabNavigation_Parent_classes.hpp"
#include "SCCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TabNavigation_MenuMain.WBP_TabNavigation_MenuMain_C
// 0x0150 (0x0E70 - 0x0D20)
class UWBP_TabNavigation_MenuMain_C final : public UWBP_TabNavigation_Parent_C
{
public:
	uint8                                         Pad_D12[0x6];                                      // 0x0D12(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_TabNavigation_MenuMain_C;       // 0x0D18(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HB_TabContainer;                                   // 0x0D20(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_CustomizationTAB_Notification;                 // 0x0D28(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_ProfileTAB_Notification;                       // 0x0D30(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_SeasonPassTAB_Notification;                    // 0x0D38(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_StoreTAB_Notification;                         // 0x0D40(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               TAB_Customization_Parent;                          // 0x0D48(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TabNavigation_Tab_C*               Tab_Customize;                                     // 0x0D50(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TabNavigation_Tab_C*               Tab_Home;                                          // 0x0D58(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TabNavigation_Tab_C*               Tab_Profile;                                       // 0x0D60(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               TAB_Profile_Parent;                                // 0x0D68(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TabNavigation_Tab_C*               Tab_SeasonPass;                                    // 0x0D70(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               TAB_SeasonPass_Parent;                             // 0x0D78(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TabNavigation_Tab_C*               Tab_Store;                                         // 0x0D80(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               TAB_Store_Parent;                                  // 0x0D88(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TabNavigation_Tab_C*               Tab_Tab;                                           // 0x0D90(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SocialPanel_TabHeaderParty_C*      WBP_TabHeaderParty;                                // 0x0D98(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_VM_CustomAuthentification_C*        BP_VM_CustomAuthentification;                      // 0x0DA0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  StatesToDisableSocialPanel;                        // 0x0DA8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly)
	TMulticastInlineDelegate<void()>              OnSocialPanelClosed;                               // 0x0DC8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnSocialPanelOpened;                               // 0x0DD8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TSoftObjectPtr<class ALevelSequenceActor>     HomeMenu_LevelSequenceActor;                       // 0x0DE8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class ARuntimePlayerStart>     RuntimePlayerStart6;                               // 0x0E10(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UBP_CustomMatchSystemViewModel_C*       BP_CustomMatchSystemViewModel;                     // 0x0E38(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	ESOSClientCustomMatchState                    PreviousMatchState;                                // 0x0E40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E41[0x3];                                      // 0x0E41(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CustomMatchStateParent;                            // 0x0E44(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4C[0x4];                                      // 0x0E4C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AvailableFeaturesViewmodel_C*       BP_AvailableFeaturesViewmodel;                     // 0x0E50(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSocialPanelAvailableInCurrentState;              // 0x0E58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E59[0x7];                                      // 0x0E59(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_StoreViewModel_C*                   BP_StoreViewModel;                                 // 0x0E60(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateTabsAvailabilityWithCurrentFlowStep(const struct FGameplayTag& _previous, const struct FGameplayTag& _current);
	void OnFrontendConnnectionStateChanged(ESOSFrontendConnectionState InFrontendConnectionState);
	void OnCustomMatchStateChanged(ESOSClientCustomMatchState InNewState);
	void OnButtonOpenPanel(class USCButtonUserWidget* _button, bool _bWithMouse);
	void OnAuthenticationStateChanged(ESOSAuthenticationState InAuthenticationState);
	bool IsInCustomMatch();
	void HideStoreTab(bool IsHidden);
	void HideSeasonPassTab(bool IsHidden);
	void HideProfileTab(bool IsHidden);
	void HideCustoTab(bool IsHidden);
	void GoToOldCustomization(class FName ActionName);
	void GotoFreeplay();
	void GoToDevPractice(class FName ActionName);
	void ExecuteUbergraph_WBP_TabNavigation_MenuMain(int32 EntryPoint);
	void BPE_OnMenuTransitionOut(EMenuTransitions _eTransition, TSubclassOf<class USCMenuWidget> _eNewMenu);
	void BPE_OnMenuTransitionIn(EMenuTransitions _eTransition, TSubclassOf<class USCMenuWidget> _ePrevMenu);
	void BPE_OnActionPressed(const class USCInputAction* _action, const struct FInputActionState& _listenerState);
	void BP_OnActivated();

	void SetNavTabEnabled(bool isFeatureStateEnabled, bool IsConnectedToFrontend, bool IsHidden, bool* IsEnabled) const;
	void SetFeaturesAvailabilityFeedbackVisibility(bool IsConnectedToFrontend, bool isFeatureStateEnabled, bool* IsVisible_0) const;
	void __d83a772e_4026_2f4a_1482_6dbc4ec95500_SourceToDest(bool* IsVisible_0) const;
	void __c6a80a45_4c08_5b99_4526_3883934ca922_SourceToDest(bool* IsEnabled) const;
	void __b1f65d28_45c5_e081_8f4d_c08162c33909_SourceToDest(bool* IsEnabled) const;
	void __a7191fda_4457_8b27_3569_0c875c4aaf0d_SourceToDest(bool* IsVisible_0) const;
	void __7fe5970c_46bd_7fbf_e646_2384beea5df6_SourceToDest(bool* IsVisible_0) const;
	void __51c25bab_42a2_14b8_3f21_8c86eee4b36c_SourceToDest(bool* IsEnabled) const;
	void __42ced048_4048_8143_4e09_3a83ef0e08f9_SourceToDest(bool* IsVisible_0) const;
	void __40023193_4dbe_a6f8_cdec_1a92f5f1896e_SourceToDest(bool* IsEnabled) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_TabNavigation_MenuMain_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_TabNavigation_MenuMain_C")
	}
	static class UWBP_TabNavigation_MenuMain_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TabNavigation_MenuMain_C>();
	}
};
DUMPER7_ASSERTS_UWBP_TabNavigation_MenuMain_C;

}

