#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Generic_CheckboxEntry

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UIBaseColors_structs.hpp"


namespace SDK::Params
{

// Function WBP_Generic_CheckboxEntry.WBP_Generic_CheckboxEntry_C.ChangeText
// 0x0010 (0x0010 - 0x0000)
struct WBP_Generic_CheckboxEntry_C_ChangeText final
{
public:
	class FText                                   Text_0;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WBP_Generic_CheckboxEntry_C_ChangeText;

// Function WBP_Generic_CheckboxEntry.WBP_Generic_CheckboxEntry_C.ExecuteUbergraph_WBP_Generic_CheckboxEntry
// 0x0008 (0x0008 - 0x0000)
struct WBP_Generic_CheckboxEntry_C_ExecuteUbergraph_WBP_Generic_CheckboxEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                CallFunc_GetCheckedState_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Generic_CheckboxEntry_C_ExecuteUbergraph_WBP_Generic_CheckboxEntry;

// Function WBP_Generic_CheckboxEntry.WBP_Generic_CheckboxEntry_C.FocusButton
// 0x0001 (0x0001 - 0x0000)
struct WBP_Generic_CheckboxEntry_C_FocusButton final
{
public:
	bool                                          ButtonFocused;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Generic_CheckboxEntry_C_FocusButton;

// Function WBP_Generic_CheckboxEntry.WBP_Generic_CheckboxEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Generic_CheckboxEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Generic_CheckboxEntry_C_PreConstruct;

// Function WBP_Generic_CheckboxEntry.WBP_Generic_CheckboxEntry_C.SetSelectedStyle
// 0x0E60 (0x0E60 - 0x0000)
struct WBP_Generic_CheckboxEntry_C_SetSelectedStyle final
{
public:
	bool                                          IsFocused;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonTextStyle>           Temp_class_Variable;                               // 0x0018(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonTextStyle>           Temp_class_Variable_1;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0028(0x0014)()
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonTextStyle>           K2Node_Select_Default;                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIBaseColors                          CallFunc_GetUIColors_UI_BaseColors;                // 0x004C(0x0154)(HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x01A0(0x0014)()
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x01B4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x01C4(0x0014)()
	struct FSlateColor                            K2Node_Select_Default_2;                           // 0x01D8(0x0014)()
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x01F0(0x00D0)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x02C0(0x00D0)()
	struct FCheckBoxStyle                         K2Node_MakeStruct_CheckBoxStyle;                   // 0x0390(0x0AD0)()
};
DUMPER7_ASSERTS_WBP_Generic_CheckboxEntry_C_SetSelectedStyle;

}

