#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SeasonEnd_Stats

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_Abstract_Common_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SeasonEnd_Stats.WBP_SeasonEnd_Stats_C
// 0x0060 (0x0C60 - 0x0C00)
class UWBP_SeasonEnd_Stats_C final : public UWBP_Abstract_Common_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_SeasonEnd_Stats_C;              // 0x0C00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0C08(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_Stat_Value_C*                      Stat_Assist;                                       // 0x0C10(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Stat_Value_C*                      Stat_Goal;                                         // 0x0C18(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Stat_Value_C*                      Stat_Interception;                                 // 0x0C20(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Stat_Value_C*                      Stat_MatchPlayed;                                  // 0x0C28(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Stat_Value_C*                      Stat_Passe;                                        // 0x0C30(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Stat_Value_C*                      WBP_Stat_Distance;                                 // 0x0C38(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Stat_Value_C*                      WBP_Stat_MVP_Titles;                               // 0x0C40(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Stat_Value_C*                      WBP_Stat_Save;                                     // 0x0C48(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PlayerPrivateProfileViewModel_C*    BP_PlayerPrivateProfileViewModel;                  // 0x0C50(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USOSPlayerProfileStatisticsViewData*    SOSPlayerProfileStatisticsViewData;                // 0x0C58(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_SeasonEnd_Stats(int32 EntryPoint);
	void PlayFadeInAnim();
	void PostEvent(class UAkAudioEvent* AkEvent);
	void SequenceEvent__ENTRYPOINTWBP_SeasonEnd_Stats();
	void SetSOSPlayerProfileStatisticsViewData(class USOSPlayerProfileStatisticsViewData* viewModel);

	void __172fcaa3_416b_466a_7b74_bd9f1acacc47_SourceToDest(class FText* FormattedValue) const;
	void __442a377c_4ba4_201a_bace_dbaf1215de63_SourceToDest(class FText* FormattedValue) const;
	void __4f3089b1_4222_064a_7e06_b490d2cf9568_SourceToDest(class FText* FormattedValue) const;
	void __681cd720_48df_9e1a_e4cc_8f9ab61ee1f0_SourceToDest(class FText* FormattedValue) const;
	void __76667c93_4aa8_569a_3b10_50aa2e6072e9_SourceToDest(class FText* FormattedValue) const;
	void __87281c0a_4c0e_e815_104f_5e9ee6f08e61_SourceToDest(class FText* FormattedValue) const;
	void __8983e45e_4d37_bf2a_22e7_6d8a22c20ca4_SourceToDest(class FText* FormattedValue) const;
	void __e7d7713d_48b8_4f83_5812_c1a89e696a81_SourceToDest(class FText* FormattedValue) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_SeasonEnd_Stats_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_SeasonEnd_Stats_C")
	}
	static class UWBP_SeasonEnd_Stats_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SeasonEnd_Stats_C>();
	}
};
DUMPER7_ASSERTS_UWBP_SeasonEnd_Stats_C;

}

