#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Popup_SeasonEnd

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Popup_SeasonEnd.WBP_Popup_SeasonEnd_C
// 0x00B0 (0x0D10 - 0x0C60)
class UWBP_Popup_SeasonEnd_C final : public USCPopupWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_GenericButton_Entry_C*             BTN_RankingNext;                                   // 0x0C68(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GenericButton_Entry_C*             BTN_RecapNext;                                     // 0x0C70(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ListView_C*                        ListViewOptions;                                   // 0x0C78(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_SeasonEnd_Rewards;                       // 0x0C80(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       SeasonEnd_SwitcherTAB;                             // 0x0C88(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        SeasonEndStats_SwitcherTAB;                        // 0x0C90(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Common_BackgoundPopup_C*           WBP_Common_BackgoundPopup;                         // 0x0C98(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NewSeasonStart_C*                  WBP_NewSeasonStart;                                // 0x0CA0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SeasonEnd_Page_C*                  WBP_SeasonEnd_Page;                                // 0x0CA8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SeasonEnd_Ranking_C*               WBP_SeasonEnd_Ranking;                             // 0x0CB0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SeasonEnd_Reward_C*                WBP_SeasonEnd_Reward;                              // 0x0CB8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SeasonEnd_Stats_C*                 WBP_SeasonEnd_Stats;                               // 0x0CC0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USCPopupViewModel*                      SCPopupViewModel;                                  // 0x0CC8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       PopupDescription;                                  // 0x0CD0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       PopupTitle;                                        // 0x0CD8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	double                                        ScrollBoxOffset;                                   // 0x0CE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ScrollSpeed;                                       // 0x0CE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsReward;                                          // 0x0CF0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BlockClick;                                        // 0x0CF1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CF2[0x6];                                      // 0x0CF2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWelcomeFlowContentViewModel*           WelcomeFlowContentViewModel;                       // 0x0CF8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_PlayerPrivateProfileViewModel_C*    BP_PlayerPrivateProfileViewModel;                  // 0x0D00(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_StoreViewModel_C*                   BP_StoreViewModel;                                 // 0x0D08(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void __Setter_SOSPlayerProfileStatisticsViewData(class USOSPlayerProfileStatisticsViewData* NewValue);
	void BndEvt__WBP_Popup_SeasonEnd_BTN_RankingNext_K2Node_ComponentBoundEvent_1_ButtonUserWidgetClickDelegate__DelegateSignature(class USCButtonUserWidget* _button, bool _bWithMouse);
	void BndEvt__WBP_Popup_SeasonEnd_BTN_RecapNext_K2Node_ComponentBoundEvent_2_ButtonUserWidgetClickDelegate__DelegateSignature(class USCButtonUserWidget* _button, bool _bWithMouse);
	void Construct();
	void ExecuteUbergraph_WBP_Popup_SeasonEnd(int32 EntryPoint);
	void Finished_30B358BA4897D0113BF76AB515245C21();
	void Finished_6DFE9C4146F6D60EFBDC0494A08CA42F();
	void Finished_A86A76ED4049175026011F9481486C67();
	void Finished_CDB50C4C4F01A4C55AA734BFBACA14CC();
	void On_Options_ListView_Changed();
	struct FEventReply OnAnalogValueChanged(const struct FGeometry& MyGeometry, const struct FAnalogInputEvent& InAnalogInputEvent);
	void OnPlayerProfileViewModelChanged(class UBP_PlayerPrivateProfileViewModel_C* VM);
	void OnRankingAnimationCompleted();
	void OnStoreViewModelChanged(class UBP_StoreViewModel_C* VM);
	void OnWelcomeFlowContentViewModelChanged(class UWelcomeFlowContentViewModel* VM);
	void SetSCPopupViewModel(class USCPopupViewModel* viewModel);
	void SetWelcomeFlowContentViewModel(class UWelcomeFlowContentViewModel* viewModel);
	void UpdatePage();

	class UWidget* BP_GetDesiredFocusTarget() const;
	void GetEndedSeasonNumber(int32* SeasonNumber) const;
	void GetRewardItems(TArray<class USOSBindingsStoreItemViewModel*>* Items) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Popup_SeasonEnd_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Popup_SeasonEnd_C")
	}
	static class UWBP_Popup_SeasonEnd_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Popup_SeasonEnd_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Popup_SeasonEnd_C;

}

