#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PopupOptionButton_Store

#include "Basic.hpp"

#include "WBP_Abstract_GenericButton_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PopupOptionButton_Store.WBP_PopupOptionButton_Store_C
// 0x0050 (0x0E10 - 0x0DC0)
class UWBP_PopupOptionButton_Store_C final : public UWBP_Abstract_GenericButton_C
{
public:
	class UBP_InputActionKey_Data_C*              BackInput;                                         // 0x0DC0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         BackInputHorizontalBox;                            // 0x0DC8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BG_Focus;                                          // 0x0DD0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HardCurrency_C*                    Currency;                                          // 0x0DD8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LabelPurchase;                                     // 0x0DE0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USCPopupActionViewModel*                SCPopupActionViewModel;                            // 0x0DE8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_StoreViewModel_C*                   BP_StoreViewModel;                                 // 0x0DF0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USOSBindingsStoreItemViewModel*         SOSBindingsStoreItemViewModel;                     // 0x0DF8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USOSBindingsStoreBundleViewModel*       SOSBindingsStoreBundleViewModel;                   // 0x0E00(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void FocusButton(bool ButtonFocused);
	void OnItemViewModelChanged(class USOSBindingsStoreItemViewModel* viewModel);
	void RefreshButton();
	void SetSCPopupActionViewModel(class USCPopupActionViewModel* viewModel);
	void SetSOSBindingsStoreBundleViewModel(class USOSBindingsStoreBundleViewModel* viewModel);
	void SetSOSBindingsStoreItemViewModel(class USOSBindingsStoreItemViewModel* viewModel);
	void UpdateOption(const struct FGameplayTag& OptionTag);

	void GetItemViewModel(class USOSBindingsStoreItemViewModel** viewModel) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_PopupOptionButton_Store_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_PopupOptionButton_Store_C")
	}
	static class UWBP_PopupOptionButton_Store_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PopupOptionButton_Store_C>();
	}
};
DUMPER7_ASSERTS_UWBP_PopupOptionButton_Store_C;

}

