#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GoalKeeper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCCore_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GoalKeeper.WBP_GoalKeeper_C
// 0x0080 (0x0C70 - 0x0BF0)
class UWBP_GoalKeeper_C final : public USCUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_FadeOut;                                      // 0x0BF8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_GoalKeeper;                                   // 0x0C00(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Sweeper;                                      // 0x0C08(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_FadeIn;                                       // 0x0C10(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Icon_GoalKeeper;                                   // 0x0C18(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Sweeper;                                      // 0x0C20(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Particules;                                  // 0x0C28(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Goalkeeper;                                   // 0x0C30(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsWaitingForFadeAnimToFinish;                     // 0x0C38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C39[0x7];                                      // 0x0C39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USCAbilitySystemComponent*              Ability_System;                                    // 0x0C40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        PlayRate;                                          // 0x0C48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   GoalkeeperText;                                    // 0x0C50(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SweeperText;                                       // 0x0C60(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BindAbilitySystemEvents(class ARuntimeCharacter* _runtimeCharacter);
	void ExecuteUbergraph_WBP_GoalKeeper(int32 EntryPoint);
	void Finished_0DC091834066E2D658C0C9BF62D9E80B();
	void Finished_241AD7F1453C3316101B2488045A81C6();
	void Finished_DC1F3A8445AB18F84B7C9AB01B85EF6F();
	void Finished_DE90360D48A8A28494D1DD941B3D2091();
	void Is_Displaying_Widgets(bool* bIsDisplaying);
	void IsDisplayingGoalKeeper(bool* bIsDisplaying);
	void IsDisplayingSweeper(bool* bIsDisplaying);
	bool IsNotWaitingForFadeAnimToFinish();
	void MakeSweeperOrGoalKeeperIconsVisible();
	void OnConditionTrue_4FFF949D489E764D589402A46088F19A();
	void OnConditionTrue_4FFF949D489E764D589402A4E4296621();
	void OnInitialized();
	void OnPawnPossessed(class APawn* OldPawn, class APawn* NewPawn);
	void SwitchBetweenGoalkeeperAndSweeper(const class USCAbilitySystemComponent* _abilitySystem, const struct FGameplayTag& _gameplayTag, int32 _iCount);
	void SwitchWidgetVisibility(const class USCAbilitySystemComponent* _abilitySystem, const struct FGameplayTag& _gameplayTag, int32 _iCount);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_GoalKeeper_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_GoalKeeper_C")
	}
	static class UWBP_GoalKeeper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GoalKeeper_C>();
	}
};
DUMPER7_ASSERTS_UWBP_GoalKeeper_C;

}

