#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menus_LeaverPenaltiesWarning

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_Abstract_Common_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menus_LeaverPenaltiesWarning.WBP_Menus_LeaverPenaltiesWarning_C
// 0x0040 (0x0C40 - 0x0C00)
class UWBP_Menus_LeaverPenaltiesWarning_C final : public UWBP_Abstract_Common_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_Menus_LeaverPenaltiesWarning_C; // 0x0C00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       TXT_TimerLeft;                                     // 0x0C08(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Common_Generic_Warning_C*          Warning_LeaverPenalties;                           // 0x0C10(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_VM_CustomAuthentification_C*        BP_VM_CustomAuthentification;                      // 0x0C18(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_MatchmakingViewModel_C*             BP_MatchmakingViewModel;                           // 0x0C20(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_VM_CustomPartySystem_C*             BP_VM_CustomPartySystem;                           // 0x0C28(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x0C30(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               Timer_Parent;                                      // 0x0C38(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menus_LeaverPenaltiesWarning(int32 EntryPoint);
	void InitNotif(const struct FTimespan& LeaverPenaltyExpirationtime);
	void SetPenaltyDescription(bool isLocalPlayerLeaverPenalty);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Menus_LeaverPenaltiesWarning_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Menus_LeaverPenaltiesWarning_C")
	}
	static class UWBP_Menus_LeaverPenaltiesWarning_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menus_LeaverPenaltiesWarning_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Menus_LeaverPenaltiesWarning_C;

}

