#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Abstract_GenericButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Abstract_GenericButton.WBP_Abstract_GenericButton_C.EnableButton
// 0x0001 (0x0001 - 0x0000)
struct WBP_Abstract_GenericButton_C_EnableButton final
{
public:
	bool                                          ButtonEnabled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Abstract_GenericButton_C_EnableButton;

// Function WBP_Abstract_GenericButton.WBP_Abstract_GenericButton_C.ExecuteUbergraph_WBP_Abstract_GenericButton
// 0x0014 (0x0014 - 0x0000)
struct WBP_Abstract_GenericButton_C_ExecuteUbergraph_WBP_Abstract_GenericButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0008(0x0008)(NoDestructor)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Abstract_GenericButton_C_ExecuteUbergraph_WBP_Abstract_GenericButton;

// Function WBP_Abstract_GenericButton.WBP_Abstract_GenericButton_C.FocusButton
// 0x0001 (0x0001 - 0x0000)
struct WBP_Abstract_GenericButton_C_FocusButton final
{
public:
	bool                                          ButtonFocused;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Abstract_GenericButton_C_FocusButton;

// Function WBP_Abstract_GenericButton.WBP_Abstract_GenericButton_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_Abstract_GenericButton_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Abstract_GenericButton_C_OnFocusLost;

// Function WBP_Abstract_GenericButton.WBP_Abstract_GenericButton_C.OnFocusReceived
// 0x0270 (0x0270 - 0x0000)
struct WBP_Abstract_GenericButton_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	bool                                          CallFunc_SetPropertyValueAndBroadcast_ReturnValue; // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x01B8(0x00B8)()
};
DUMPER7_ASSERTS_WBP_Abstract_GenericButton_C_OnFocusReceived;

// Function WBP_Abstract_GenericButton.WBP_Abstract_GenericButton_C.UpdateButtonAvailability
// 0x0018 (0x0018 - 0x0000)
struct WBP_Abstract_GenericButton_C_UpdateButtonAvailability final
{
public:
	TArray<class FString>                         ConsolePlatformList;                               // 0x0000(0x0010)(Edit, BlueprintVisible)
	bool                                          CallFunc_Update_Option_Availability_Availability;  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Abstract_GenericButton_C_UpdateButtonAvailability;

}

