#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GenericButton_InfoWarning

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_Abstract_GenericButton_GameFlow_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GenericButton_InfoWarning.WBP_GenericButton_InfoWarning_C
// 0x0050 (0x0E20 - 0x0DD0)
class UWBP_GenericButton_InfoWarning_C final : public UWBP_Abstract_GenericButton_GameFlow_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_GenericButton_InfoWarning_C;    // 0x0DD0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ResetAnimation;                                    // 0x0DD8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverAnimation;                                    // 0x0DE0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_ICN;                                        // 0x0DE8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InputActionKey_Data_C*              BP_InputActionKey_MenuAction;                      // 0x0DF0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Icon;                                          // 0x0DF8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TXT_Title;                                         // 0x0E00(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Title;                                             // 0x0E08(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class USCInputAction*                         Input;                                             // 0x0E18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void ChangeTitle(const class FText& Title_0);
	void ExecuteUbergraph_WBP_GenericButton_InfoWarning(int32 EntryPoint);
	void FocusButton(bool ButtonFocused);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_GenericButton_InfoWarning_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_GenericButton_InfoWarning_C")
	}
	static class UWBP_GenericButton_InfoWarning_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GenericButton_InfoWarning_C>();
	}
};
DUMPER7_ASSERTS_UWBP_GenericButton_InfoWarning_C;

}

