#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Generic_CheckboxEntry

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "WBP_Abstract_GenericButton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Generic_CheckboxEntry.WBP_Generic_CheckboxEntry_C
// 0x00B0 (0x0E70 - 0x0DC0)
class UWBP_Generic_CheckboxEntry_C final : public UWBP_Abstract_GenericButton_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_Generic_CheckboxEntry_C;        // 0x0DC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_SupremeParent;                              // 0x0DC8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              CheckBox;                                          // 0x0DD0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       EntryText;                                         // 0x0DD8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0DE0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateFontInfo                         TextFont;                                          // 0x0DF0(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, HasGetValueTypeHash)
	struct FLinearColor                           BackgroundColorFocused;                            // 0x0E50(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BackgroundColorUnfocused;                          // 0x0E60(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPE_OnClicked();
	void ChangeText(const class FText& Text_0);
	void Construct();
	void ExecuteUbergraph_WBP_Generic_CheckboxEntry(int32 EntryPoint);
	void FocusButton(bool ButtonFocused);
	void PreConstruct(bool IsDesignTime);
	void SetSelectedStyle(bool IsFocused);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Generic_CheckboxEntry_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Generic_CheckboxEntry_C")
	}
	static class UWBP_Generic_CheckboxEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Generic_CheckboxEntry_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Generic_CheckboxEntry_C;

}

