#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BaseTarget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCCore_structs.hpp"
#include "UITargetDisplayDescription_structs.hpp"
#include "Runtime_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BaseTarget.WBP_BaseTarget_C
// 0x00C0 (0x0CC0 - 0x0C00)
#pragma pack(push, 0x1)
class alignas(0x10) UWBP_BaseTarget_C : public UBaseTargetWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FUITargetDisplayDescription            DisplayDescription;                                // 0x0C08(0x0040)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	bool                                          bDebugShowOffScreenMode;                           // 0x0C48(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C49[0x7];                                      // 0x0C49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              DefaultAlignment;                                  // 0x0C50(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           AllyColor;                                         // 0x0C60(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EnemyColor;                                        // 0x0C70(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CanvasSlot;                                        // 0x0C80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              vEllipseRadius;                                    // 0x0C88(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FProjectInViewportResult               ProjectionResult;                                  // 0x0C98(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          ForceOnEllipse;                                    // 0x0CB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void DoHandleDisplayMode(bool bIsOnScreen);
	void ExecuteUbergraph_WBP_BaseTarget(int32 EntryPoint);
	void HandleDisplayMode(const struct FUIInfoDisplayDescription& InDisplayInfos);
	void PreConstruct(bool IsDesignTime);
	void SetWidgetAlignment();
	void SetWidgetPosition(const struct FVector2D& Position);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

	double ComputeDistanceToTarget() const;
	struct FVector GetOffset() const;
	struct FProjectInViewportResult GetProjectionResult() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_BaseTarget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_BaseTarget_C")
	}
	static class UWBP_BaseTarget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BaseTarget_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UWBP_BaseTarget_C;

}

