#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SocialPanel_TabHeaderParty

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SCCore_classes.hpp"
#include "SOS_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SocialPanel_TabHeaderParty.WBP_SocialPanel_TabHeaderParty_C
// 0x00B0 (0x0CA0 - 0x0BF0)
class UWBP_SocialPanel_TabHeaderParty_C final : public USCUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BG_InvitesNotifications;                           // 0x0BF8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon_Social;                                 // 0x0C00(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               InvitesNotifications_Parent;                       // 0x0C08(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         InvitesNotifications_SupremeParent;                // 0x0C10(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InputAction_Data_Clickable_C*       OpenPanelButton;                                   // 0x0C18(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SocialPanel_PartyMemberButton_C*   PartyMember_0;                                     // 0x0C20(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SocialPanel_PartyMemberButton_C*   PartyMember_1;                                     // 0x0C28(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SocialPanel_PartyMemberButton_C*   PartyMember_2;                                     // 0x0C30(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SocialPanel_PartyMemberButton_C*   PartyMember_3;                                     // 0x0C38(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SocialPanel_PartyMemberButton_C*   PartyMember_4;                                     // 0x0C40(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PartyMembers_Box;                                  // 0x0C48(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TXT_HeaderTitle;                                   // 0x0C50(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_VM_CustomPartySystem_C*             BP_VM_CustomPartySystem;                           // 0x0C58(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       InvitationsCount;                                  // 0x0C60(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_CustomMatchSystemViewModel_C*       BP_CustomMatchSystemViewModel;                     // 0x0C68(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_VM_CustomVoiceChat_C*               BP_VM_CustomVoiceChat;                             // 0x0C70(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVoiceChannelMemberViewModel*           VoiceChannelMemberViewModel;                       // 0x0C78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInMatch;                                         // 0x0C80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C81[0x7];                                      // 0x0C81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USizeBox*                               ParentSupreme;                                     // 0x0C88(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_VM_CustomFriendSystem_C*            BP_VM_CustomFriendSystem;                          // 0x0C90(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_SocialPanel_TabHeaderParty(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetSquadVisibility(ESOSClientCustomMatchState eCustomMatchStatus);

	void __115b5d1c_4ac4_d08d_1e57_adb061dfc9a0_SourceToDest(int32* OutputIndex) const;
	void __1a724803_4cac_3100_db10_e0b79982c7d0_SourceToDest(int32* OutputIndex) const;
	void __1ac1c30e_4102_fac5_3017_b8804384f94c_SourceToDest(int32* OutputIndex) const;
	void __203a45d1_48e4_84af_bf83_5a9cc5411d26_SourceToDest(bool* IsOwner) const;
	void __658a904a_4394_d71b_7dc1_9fb4f5eb5530_SourceToDest(class UPartyMemberViewModel** PartyMember) const;
	void __69b01706_4650_e5b2_9474_ceb8ef902186_SourceToDest(bool* IsOwner) const;
	void __6f061834_45a2_d455_5f9b_82be56b3e934_SourceToDest(class UPartyMemberViewModel** PartyMember) const;
	void __7ece07af_4063_6353_5ae8_4ea7cc198047_SourceToDest(class UPartyMemberViewModel** PartyMember) const;
	void __9612f3c9_4ac9_c28f_7c8a_a29c8a8c5ea5_SourceToDest(class UPartyMemberViewModel** PartyMember) const;
	void __ad62fe23_46a3_f6f0_fd78_5bb5dd2e3ebd_SourceToDest(int32* OutputIndex) const;
	void __adfd06ac_4c2c_a806_65bd_e9ba6fe96a56_SourceToDest(bool* IsVisible_0) const;
	void __b3fefe60_40ee_7c07_85c6_98b6367a5c7a_SourceToDest(class UPartyMemberViewModel** PartyMember) const;
	void __c1520176_48c7_a6f4_8044_92980a7ef9de_SourceToDest(bool* IsOwner) const;
	void __c6befb20_4f69_f96a_019f_3eabb91c7d1d_SourceToDest(class FString* Global_Notif_Count) const;
	void __c944efa4_4045_65ef_285a_8dafd224135d_SourceToDest(int32* OutputIndex) const;
	void __e16b39a5_4098_c195_876e_258e00b992d9_SourceToDest(bool* IsOwner) const;
	void __f9464a68_4421_ff9d_693d_da9d7ae61df5_SourceToDest(bool* IsOwner) const;
	void GetGlobalNotifcount(int32 PartyInviteCount, int32 FriendRequestCount, class FString* Global_Notif_Count) const;
	void SetNotificationsVisibility(int32 InvitesCount, int32 FriendRequestCount, bool* IsVisible_0) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_SocialPanel_TabHeaderParty_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_SocialPanel_TabHeaderParty_C")
	}
	static class UWBP_SocialPanel_TabHeaderParty_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SocialPanel_TabHeaderParty_C>();
	}
};
DUMPER7_ASSERTS_UWBP_SocialPanel_TabHeaderParty_C;

}

