#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerBanner_Indicators

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_PlayerBanner_Indicators.WBP_PlayerBanner_Indicators_C.ExecuteUbergraph_WBP_PlayerBanner_Indicators
// 0x0044 (0x0044 - 0x0000)
struct WBP_PlayerBanner_Indicators_C_ExecuteUbergraph_WBP_PlayerBanner_Indicators final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_PlayerBanner_Indicators_C_ExecuteUbergraph_WBP_PlayerBanner_Indicators;

// Function WBP_PlayerBanner_Indicators.WBP_PlayerBanner_Indicators_C.OnMatchViewModelSet
// 0x0020 (0x0020 - 0x0000)
struct WBP_PlayerBanner_Indicators_C_OnMatchViewModelSet final
{
public:
	class UBP_VM_Match_C*                         MatchViewModel;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchPlayerViewModel*                  LocalMatchPlayerViewModel;                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMatchPlayerViewModel*                  CallFunc_Get_Match_Player_View_Model_Notify_MatchPlayerVM; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_PlayerBanner_Indicators_C_OnMatchViewModelSet;

// Function WBP_PlayerBanner_Indicators.WBP_PlayerBanner_Indicators_C.OnPlayerStateSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_PlayerBanner_Indicators_C_OnPlayerStateSet final
{
public:
	class ARuntimePlayerState*                    PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_PlayerBanner_Indicators_C_OnPlayerStateSet;

// Function WBP_PlayerBanner_Indicators.WBP_PlayerBanner_Indicators_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_PlayerBanner_Indicators_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_PlayerBanner_Indicators_C_PreConstruct;

// Function WBP_PlayerBanner_Indicators.WBP_PlayerBanner_Indicators_C.SetBP_PlayerScoreViewModel
// 0x0028 (0x0028 - 0x0000)
struct WBP_PlayerBanner_Indicators_C_SetBP_PlayerScoreViewModel final
{
public:
	class UBP_PlayerScoreViewModel_C*             viewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_PlayerBanner_Indicators_C_SetBP_PlayerScoreViewModel;

// Function WBP_PlayerBanner_Indicators.WBP_PlayerBanner_Indicators_C.SetCaptainVisibility
// 0x0005 (0x0005 - 0x0000)
struct WBP_PlayerBanner_Indicators_C_SetCaptainVisibility final
{
public:
	bool                                          IsCaptain_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_PlayerBanner_Indicators_C_SetCaptainVisibility;

// Function WBP_PlayerBanner_Indicators.WBP_PlayerBanner_Indicators_C.SetMatchPlayerViewModel
// 0x0028 (0x0028 - 0x0000)
struct WBP_PlayerBanner_Indicators_C_SetMatchPlayerViewModel final
{
public:
	class UMatchPlayerViewModel*                  viewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_PlayerBanner_Indicators_C_SetMatchPlayerViewModel;

// Function WBP_PlayerBanner_Indicators.WBP_PlayerBanner_Indicators_C.SetSquadLeaderVisibility
// 0x0005 (0x0005 - 0x0000)
struct WBP_PlayerBanner_Indicators_C_SetSquadLeaderVisibility final
{
public:
	bool                                          IsSquadLeader_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_PlayerBanner_Indicators_C_SetSquadLeaderVisibility;

// Function WBP_PlayerBanner_Indicators.WBP_PlayerBanner_Indicators_C.SetSquadMemberVisibility
// 0x0007 (0x0007 - 0x0000)
struct WBP_PlayerBanner_Indicators_C_SetSquadMemberVisibility final
{
public:
	bool                                          IsSquadMember_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_PlayerBanner_Indicators_C_SetSquadMemberVisibility;

// Function WBP_PlayerBanner_Indicators.WBP_PlayerBanner_Indicators_C.SetTeam
// 0x0004 (0x0004 - 0x0000)
struct WBP_PlayerBanner_Indicators_C_SetTeam final
{
public:
	int32                                         TeamIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_PlayerBanner_Indicators_C_SetTeam;

// Function WBP_PlayerBanner_Indicators.WBP_PlayerBanner_Indicators_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_PlayerBanner_Indicators_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_PlayerBanner_Indicators_C_Tick;

}

