#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GenericButton_InfoWarning

#include "Basic.hpp"

#include "UIBaseColors_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "SCCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_GenericButton_InfoWarning.WBP_GenericButton_InfoWarning_C.ChangeTitle
// 0x0010 (0x0010 - 0x0000)
struct WBP_GenericButton_InfoWarning_C_ChangeTitle final
{
public:
	class FText                                   Title_0;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WBP_GenericButton_InfoWarning_C_ChangeTitle;

// Function WBP_GenericButton_InfoWarning.WBP_GenericButton_InfoWarning_C.ExecuteUbergraph_WBP_GenericButton_InfoWarning
// 0x0250 (0x0250 - 0x0000)
struct WBP_GenericButton_InfoWarning_C_ExecuteUbergraph_WBP_GenericButton_InfoWarning final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputPresetsEnumHandler               K2Node_MakeStruct_InputPresetsEnumHandler;         // 0x0008(0x0050)(HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0058(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0090(0x0078)(ConstParm)
	struct FMappingID                             CallFunc_BPF_MakeMappingID_ReturnValue;            // 0x0108(0x00D0)()
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x01D8(0x0078)(ConstParm)
};
DUMPER7_ASSERTS_WBP_GenericButton_InfoWarning_C_ExecuteUbergraph_WBP_GenericButton_InfoWarning;

// Function WBP_GenericButton_InfoWarning.WBP_GenericButton_InfoWarning_C.FocusButton
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_GenericButton_InfoWarning_C_FocusButton final
{
public:
	bool                                          ButtonFocused;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonTextStyle>           Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonTextStyle>           Temp_class_Variable_1;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonTextStyle>           K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIBaseColors                          CallFunc_GetUIColors_UI_BaseColors;                // 0x002C(0x0154)(HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_3;                           // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_GenericButton_InfoWarning_C_FocusButton;

// Function WBP_GenericButton_InfoWarning.WBP_GenericButton_InfoWarning_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_GenericButton_InfoWarning_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_WBP_GenericButton_InfoWarning_C_OnMouseEnter;

// Function WBP_GenericButton_InfoWarning.WBP_GenericButton_InfoWarning_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct WBP_GenericButton_InfoWarning_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_WBP_GenericButton_InfoWarning_C_OnMouseLeave;

// Function WBP_GenericButton_InfoWarning.WBP_GenericButton_InfoWarning_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_GenericButton_InfoWarning_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_GenericButton_InfoWarning_C_PreConstruct;

}

