#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EndMatchFlow_LigueSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UIRankedLeagues_structs.hpp"
#include "WBP_Abstract_Common_classes.hpp"
#include "UMG_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_EndMatchFlow_LigueSlot.WBP_EndMatchFlow_LigueSlot_C
// 0x0120 (0x0D20 - 0x0C00)
class UWBP_EndMatchFlow_LigueSlot_C final : public UWBP_Abstract_Common_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_EndMatchFlow_LigueSlot_C;       // 0x0C00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       TransformLeague_ANIM;                              // 0x0C08(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeLeague_ANIM;                                   // 0x0C10(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RevealLeague_ANIM;                                 // 0x0C18(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LeagueSelection_ANIM;                              // 0x0C20(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Appearance_ANIM;                                   // 0x0C28(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 LeagueIMG;                                         // 0x0C30(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               LigueSupremeParent;                                // 0x0C38(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         LeagueID;                                          // 0x0C40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         DivID;                                             // 0x0C44(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         WidgetIndex;                                       // 0x0C48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bIsCurrentLeague;                                  // 0x0C4C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_C4D[0x3];                                      // 0x0C4D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             LeagueTexture;                                     // 0x0C50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynMatInst;                                        // 0x0C58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LeagueMainColor;                                   // 0x0C60(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bShouldBeVisible;                                  // 0x0C70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_C71[0x7];                                      // 0x0C71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               DivDynMatInst;                                     // 0x0C78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             LeagueMask;                                        // 0x0C80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             LeagueGlowMask;                                    // 0x0C88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   LeagueName;                                        // 0x0C90(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   DivisionName;                                      // 0x0CA0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FUIRankedLeagues                       SLeagueData;                                       // 0x0CB0(0x0050)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              RevealImpact;                                      // 0x0D00(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bSkipRequested;                                    // 0x0D10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DEBUG_LeagueData();
	void ExecuteUbergraph_WBP_EndMatchFlow_LigueSlot(int32 EntryPoint);
	void FadeLeague();
	void InitSlot();
	void OnTabAppearance(bool bInstant, EUMGSequencePlayMode PlayMode);
	void PreConstruct(bool IsDesignTime);
	void PreLeagueReveal();
	void RefreshSlot(const struct FUIRankedLeagues& SLeagueData_0);
	void SequenceEvent();
	void SequenceEvent__ENTRYPOINTWBP_EndMatchFlow_LigueSlot();
	void SetCurrentLeague(bool bIsCurrentLeague_0, bool bInstant);
	void SkipRequested();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_EndMatchFlow_LigueSlot_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_EndMatchFlow_LigueSlot_C")
	}
	static class UWBP_EndMatchFlow_LigueSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_EndMatchFlow_LigueSlot_C>();
	}
};
DUMPER7_ASSERTS_UWBP_EndMatchFlow_LigueSlot_C;

}

